{"version":"1","records":[{"hierarchy":{"lvl1":"Basic Coalgebraic Logic"},"type":"lvl1","url":"/content/basic-coalgebraic-logic","position":0},{"hierarchy":{"lvl1":"Basic Coalgebraic Logic"},"content":"(draft ... references to be added)","type":"content","url":"/content/basic-coalgebraic-logic","position":1},{"hierarchy":{"lvl1":"Basic Coalgebraic Logic","lvl2":"Idea"},"type":"lvl2","url":"/content/basic-coalgebraic-logic#idea","position":2},{"hierarchy":{"lvl1":"Basic Coalgebraic Logic","lvl2":"Idea"},"content":"We continue from the \n\nintroduction.\n\nLet\n\n\\mathcal X the category of sets\n\n\\mathcal A the category of Boolean algebras\n\nT the powerset functor, Coalg(T) the category of Kripke frames\n\nThen there is a functor\n\nL:BA\\to BA such that Alg(L) is the category of BAOs\n\nwhere BAOs is the category of Boolean algebras with operators, the standard algebraic semantics of classical modal logic.\n\nIn particular,\n\nthe initial L-algebra is (the Lindenbaum-Tarski algebra of) basic modal logic. \n\nMoreover,\n\nLA is the free Boolean algebra over \\Box a, a\\in A module the equations\\begin{align}\n\\Box\\top &= \\top \\\\\n\\Box(a\\wedge b) & = \\Box a\\wedge \\Box b\n\\end{align}","type":"content","url":"/content/basic-coalgebraic-logic#idea","position":3},{"hierarchy":{"lvl1":"Basic Coalgebraic Logic","lvl2":"The category theoretic approach"},"type":"lvl2","url":"/content/basic-coalgebraic-logic#the-category-theoretic-approach","position":4},{"hierarchy":{"lvl1":"Basic Coalgebraic Logic","lvl2":"The category theoretic approach"},"content":"(should this section go into the intro?)\n\nHere are some simplifications that the category theoretic approach offers:\n\nRestricting to the one-step case: TX describes the possible successors, here sets of states. LPX describes one-step modal formulas over sets of successors.  By directly relating TX and LPX we can prove many results of modal logic in a one-step form without ever having to nest modal operators.\n\nRestricting to the finite case: Since Boolean algebras are defined by operations with finite arity, it is enough to describe L on the category BA_\\omega of finite Boolean algebras. (Note that BA_\\omega can also be described as the category of finitely presentable BAs and the category of finitely generated BAs.) This has the benefit that we can make explicit use of the fact that Set_\\omega and BA_\\omega are dually equivalent.\n\nIn both situations, the move from the special case to the general case can then be performed by appealing to generic categorical techniques.\n\nThe category theoretic approach has also the advantage that the duality of T and L yields, once established, a range of results such as\n\ninvariance under bisimilarity\n\ncompleteness\n\nexpressiveness (Hennessy-Milner, bisimulation somewhere else, ...)\n\nnormal forms\n\nproof systems\n\ndecidability\n\ncomplexity\n\nWe need to emphasise that the best results of the coalgebraic approach to modal logic generalise the results from basic modal logic from Kripke frames to other functors T on a category of “spaces” \\mathcal X. Thus, when we talk about completeness, decidability, complexity, etc this refers to the logics of the functors, not to more general logics that are obtained by adding additional axioms to these logics.\n\n(We need to elaborate on the last point above somewhere!)","type":"content","url":"/content/basic-coalgebraic-logic#the-category-theoretic-approach","position":5},{"hierarchy":{"lvl1":"Basic Coalgebraic Logic","lvl2":"Finding the logic of a functor"},"type":"lvl2","url":"/content/basic-coalgebraic-logic#finding-the-logic-of-a-functor","position":6},{"hierarchy":{"lvl1":"Basic Coalgebraic Logic","lvl2":"Finding the logic of a functor"},"content":"Starting from a functor T:Set\\to Set, what is the modal logic of T-coalgebras?\n\nAccording to the discussion above, the task is to find a functor L:BA\\to BA such that, restricted to finite sets and finite Boolean algebras, L is the dual of T. More precisely, we have to find L and \\delta such that\\delta:LP\\to PT\n\nis an isomorphism. \n\nWe do this in two steps. The first step is to describe\\delta':L'P\\to PT\n\nfor L'P being freely generated by enough modal operators so that \\delta' is injective. This means that the logical one-step language L' is expressive enough to describe all elements of PTX uniquely.\n\nThe second step is then to quotientL'P\\to LP\n\nin such a way thatPT\\to L'P\\to LP\n\nbecomes an isomorphism. This quotient then describes the axioms of the modal logic. Completeness, as well as other nice properties of the modal logic L then follow for free from the category theoretic approach hinted at in the previous subsection.\n\nHow general is this methodology?\n\nIn order to find a nice presentation of L by generators (modal operators) and relations (modal axioms) one, of course, needs to understand the particular functor T and this can require a lot of work. But there are general theorems that for all functors T there exists a functor L. And, conversely, all functors preserving so-called sifted colimits describe a modal logic given by operations and equations.","type":"content","url":"/content/basic-coalgebraic-logic#finding-the-logic-of-a-functor","position":7},{"hierarchy":{"lvl1":"Basic Coalgebraic Logic","lvl2":"Finding the logic of the powerset functor"},"type":"lvl2","url":"/content/basic-coalgebraic-logic#finding-the-logic-of-the-powerset-functor","position":8},{"hierarchy":{"lvl1":"Basic Coalgebraic Logic","lvl2":"Finding the logic of the powerset functor"},"content":"Let T=\\mathcal P be the powerset functor. T-coalgebras are precisely Kripke frames.","type":"content","url":"/content/basic-coalgebraic-logic#finding-the-logic-of-the-powerset-functor","position":9},{"hierarchy":{"lvl1":"Basic Coalgebraic Logic","lvl3":"Step 1: The Language and Modal Operations","lvl2":"Finding the logic of the powerset functor"},"type":"lvl3","url":"/content/basic-coalgebraic-logic#step-1-the-language-and-modal-operations","position":10},{"hierarchy":{"lvl1":"Basic Coalgebraic Logic","lvl3":"Step 1: The Language and Modal Operations","lvl2":"Finding the logic of the powerset functor"},"content":"For now we side-step the question of how to find the language. We start from the language we know and love, namely the one given by one modal operation \\Box. We also know the standard Kripke semantics of the \\Box via sets of successors. The aim is to show a methodology of how to find the axioms.\n\nThe functor L' is represented by the language without the axioms. It is defined as\\begin{align}\nL':BA& \\to BA\\\\\n A & \\mapsto F\\{\\Box a \\mid a\\in A\\}\n\\end{align}\n\nwhere FX denotes the free Boolean algebra over X. Categorically F is the left adjoint of the forgetful functor U:BA\\to Set.\n\nThe semantics of the language is given by\\begin{align}\n\\delta'_X:L'PX & \\to PTX\\\\\n           \\Box a & \\mapsto \\{S\\in PTX \\mid S\\subseteq a\\}\n\\end{align}\n\nThis definition expresses that a set of successors S satisfies \\Box a if the S is contained in a.\n\nTo regain the usual semantics with respect to Kripke frames (ie T-coalgebras) consider a coalgebra \\xi:X\\to TX. Note the following, where P\\xi denotes the inverse image of \\xi:\n\nThe collection \\Phi of all modal formulas is the initial L-algebra L\\Phi\\to\\Phi.\n\nLPX\\stackrel{\\delta'_X}{\\longrightarrow} PTX\\stackrel{P\\xi}{\\longrightarrow} PX is what is known as the “complex algebra” of (X,\\xi) in modal logic.\n\nThe universal property of the initial algebra induces a unique\\sem{-}:\\Phi\\to PX\n\ninterpreting formulas as subsets of X.\n\nSpelling this out in detail, gives us back the usual definition of the semantics of modal logic:\\begin{align}\n\\sem{\\top} & = X\\\\\n\\sem{\\phi\\wedge \\psi} & = \\sem{\\phi}\\wedge\\sem{\\psi}\\\\\n\\sem{\\neg\\phi} & = X\\setminus \\sem{\\phi}\\\\\n\\sem{\\Box\\phi} & = \\{x\\in X\\mid \\xi(x)\\in \\sem{\\phi}\\}\\\\\n\\end{align}\n\nThe first three lines come from \\sem{-} being a Boolean algebra morphism and the fourth one from being an L-algebra morphism.","type":"content","url":"/content/basic-coalgebraic-logic#step-1-the-language-and-modal-operations","position":11},{"hierarchy":{"lvl1":"Basic Coalgebraic Logic","lvl3":"Step 2: Finding the Normal Form of Operations","lvl2":"Finding the logic of the powerset functor"},"type":"lvl3","url":"/content/basic-coalgebraic-logic#step-2-finding-the-normal-form-of-operations","position":12},{"hierarchy":{"lvl1":"Basic Coalgebraic Logic","lvl3":"Step 2: Finding the Normal Form of Operations","lvl2":"Finding the logic of the powerset functor"},"content":"We now turn to the task of finding the axioms via normal forms. This involves finding a mapnf: PTX\\to L'PX\n\nsuch that \\delta'\\circ nf = id. Since PTX is a Boolean algebra, it is enough to define nf on generators and since we can assume X to be finite, it is enough to give nf on singletons \\{t\\} with t\\in TX. Since T=\\mathcal P, t is a subset of X.\n\nThus, the task is to find a formula in L'PX that expresses t\\in TX. This formula is well-known in modal logic\n\n(what are the historical references?)\\sem{...}\n\nMore precisely, the initial L-algebra will be the Lindenbaum-Tarski algebra of classical modal logic with no atomic propositions. To account for a set of atomic proposisions, one takes the free L-algebra over the Boolean algebra freely generated by the set of atomic propositions.\n\nMore precisely, LPX has formulas in which every generator a\\in PX is under the scope of exactly one modal operation. For example \\Box(a\\wedge b) is of rank 1 but neither are a\\to \\Box a nor \\Box\\Box a\\to \\Box a. Intuitively, a\\to \\Box a expresses a relationship between states in X and TX and \\Box\\Box a\\to \\Box a between states in TTX and TX, whereas formulas in LPX express only relationships between states in TX.\n\nPT and LP are functors Set\\to BA. Hence \\delta should be an arrow in the category of functors Set\\to BA, that is, we require \\delta to be a natural transformation such that all components \\delta_X:PTX\\to LPX are isomorphisms.","type":"content","url":"/content/basic-coalgebraic-logic#step-2-finding-the-normal-form-of-operations","position":13},{"hierarchy":{"lvl1":"Boolean Logic for Set-Coalgebras"},"type":"lvl1","url":"/content/boolean-logic-for-set-coalgebras","position":0},{"hierarchy":{"lvl1":"Boolean Logic for Set-Coalgebras"},"content":"We build on concepts and examples explained previously, but try to keep this section self-contained from a technical point of view.\n\nWe specialise the setting from \n\nCoalgebraic Logic: Introduction as follows:\n\na functor T:Set \\to Set\n\na functor L:{\\sf BA} \\to {\\sf BA}\n\nF\\dashv U:{\\sf BA} \\to Set\n\nP:Set\\to BA given by PX=2^X\n\nS:BA\\to Set given by SA=BA(A,2)\n\n\\delta_X: LPX\\to PTX\n\nWe have seen previously that modal logics for T-coalgebras can be described by giving L and \\delta.\n\nConversely, \n\nevery sifted colimit preserving functor on a variety has a presentation and hence gives rise to a modal logic. Before we see how this works let us state some results needed later.\n\nProposition: Let L be a sifted colimit preserving functor on {\\sf BA}. There is a functor L' that agrees with L on all non-trivial algebras and preserves filtered colimits. Moreover Alg(L)\\cong Alg(L').\n\nLemma: Let H be a functor on {\\sf BA} and L a sifted colimit preserving functor on {\\sf BA} and LFn=HFn for all finitely generated free Boolean algebras Fn. Then LA=HA for all finite non-trivial algebras A.\n\nProof: Every finite non-trivial Boolean algebra is a retract of a finitely generated free one.","type":"content","url":"/content/boolean-logic-for-set-coalgebras","position":1},{"hierarchy":{"lvl1":"Boolean Logic for Set-Coalgebras","lvl2":"The logic of L"},"type":"lvl2","url":"/content/boolean-logic-for-set-coalgebras#the-logic-of-l","position":2},{"hierarchy":{"lvl1":"Boolean Logic for Set-Coalgebras","lvl2":"The logic of L"},"content":"As promised, we are going to show that  every sifted colimit preserving functor on a variety has a presentation and hence gives rise to a modal logic.\n\nEvery sifted colimit preserving functor L on a variety is a quotientFGUA\\stackrel {q_A} \\longrightarrow LA\n\nwhere GX=\\coprod_{n\\in\\mathbb N}ULFn\\times X^n. Since F is a left adjoint, the morphism q_A is the adjoint transpose of a morphismGUA \\longrightarrow ULA\n\nwhich determines (and is determinedy by) the following modal logic.\n\nThe n-ary modal operators \\sigma are the elements of ULFn.\n\nq_A maps (\\sigma,v:n\\to UA) to L(v^\\dagger)(\\sigma) where v^\\dagger is the adjoint transpose of v.\n\nThe equations in n variables are the kernel of q_{Fn}.\n\nIn particular the (\\sigma,v:n\\to UA) are modal formulas\\Delta(a_1,\\ldots a_n)\n\nwhere \\Delta=\\sigma and a_i=v(i).\n\nThe set \\Sigma of operations and the set E of equations constitute the presentation \\langle\\Sigma_L,E_L\\rangle of L.\n\nExample: The variety of Boolean algebras with operator (BAO) is presented by the operations and equations of Boolean algebra plus a unary operation \\Box and two equations specifying that \\Box preserves finite meets.","type":"content","url":"/content/boolean-logic-for-set-coalgebras#the-logic-of-l","position":3},{"hierarchy":{"lvl1":"Boolean Logic for Set-Coalgebras","lvl2":"Moss’s coalgebraic logic"},"type":"lvl2","url":"/content/boolean-logic-for-set-coalgebras#mosss-coalgebraic-logic","position":4},{"hierarchy":{"lvl1":"Boolean Logic for Set-Coalgebras","lvl2":"Moss’s coalgebraic logic"},"content":"The first proposal for a logic of coalgebras parametric in the coalgebra functor T was Moss’s coalgebraic logic. It can be obtained by defining L via a presentationFGUA\\stackrel {q_A} \\longrightarrow LA\n\nwhere G=T. Originally, Moss’s logic did not have equations, which corresponds to taking the q_{Fn} to be identities. This use of the functor T itself as a syntax constructor for a logic yields a very interesting presentation. This presentation is equivalent in expressiveness (in case T preserves weak pullbacks) to the ones we know from classical modal logic, but is quite different in terms of the opportunities it offers as a logical tool. For more see the section on \n\nMoss’s Coalgebraic Logic.","type":"content","url":"/content/boolean-logic-for-set-coalgebras#mosss-coalgebraic-logic","position":5},{"hierarchy":{"lvl1":"Boolean Logic for Set-Coalgebras","lvl2":"The logic of all predicate liftings"},"type":"lvl2","url":"/content/boolean-logic-for-set-coalgebras#the-logic-of-all-predicate-liftings","position":6},{"hierarchy":{"lvl1":"Boolean Logic for Set-Coalgebras","lvl2":"The logic of all predicate liftings"},"content":"Pattinson introduced \n\npredicate liftings to give a parametric treatment of coalgebraic logic that includes classical modal logic as an example. The logic of all predicate liftings can be defined in our setting in a natural way.\n\nRemark: Note that Moss’s logic is defined by applying T directly to syntax, whereas here we want to use the duality given by S:{\\sf BA} \\to Set and P:Set\\to{\\sf BA} to keep T on the semantic side of the duality. In fact, we might have been tempted to simply define L = PTS and while this is still the guiding idea, this direct approach is only suitable if we start from a dual equivalence of base categories such as the one given by complete atomic Boolean algebras and Set or the one given by Boolean algebras and Stone spaces. Moreover, defining L=PTS will not, in general, result in a sifted colimit preserving functor and, thus, not, in general, allow us to find a finitary presentation of Alg(L) by operations and equations.","type":"content","url":"/content/boolean-logic-for-set-coalgebras#the-logic-of-all-predicate-liftings","position":7},{"hierarchy":{"lvl1":"Boolean Logic for Set-Coalgebras","lvl3":"Syntax","lvl2":"The logic of all predicate liftings"},"type":"lvl3","url":"/content/boolean-logic-for-set-coalgebras#syntax","position":8},{"hierarchy":{"lvl1":"Boolean Logic for Set-Coalgebras","lvl3":"Syntax","lvl2":"The logic of all predicate liftings"},"content":"We define L=PTS on finitely generated free algebras:LFn = PTSFn\n\nWe extend L to all algebras via sifted colimits (hence L preserves sifted colimits by definition).\n\nMoreover, ULFn=UPTSFn is the set of all n-ary predicate liftings:\\begin{align}\nUPTSFn &\\cong UPT(2^n) \\\\\n&= 2^{T(2^n)} \\\\\n&\\cong Nat({(2^n)}^X,2^{TX}) \\\\\n&\\cong Nat({(2^X)}^n,2^{TX}) \\\\\n\\end{align}\n\nSince L preserves sifted colimits it has a \n\npresentation by operations and equations and this presentation presents L by all predicates liftings asFGUA\\stackrel {q_A} \\longrightarrow LA\n\nwhere GX=\\coprod_{n\\in\\mathbb N}ULFn\\times X^n.","type":"content","url":"/content/boolean-logic-for-set-coalgebras#syntax","position":9},{"hierarchy":{"lvl1":"Boolean Logic for Set-Coalgebras","lvl3":"Semantics","lvl2":"The logic of all predicate liftings"},"type":"lvl3","url":"/content/boolean-logic-for-set-coalgebras#semantics","position":10},{"hierarchy":{"lvl1":"Boolean Logic for Set-Coalgebras","lvl3":"Semantics","lvl2":"The logic of all predicate liftings"},"content":"The semantics \\delta_X:LPX\\to PTX is given as follows.\n![](\n\nhttps://​hackmd​.io​/​_uploads​/HJHa0kb2o​.png =500x)\n\nEvery PX is a sifted colimit c_i:Fn\\to PX. Let c_i^\\ast be the adjoint transpose. Since L preserves sifted colimits and since PTc_i^\\ast is a cocone, \\delta_X is well-defined.\n\nIn more detail, c_i:Fn\\to PX is also a valuation of variable v:n\\to UPX or also a tuple (a_1,\\ldots a_n) of subsets of X. Its adjoint transpose X\\to SFn combines the characteristic functions \\chi_i of all the subsets a_i into one function X\\to 2^n, x\\mapsto \\langle\\chi_1,\\ldots\\chi_n\\rangle. Now, given a modal operator \\Delta\\in UPTSFn = 2^{T{(2^n)}} we have that PTc_i^\\ast(\\Delta) isTX\\stackrel{Tc_i^\\ast}\\longrightarrow T(2^n)\\stackrel\\Delta\\longrightarrow 2\n\nwhich, as expected, coincides with the semantics of a modal operator as a predicate lifting.\n\nRemark: Using the Lemma above (which is special to the category {\\sf BA}), we do not need to go via the finitely generated free algebras Fn and can define \\delta_X for finite X directly as the isomorphismLPX=PTSPX\\cong PTX\n\nwhich, in terms of the presentation of L by modal operators, corresponds to\\begin{align}\n\\delta_X: LPX & \\to PTX\\\\\n\\Delta(a_1,\\ldots a_n) &\\mapsto \\Delta(a_1,\\ldots a_n)\n\\end{align}\n\nwhere\n\non the left \\Delta(a_1,\\ldots a_n) is understood as syntax, that is, \\Delta\\in UPTSFn and (a_1,\\ldots a_n)\\in (UPX)^n and\n\non the right \\Delta(a_1,\\ldots a_n) is evaluated by taking the predicate lifting \\Delta as a function {(2^X)}^n \\to 2^{TX}, that is, as a function (UPX)^n\\to UPTX.","type":"content","url":"/content/boolean-logic-for-set-coalgebras#semantics","position":11},{"hierarchy":{"lvl1":"Boolean Logic for Set-Coalgebras","lvl2":"From Funtors to Predicate Liftings and Back"},"type":"lvl2","url":"/content/boolean-logic-for-set-coalgebras#from-funtors-to-predicate-liftings-and-back","position":12},{"hierarchy":{"lvl1":"Boolean Logic for Set-Coalgebras","lvl2":"From Funtors to Predicate Liftings and Back"},"content":"Every sifted colimit preserving functor L with a semantics \\delta:LP\\to PT can be represented by predicate liftings. Conversely, each set of predicate liftings presents a functor together with a semantics. We summarize this corrspondence.\n\nStarting with a functor L, its presentation FGU\\to L and its semantics LP\\to PT, we obtain its presentation by predicate liftings in the last line, where \\Delta ranges over all elements of G_n. Conversely, any collection of predicate liftings \\Delta defines a functor L obtained from “climbing the ladder up” and quotienting the corresponding FGUPX\\to PTX.","type":"content","url":"/content/boolean-logic-for-set-coalgebras#from-funtors-to-predicate-liftings-and-back","position":13},{"hierarchy":{"lvl1":"Boolean Logic for Set-Coalgebras","lvl2":"References"},"type":"lvl2","url":"/content/boolean-logic-for-set-coalgebras#references","position":14},{"hierarchy":{"lvl1":"Boolean Logic for Set-Coalgebras","lvl2":"References"},"content":"Kurz-Rosicky: \n\nStrongly Complete Logics for Coalgebras, 2012.\n\nDiagrams:\n\nSemantics of L\n\nFrom L to \\Delta (and back)","type":"content","url":"/content/boolean-logic-for-set-coalgebras#references","position":15},{"hierarchy":{"lvl1":"Chen’s Category CoLog"},"type":"lvl1","url":"/content/colog","position":0},{"hierarchy":{"lvl1":"Chen’s Category CoLog"},"content":"(under construction)\n\nIn his PhD thesis Liang-Ting Chen studies the category CoLog which has one-step semantics LP\\to PT as objects.\n\n(to be continued)","type":"content","url":"/content/colog","position":1},{"hierarchy":{"lvl1":"Chen’s Category CoLog","lvl2":"References"},"type":"lvl2","url":"/content/colog#references","position":2},{"hierarchy":{"lvl1":"Chen’s Category CoLog","lvl2":"References"},"content":"","type":"content","url":"/content/colog#references","position":3},{"hierarchy":{"lvl1":"Coalgebraic (Bi)Similarity"},"type":"lvl1","url":"/content/coalgebraic-bisimilarity","position":0},{"hierarchy":{"lvl1":"Coalgebraic (Bi)Similarity"},"content":"(draft ... references to be added)\n\nOne of the main contributions of coalgebra to computer science is to provide the minimal abstract setting allowing us to account for various different notions of simulation and bisimulation in a uniform way with the help of a single simple parameter, that of a functor T on a category \\mathcal C.\n\nThe objects of the category \\mathcal C represent the possible state spaces and the functor T represents the possible one-step transitions states can take.\n\nSince (bi)simulation is a relationship betweeen states, the category \\mathcal C should be the category of sets, or of sets with additional structure. The theory of (bi)similarity is not part of the theory of coalgebras that can be developed over arbitrary categories \\mathcal C. \n\nIn the following we will define bisimilarity for set-coalgebras and then look at (bi)similarity for coalgebras over other base categories.","type":"content","url":"/content/coalgebraic-bisimilarity","position":1},{"hierarchy":{"lvl1":"Coalgebraic (Bi)Similarity","lvl2":"Bisimilarity for Set-Coalgebras"},"type":"lvl2","url":"/content/coalgebraic-bisimilarity#bisimilarity-for-set-coalgebras","position":2},{"hierarchy":{"lvl1":"Coalgebraic (Bi)Similarity","lvl2":"Bisimilarity for Set-Coalgebras"},"content":"Every functor T:\\sf Set\\to Set induces a notion of T-bisimilarity on elements of T-coalgebras X\\to TX.\n\nDefinition: Bisimilarity (behavioural equivalence) \\simeq is the smallest equivalence relation between elements (x,X\\to TX) of coalgebras induced by pairs(x,X\\to TX)\\  \\simeq\\  (f(x),Y\\to TY)\n\nwhere f:X\\to TX is a coalgebra morphism.\n\nIntuitively, bisimilarity captures that what is preserved by homomorphisms. \n\nRemark (2nd Definition): Equivalently, this definition can be formulated using cospans. Two elements of two coalgebras are bisimilar (behaviourally equivalent)(x,X\\to TX)\\  \\simeq\\  (y,Y\\to TY)\n\nif there are coalgebra morphism f,g with f(x)=g(y).\n\nThe second definition has the advantage that one does not need to close under transitivity. The first definition has the advantage that it is more conceptual and makes the connection of bisimilarity with the final coalgebra more direct, as we are going to see now.\n\nObservation: The equivalence classes of bisimilarity are the connected components of the \n\ncategory of elements of the forgetful functor {\\sf Coalg}( T)\\to \\sf Set.\n\nRecall that colimits in the category of sets can be computed by taking a disjoint sum and then quotienting by connected components. \n\nThis implies, together with the Definition and the Observation, that the colimit of the forgetful functor quotients the disjoint sum of all coalgebras by bisimilarity, yielding the final coalgebra. \n\nProp: The final coalgebra (if it exists ) is the colimit of the forgetful functor  U:{\\sf Coalg}( T)\\to \\sf Set.\n\nProof: Let Z={\\sf colim}\\,U. The coalgebra structure Z\\to TZ is given by the universal property of the colimit. Moreover, by Z having a cocone c over U, for every X\\to TX there is a morphism c_X:X\\to Z. In particular, there is c_Z:Z\\to Z. It follows from Z being a colimit that c_Z is the identity. But this implies that all coalgebra morphisms f:X\\to Z are equal to c_X. Hence there is precisely one coalgebra morphism X\\to Z and Z\\to TZ is the final coalgebra.\n\nRemark: This proof is a variation of Lemma 1 in Chapter X of Mac Lane, which shows that the limit of the identity functor is the initial object (and the colimit of the identity functor is the terminal object).","type":"content","url":"/content/coalgebraic-bisimilarity#bisimilarity-for-set-coalgebras","position":3},{"hierarchy":{"lvl1":"Coalgebraic (Bi)Similarity","lvl2":"(Bi)similarity for Ordered Coalgebras"},"type":"lvl2","url":"/content/coalgebraic-bisimilarity#id-bi-similarity-for-ordered-coalgebras","position":4},{"hierarchy":{"lvl1":"Coalgebraic (Bi)Similarity","lvl2":"(Bi)similarity for Ordered Coalgebras"},"content":"We briefly indicate that essentially the same approach to bisimilarity works for coalgebras over ordered sets (preorders or posets). \n\nLet T:\\sf Ord\\to Ord be a functor.\n\nDefinition: Two elements of two coalgebras are (bi)similar(x,X\\to TX)\\  \\lesssim\\  (y,Y\\to TY)\n\nif there are coalgebra morphism f,g such that f(x)\\le g(y).\n\nColimits in preorders are computed as in \\sf Set with the preorder on the colimit being the smallest preorder compatible with the preorders on the components. Colimits in posets additionally quotient by \n\nantisymmetry.\n\nWe can adapt the category of elements to the ordered setting. Then (bi)similarity is the smallest preorder on the category of elements generated by “connections between components” and the “preorders inside components”.\n\nAs before we obtain\n\nProp: The final coalgebra (if it exists) is the colimit of the forgetful functor  {\\sf Coalg}( T)\\to \\sf Ord.","type":"content","url":"/content/coalgebraic-bisimilarity#id-bi-similarity-for-ordered-coalgebras","position":5},{"hierarchy":{"lvl1":"Coalgebraic (Bi)Similarity","lvl2":"Other Base Categories"},"type":"lvl2","url":"/content/coalgebraic-bisimilarity#other-base-categories","position":6},{"hierarchy":{"lvl1":"Coalgebraic (Bi)Similarity","lvl2":"Other Base Categories"},"content":"One could continue here with looking at other base categories such as metric spaces, topological spaces, nominal sets, various categories of algebras, ...\n\nI don’t do this (for now) because the literature is big and growing and the new interesting phenomena that arise are particular to the base category one chooses.","type":"content","url":"/content/coalgebraic-bisimilarity#other-base-categories","position":7},{"hierarchy":{"lvl1":"Coalgebraic (Bi)Similarity","lvl2":"References"},"type":"lvl2","url":"/content/coalgebraic-bisimilarity#references","position":8},{"hierarchy":{"lvl1":"Coalgebraic (Bi)Similarity","lvl2":"References"},"content":"Modal Logic: van Benthem, Segerberg, Goldblatt, ...\n\nConcurrency: Park, Milner, van Glabbeek, Panangaden, ...\n\nCoalgebra: Aczel, Aczel-Mendler, Barr, Rutten, Worrell, Kurz, Staton, Hughes-Jacobs, Balan-Kurz-Velebil, ...\n\nMac Lane: Categories for the Working Mathematician. 1971.\n\nThis can be seen from the fact that the theory of coalgebras over \\mathcal C is  the theory of algebras over \\mathcal C^{\\rm op}. But the theory that can be developed simultaneously for algebra and coalgebra is quite small in the sense that it excludes most features that are of particular interest to the algebraist or the coalgebraist. Intuitively, the intersection of algebra and coalgebra only consists of those “systems” that can be defined by unary operations such as deterministic automata or, more generally, presheaves.\n\nThis notion makes sense in any category which has a forgetful functor to \\sf Set. Why is it trivial for categories of algebras?\n\nExercise: Let D:\\mathcal I\\to \\sf Set be a functor. Form the disjoint sum S of all D(i), i\\in\\mathcal I. Connect (x,Di) with (y,Dj) if there is f:i\\to j in \\mathcal I such that f(x)=y. Then the connected components of S are the colimit of D.\n\nFor a deeper understanding of final coalgebras, it is instructive to study the proof of the General Adjoint Functor Theroy as it appears in Mac Lane and then the proof of the final coalgebra theorem of Aczel-Mendler. Further contributions to this topic are in papers by Barr, by Adamek-Milius-Velebil and others. Much of this work resolves around the question of what are the most elegant side conditions that allow us to cope with situations where the final coalgebra does not exist in the category of coalgebras. (Footnote: Aczel-Mendler showed that for all set-functors there is a final coalgebra that classifies bisimilarity for all set-coalgebras and the carrier of which is a proper class. I find this still the most elegant formulation of the size problem in coalgebra as it shows exactly where the distinction between set and proper class comes in.)\n\nAs shown by Aczel-Mendler, the final coalgebra always exists if one allows coalgebras on proper classes (as opposed to only sets).\n\nIt is well known, in the classic case of the Kripke frames (coalgebras for the powerset functor), that to ask that x,y are bisimilar is a stronger requirement than to ask that x,y are forward and backward bisimilar. Accordingly, it does make a difference whether we take, for example, the final upset-coalgebra over preorders or posets. Over preorders equality in the final coalgebra is bisimilarity and the preorder captures forward-simulation. Over posets, equality means the existence of a forward-simulation in both directions.","type":"content","url":"/content/coalgebraic-bisimilarity#references","position":9},{"hierarchy":{"lvl1":"Completeness"},"type":"lvl1","url":"/content/completeness","position":0},{"hierarchy":{"lvl1":"Completeness"},"content":"","type":"content","url":"/content/completeness","position":1},{"hierarchy":{"lvl1":"Expressive Predicate Liftings"},"type":"lvl1","url":"/content/expressive-predicate-liftings","position":0},{"hierarchy":{"lvl1":"Expressive Predicate Liftings"},"content":"(draft ... references to be added)\n\nFor every functor T:\\sf Set\\to Set there is a natural transformation (n runs over all positive integers and the product is taken over all finitary predicate liftings)TX\\to \\prod 2^{({2^n}^X)}\n\nwhich, for a choice of predicate lifting \\triangle: T(2^n)\\to 2 and predicate \\phi:X\\to 2^n, appliesTX\\stackrel {T\\phi} \\longrightarrow T(2^n)\\stackrel\\triangle\\longrightarrow 2\n\nto elements of  TX.\n\nProposition: The natural transformation is injective on all finite X\\not=\\emptyset. \n\nProof: Let s\\not=t\\in TX. We have to show that there are n, \\phi and \\triangle such that \\triangle(T\\phi(s))\\not=\\triangle(T\\phi(t)). We choose n and \\phi so that \\phi:X\\to 2^n is injective. Since X\\not=\\emptyset it follows that also T\\phi is injective, that is, T\\phi(s)\\not= T\\phi(t). Finally, we choose some \\triangle:T(2^n)\\to 2 that separates the two.\n\nRemark: This proofs shows that any two distinct elements of TX are separated by some predicate X\\to 2^n and predicate lifting T(2^n)\\to 2.\n\nRemark: For finitary functors T we can drop the restriction to finite sets.\n\nCorollary: For a finitary functor T:\\sf Set\\to Set the logic of all predicate liftings is expressive in the sense that for any two non-bisimular points there is a distinguishing formula.\n\n(I can add a proof sketch if that turns out to be of interest.)","type":"content","url":"/content/expressive-predicate-liftings","position":1},{"hierarchy":{"lvl1":"Expressive Predicate Liftings","lvl2":"References"},"type":"lvl2","url":"/content/expressive-predicate-liftings#references","position":2},{"hierarchy":{"lvl1":"Expressive Predicate Liftings","lvl2":"References"},"content":"The results of this section are due to\n\nLutz Schroeder: \n\nExpressivity of coalgebraic modal logic. 2008.\n\nAn axiomatic approach generalising to other categories than Set was presented by\n\nBartek Klin: \n\nlink text\n\nThe results can also be extended to the poset-enriched situation\n\nKapulkin, Kurz, Velebil: \n\nlink text\n\nwhere expressivity is the stronger property that the logic does not only detect bisimulation but also simulation.\n\nOne can eliminate this proviso X\\not=\\emptyset by restricting to standard functors. Every set functor has a canonical standard functor which, moreover, induces an equivalent category of coalgebras.","type":"content","url":"/content/expressive-predicate-liftings#references","position":3},{"hierarchy":{"lvl1":"Expressivity"},"type":"lvl1","url":"/content/expressivity","position":0},{"hierarchy":{"lvl1":"Expressivity"},"content":"(not even draft)\n\n...\n\nDefinition: A coalgebraic logic is expressive if for any two non-bisimilar states there is a formula distinguishing them.\n\n...","type":"content","url":"/content/expressivity","position":1},{"hierarchy":{"lvl1":"Expressivity","lvl2":"References"},"type":"lvl2","url":"/content/expressivity#references","position":2},{"hierarchy":{"lvl1":"Expressivity","lvl2":"References"},"content":" introduces the notion of a separating set of predicate liftings and uses induction along the terminal coalgebra sequence, based on work by \n\n\n\nWorrell (2005), to show that if T:Set\\to Set is finitary (or \\kappa-accessible) and the set of predicate liftings is separating then the coalgebraic logic generated from the predicate liftings, finitary (\\kappa-ary) conjunctions and negation is expressive.\n\n showed that the logic of all predicate liftings is expressive for any finitary functor T:Set\\to Set.\n\n showed that the proofs of Pattinson and Schröder can be done at the level of abstraction of functorial modal logic if the mate of the semantics \\delta is mono. Klin’s method generalizes beyond sets and Boolean algebras and  provide a number of concrete examples of how it can be applied to various dynamical systems and their logics.\n\n shows that the logic of all monotone predicate liftings is expressive for every finitary, locally monotone, embedding-preserving poset-functor.\n\n studies the expressivity of many-valued logics for set-coalgebras given by predicate liftings.\n\n...","type":"content","url":"/content/expressivity#references","position":3},{"hierarchy":{"lvl1":"Expressivity","lvl2":"References"},"type":"lvl2","url":"/content/expressivity#references-1","position":4},{"hierarchy":{"lvl1":"Expressivity","lvl2":"References"},"content":" introduces the notion of a separating set of predicate liftings and uses induction along the terminal coalgebra sequence, based on work by \n\n\n\nWorrell (2005), to show that if T:Set\\to Set is finitary (or \\kappa-accessible) and the set of predicate liftings is expressive then the coalgebraic logic generated from the predicate liftings, finitary (\\kappa-ary) conjunctions and negation is expressive.\n\n showed that the logic of all predicate liftings is expressive for any finitary functor T:Set\\to Set.\n\n showed that the proofs of Pattinson and Schr{\"o}der can be done at the level of abstraction of functorial modal logic using if the mate of the semantics \\delta is mono. Klin’s method generalizes beyond sets and Boolean algebras and  provide a number of concrete examples of how it can be applied to various dynamical systems and their logics.","type":"content","url":"/content/expressivity#references-1","position":5},{"hierarchy":{"lvl1":"Introduction"},"type":"lvl1","url":"/content/introduction-to-coalgebraic-logic","position":0},{"hierarchy":{"lvl1":"Introduction"},"content":"(draft ... references to be added)\n\nWe assume here that the reader has seen some propositional and modal logic and is interested in how Kripke structures  can be generalised to coalgebras. Coalgebraic logic can be seen as generalising modal logic along the following parameters:\n\n\\mathcal X, a category whose objects are state spaces,\n\nT:\\mathcal X\\to\\mathcal X, a “type” functor specifying the type of dynamics,\n\n\\mathcal A, a category whose objects are propositional theories,\n\nL:\\mathcal A \\to \\mathcal A, a “logic” functor specifying modal operators and their axioms,\n\na contravariant adjunction relating the logic (\\mathcal A,L) and the semantics (\\mathcal X,T).\n\nTo go through this in detail will take some time. Let us start by sketching how coalgebras generalise Kripke structures.\n\nThe notion of coalgebra is parameterised by that of a functor T:\\mathcal X\\to \\mathcal X on some category of “spaces” \\mathcal X. An object X\\in\\mathcal X generalises the set X of worlds of a Kripke frame, T represents the type of transitions and the relation R of a Kripke frame (X,R) is a coalgebra X\\to TX when TX=\\mathcal PX is the set of subsets of X.\n\nSimilarly, modal logics can be parameterised by functors L  accounting for both modal operators such as \\Box and \\Diamond and axioms such as \\Box preserving meets and \\Diamond preserving joins.\n\nDuality theory can be used to develop the theory of coalgebras together with their modal logics. In fact, often the functors T and L will be dual to each other in a precise mathematical sense, giving rise to automatic soundness, completeness and expressiveness results.\n\nIn the following we summarise the basic ingredients necessary to carry out this approach.\n\nThe paradigmatic example of the powerset functor T=\\mathcal P is reviewed in some detail in this note on \n\npowerdomains.","type":"content","url":"/content/introduction-to-coalgebraic-logic","position":1},{"hierarchy":{"lvl1":"Introduction","lvl2":"Idea"},"type":"lvl2","url":"/content/introduction-to-coalgebraic-logic#idea","position":2},{"hierarchy":{"lvl1":"Introduction","lvl2":"Idea"},"content":"We extend a basic dual adjunction between a category \\mathcal S of “spaces” and a category \\mathcal A of “algebras”, to a dual adjunction between coalgebras for a functor T on \\mathcal S and algebras for a functor L on \\mathcal A.\n\nIn more detail, we have\n\na category \\mathcal X of “spaces”\n\na category \\mathcal A of “algebras”\n\nan adjunction S\\dashv P: \\mathcal X^{op}\\to\\mathcal A\n\nWe think of P as mapping a space X to its algebra of propositions or predicates. In many examples, P is actually the powerset functor.\n\nWe think of S as mapping an algebra A to its spectrum, or the dual space of the algebra.\n\nIn addition, we have\n\na functor T:\\mathcal X\\to\\mathcal X\n\na functor L:\\mathcal A\\to\\mathcal A\n\nWe think of T as the type functor of generalised transition systems and of L as the functor building a language or logic over some atomic propositions.\n\nWe write Coalg(T) for the category of coalgebras for the functor T and Alg(L) for the category of algebras for the functor L.\n\nProposition: If S\\dashv P are a dual equivalence and PT\\cong LP, then Coalg(T) is dually equivalent to Alg(L).\n\nExample: The duality of descriptive general frames and Boolean algebras with operators arises in this way.\n\nIf S\\dashv P is only a dual adjunction, it lifts to coalgebras/algebras only under special circumstances.","type":"content","url":"/content/introduction-to-coalgebraic-logic#idea","position":3},{"hierarchy":{"lvl1":"Introduction","lvl2":"The modal logic view"},"type":"lvl2","url":"/content/introduction-to-coalgebraic-logic#the-modal-logic-view","position":4},{"hierarchy":{"lvl1":"Introduction","lvl2":"The modal logic view"},"content":"The above framework is very abstract. When is it legitimate to think of coalgebras as transition systems and of algebras as logics?\n\nThe paradigmatic example is the one where\n\n\\mathcal X is the category of sets\n\n\\mathcal A is the category of Boolean algebras\n\nT is the powerset functor\n\nCoalg(T) is the category of Kripke frames (transition systems)\n\nAlg(L) is the category of Boolean algebras with operators\n\n(Here we have PT\\cong LP only on finite sets.)\n\nIf we take instead\n\nT to be the double powerset functor, Coalg(T) is the category of neighbourhood frames;\n\n\\mathcal X to be the category of Stone spaces, then Coalg(T) is the category of descriptive general frames;\n\n\\mathcal A to be the category of bounded distributive lattices, we obtain positive modal logic.\n\nSo even in the case of classical modal we have already three examples that show how varying the different parameters captures interesting modal logics. Moreover, these parameters can be modified independently of each other, creating quite a large space of possibilities.\n\nBut the main interest in coalgebras stems from the discovery made by Jan Rutten and others, that there is a great variety of functors T.","type":"content","url":"/content/introduction-to-coalgebraic-logic#the-modal-logic-view","position":5},{"hierarchy":{"lvl1":"Introduction","lvl2":"The coalgebraic approach to modal logic"},"type":"lvl2","url":"/content/introduction-to-coalgebraic-logic#the-coalgebraic-approach-to-modal-logic","position":6},{"hierarchy":{"lvl1":"Introduction","lvl2":"The coalgebraic approach to modal logic"},"content":"The coalgebraic approach to modal logic is to expand the landscape of modal logics by systematically extending modal logic to a large variety of functors T.\n\nList some examples ...","type":"content","url":"/content/introduction-to-coalgebraic-logic#the-coalgebraic-approach-to-modal-logic","position":7},{"hierarchy":{"lvl1":"Introduction","lvl2":"The category theoretic view"},"type":"lvl2","url":"/content/introduction-to-coalgebraic-logic#the-category-theoretic-view","position":8},{"hierarchy":{"lvl1":"Introduction","lvl2":"The category theoretic view"},"content":"The category theoretic approach to coalgebras takes an axiomatic point of view. Clearly, we cannot expect all results of modal logic to survive modifcations of the parameters\n\\mathcal X,\\mathcal A,S,P,L,T.\n\nOn the other hand, the coalgebraic approach has shown that there is indeed a wide variety of instantiations of these parameters that allows us to extend many results of modal logic.\n\nFrom a category theoretic point of view we can ask the following questions:\n\nWhen does a dual adjunction S\\dashv P extend to coalgebras/algebras?\n\nWhat can we say in the special situation where S\\dashv P is an adjunction induced by a dualising object?\n\nIn the special case of the dual adjunction between sets and Boolean algebras, can we axiomatise the functors T for which the classical results of modal logic continue to hold?\n\nAre there theorems transferring results from the case where \\mathcal A is Boolean algebras to the case where \\mathcal A is distributive lattices (and classical modal logic to positive modal logic)? Can these results be pushed further to include many-valued logics?\n\n..","type":"content","url":"/content/introduction-to-coalgebraic-logic#the-category-theoretic-view","position":9},{"hierarchy":{"lvl1":"Introduction","lvl2":"References"},"type":"lvl2","url":"/content/introduction-to-coalgebraic-logic#references","position":10},{"hierarchy":{"lvl1":"Introduction","lvl2":"References"},"content":"Jonsson-Tarski\n\nGoldblatt\n\nAbramsky\n\nBonsangue-Kurz\n\nKupke-Kurz-Venema\n\nKurz-Rosicky\n\nKlin\n\n...\n\nto be completed\n\n...","type":"content","url":"/content/introduction-to-coalgebraic-logic#references","position":11},{"hierarchy":{"lvl1":"Introduction","lvl2":"Further Reading"},"type":"lvl2","url":"/content/introduction-to-coalgebraic-logic#further-reading","position":12},{"hierarchy":{"lvl1":"Introduction","lvl2":"Further Reading"},"content":"...","type":"content","url":"/content/introduction-to-coalgebraic-logic#further-reading","position":13},{"hierarchy":{"lvl1":"Introduction"},"type":"lvl1","url":"/content/introduction-to-functorial-modal-logic","position":0},{"hierarchy":{"lvl1":"Introduction"},"content":"(not even a draft)","type":"content","url":"/content/introduction-to-functorial-modal-logic","position":1},{"hierarchy":{"lvl1":"Introduction","lvl2":"Review"},"type":"lvl2","url":"/content/introduction-to-functorial-modal-logic#review","position":2},{"hierarchy":{"lvl1":"Introduction","lvl2":"Review"},"content":"Given functors T:\\sf Set\\to Set and L:\\sf BA\\to BA and the contravariant adjunction “homming into 2”P:\\sf Set \\leftrightarrow BA : S\n\nthe meaning of the logic L is determined by a natural transformation\\delta: LP\\to PT\n\nMoreover, LP\\to PT determines, and is determined by, its so-called mate\\begin{gather}\nTS\\to SL\n\\end{gather}\n\nwhich maps a one-step behaviour to its theory.","type":"content","url":"/content/introduction-to-functorial-modal-logic#review","position":3},{"hierarchy":{"lvl1":"Introduction","lvl2":"One-Step Properties"},"type":"lvl2","url":"/content/introduction-to-functorial-modal-logic#one-step-properties","position":4},{"hierarchy":{"lvl1":"Introduction","lvl2":"One-Step Properties"},"content":"It is possible to express properties of the logic in terms of the properties of these natural transformations. Below\n\nn is a finite set,\n\n\\twoheadrightarrow is onto,\n\n\\Rightarrow is split epi (onto and has a half-inverse),\n\n\\rightarrowtail is injective,\n\n\\hookrightarrow is a section (injective and has a half-inverse).\\begin{array}{|l|l|}\n  \\hline\n  LP\\stackrel{}{\\rightarrowtail}PT  & \\textrm{one-step completeness}\n  \\\\ \\hline\n  LP\\stackrel{}{\\twoheadrightarrow}PT & \\textrm{all sets of one-step behaviours are definable}\n  \\\\ \\hline\n  LFn\\twoheadrightarrow PTSFn & \\textrm{all finitary predicate liftings are definable}\n  \\\\ \\hline\n  TS\\rightarrowtail SL & \\textrm{one-step expressiveness}\\\\\n  \\hline\n  TS\\Rightarrow SL & \\textrm{canonical (strongly complete)}\n  \\\\ \\hline\n  T \\rightarrowtail SLP & \\textrm{separating (non-bisimilar successors are distinguished by a formula)}\n  \\\\ \\hline\n\\end{array}","type":"content","url":"/content/introduction-to-functorial-modal-logic#one-step-properties","position":5},{"hierarchy":{"lvl1":"Introduction","lvl2":"References"},"type":"lvl2","url":"/content/introduction-to-functorial-modal-logic#references","position":6},{"hierarchy":{"lvl1":"Introduction","lvl2":"References"},"content":"The algebraic approach to coalgebraic logic was proposed in\n\nKupke, Kurz, Pattinson: \n\nAlgebraic Semantics for Coalgebraic Logics. 2004.\n\nThis paper proves that one-step completeness implies completeness. That one-step expressiveness implies expressiveness is due to\n\nKlin: \n\n ...\n\n...\n\nKurz, Rosicky: \n\n ...","type":"content","url":"/content/introduction-to-functorial-modal-logic#references","position":7},{"hierarchy":{"lvl1":"Introduction to Modal Logic"},"type":"lvl1","url":"/content/introduction-to-modal-logic","position":0},{"hierarchy":{"lvl1":"Introduction to Modal Logic"},"content":"(draft)","type":"content","url":"/content/introduction-to-modal-logic","position":1},{"hierarchy":{"lvl1":"Introduction to Modal Logic","lvl2":"Motivation"},"type":"lvl2","url":"/content/introduction-to-modal-logic#motivation","position":2},{"hierarchy":{"lvl1":"Introduction to Modal Logic","lvl2":"Motivation"},"content":"Superficially, modal logic adds to the propositional connectives \\wedge (and), \\vee (or), \\neg (not) two new connectives that allow us to take any formula \\phi and form two new formulas\\Box\\phi\\quad\\quad\\Diamond\\phi.\n\nOne of the reasons modal logic has been so important is that there are so many possible interpretations for these connectives. For example,\n\n\\Box\\phi means necessarily \\phi and \\Diamond\\phi means possibly \\phi,\n\n\\Box\\phi means always \\phi and \\Diamond\\phi means sometimes \\phi,\n\n\\Box_i\\phi means agent i knows \\phi and \\Diamond_i\\phi means agent i thinks \\phi is possible.\n\n(Temporal and Epistemic Logic) Each of these interpretations created their own field of research. The first one dominated modal logic in the first half of the 20th century. The second one is known as temporal logic and has been playing an important role in computer science (verificiation, model checking) since the 1980ies. The third one is known as epistemic logic and continues to be cutting edge in philosophy, economics, software engineering, AI and other areas.\n\nBesides temporal logic and epistemic logic there is also ... (insert more examples) ...\n\n(Fragments of First-Order Logic) Another reason modal logic has been important is as a fragment of first-order logic. As we can see from the examples above, \\Box\\phi is a universal quantifier (eg always) and \\Diamond\\phi is an existential quantifier (eg sometimes). Consequently, modal logic is a fragment of first-order logic. In fact, modal logic is a fragment of first-order logic in at least two different but interesting ways:\n\nModal logic is a decidable fragment of first-order logic.\n\nModal logic is the bisimulation invariant fragment of first-order logic.\n\nThe first point has given rise to various generalisations of modal logic, in particular in the area of automated theorem proving. Search for \n\nguarded fragment for references.\n\nIn the second point bisimulation refers to a relation of observational or behavioural equivalence of dynamic systems, which are themselves considered as “black boxes”. In fact, bisimulation is the natural notion of behavioural equivalence for non-determinstic transition systems in which the states themselves are not observable but choices are. This leads us to the next item.\n\n(Possible Worlds Semantics) The idea that something is necessarily true if it is true in all possible worlds is an old one. The turning point for modal logic was the mathematical formalisation of possible world semantics by Kripke:\n\nSaul Kripke: \n\nA Completeness Theorem in Modal Logic. 1959.\n\nSaul Kripke: \n\nSemantical Analysis of Modal Logic I. 1963. I recommend Section 2.1, which also contains the solution to one of the exercises below.\n\nSaul Kripke: \n\nSemantical Analysis of Modal Logic II. 1965.\n\nThere is a lot to say here, but to present the main ideas as quickly as possible I would proceed as follows (see Chapters 3.1 and 3.2 of the book referenced below).\n\nDefinition: Let Prop be a set of ‘propositional variables’. The language of modal logic is the smallest set of ‘formulas’ containing Prop and closed under \\wedge , \\vee, \\neg, \\Box, \\Diamond.\n\nDefinition: Let W be a set of ‘worlds’ and R\\subseteq W\\times W. Let \\sem{-}:Prop\\to 2^W be a function assigning sets of worlds to each atomic proposition. Define\\begin{align}\n\\sem{\\phi\\wedge\\phi'} &= \\sem{\\phi}\\cap\\sem{\\phi'}\\\\\n\\sem{\\phi\\vee\\phi'} &= \\sem{\\phi}\\cup\\sem{\\phi'}\\\\\n\\sem{\\neg\\phi} &= W\\setminus \\sem{\\phi}\\\\\n\\sem{\\Box\\phi} &= \\{w\\in W\\mid \\forall v\\in W\\,.\\, v\\in\\sem{\\phi}\\}\\\\\n\\sem{\\Diamond\\phi} &= \\{w\\in W\\mid \\exists v\\in W\\,.\\, v\\in\\sem{\\phi}\\}\\\\\n\\end{align}\n\nand(W,R)\\models \\phi\n\niff \\sem{\\phi}=W for all choices of \\sem{-}:Prop\\to 2^W.\n\nIt is convenient to writew\\Vdash \\phi \\quad \\stackrel{\\rm  def}{\\Longleftrightarrow} \\quad w\\in\\sem{\\phi}.\n\nThe following exercise is a straightforward unvraveling of definitions:\n\nExercise: If R is reflexive, then (W,R)\\models \\Box p\\to p.\n\nA crucial observation that lets us glimpse the power of Kripke’s approach is that the converse is also true.\n\nProp: If (W,R)\\models \\Box p\\to p, then R is reflexive.\n\nThe proof is short once you know the trick. Try to find it for yourself before looking at the footnote.\n\nThe proof can be generalised to a method applying to all so-called Sahlqvist formulas and the area of modal logic is known as correspondence theory. We just look at one other basic example:\n\nExercise: (W,R)\\models \\Box p\\to\\Box\\Box p iff R is transitive.\n\nRemark: In the early 20th century modal logics where developed by philosophers from a syntactic and proof theoretic point of view. Axioms such as \\Box p\\to p and \\Box\\phi\\to\\Box\\Box\\phi where discovered by reading them as “necessarily p implies p” and “necessarily p implies necessarily necessarily p” and modal logics where characterised by axioms and proof rules. As far as I know the history, it came as a surprise that these axioms had such a neat semantic characterisation.\n\nExercise: Interpret \\Box p\\to p and \\Box p\\to\\Box\\Box p from the point of view of temporal and epistemic logic.","type":"content","url":"/content/introduction-to-modal-logic#motivation","position":3},{"hierarchy":{"lvl1":"Introduction to Modal Logic","lvl3":"Further Reading","lvl2":"Motivation"},"type":"lvl3","url":"/content/introduction-to-modal-logic#further-reading","position":4},{"hierarchy":{"lvl1":"Introduction to Modal Logic","lvl3":"Further Reading","lvl2":"Motivation"},"content":"The paper\n\nHalpern, Vardi: \n\nModel Checking v. Theorem Proving: A Manifesto. 1991.\n\nillustrates many of the themes that make modal logic so important for computer science applications.","type":"content","url":"/content/introduction-to-modal-logic#further-reading","position":5},{"hierarchy":{"lvl1":"Introduction to Modal Logic","lvl2":"The Basic Theory of Modal Logic"},"type":"lvl2","url":"/content/introduction-to-modal-logic#the-basic-theory-of-modal-logic","position":6},{"hierarchy":{"lvl1":"Introduction to Modal Logic","lvl2":"The Basic Theory of Modal Logic"},"content":"We have seen that modal logic comprises several independent areas (temporal logic, epistemic logic, etc) and has important overlaps with others (concurrency, multi-agent systems, automated reasoning, game theory, etc). My intention here is only to sketch out the basic theory that is important in all these fields.\n\nActually, instead of writing this out myself, I refer to the book “Modal Logic” by Blackburn, de Rijke, Venema.(The book treats also n-ary relations (the “general case”, as opposed to binary relations). This generalisation is interesting for some applications but should be skipped on a first reading.)\n\nHere is what I would consider essential for a first run through the basics of modal logic.\n\n1.2: Modal Languages\n\n1.3: Models and Frames\n\n1.5: Semantic Consequence\n\n1.6: Normal Modal Logics\n\n2.1: Invariance Results (Def 2.10 and Prop 2.14)\n\n2.2: Bisimulations (up to Thm 2.20)\n\n2.3: Finite Models (can be skipped on first reading)\n\n2.4: The Standard Translation (up to Prop 2.47)\n\n3.1: Frame Definability (Exle 3.6)\n\n3.2: Frame Definability and Second-Order Logic (Exle 3.11)","type":"content","url":"/content/introduction-to-modal-logic#the-basic-theory-of-modal-logic","position":7},{"hierarchy":{"lvl1":"Introduction to Modal Logic","lvl2":"References"},"type":"lvl2","url":"/content/introduction-to-modal-logic#references","position":8},{"hierarchy":{"lvl1":"Introduction to Modal Logic","lvl2":"References"},"content":"Blackburn, de Rijke, Venema: “Modal Logic”.\n\nProof: Let w\\in W. Let \\sem{p}=\\{v \\mid wRv\\}. We know w\\Vdash\\Box p by definition of \\sem{\\Box p} and w\\Vdash \\Box p\\to p by assumption. It follows w\\Vdash p, which implies wRw by definition of \\sem{p}.","type":"content","url":"/content/introduction-to-modal-logic#references","position":9},{"hierarchy":{"lvl1":"Monotone Predicate Liftings"},"type":"lvl1","url":"/content/monotone-predicate-liftings","position":0},{"hierarchy":{"lvl1":"Monotone Predicate Liftings"},"content":"(draft)\n\nIn a previous note, we defined \n\npredicate liftings and showed that the unary predicate liftings of the powerset functor are isomorphic to the free Boolean algebra generated by \\Box and \\Diamond.\n\nHere, we first single out all of those 16 modal operators that are monotone.\n\nThen we are going to test our insights by studying the predicate liftings of two posets functors, namely the upset functor \\mathcal U and the downset functor \\mathcal D.","type":"content","url":"/content/monotone-predicate-liftings","position":1},{"hierarchy":{"lvl1":"Monotone Predicate Liftings","lvl2":"Set Functors"},"type":"lvl2","url":"/content/monotone-predicate-liftings#set-functors","position":2},{"hierarchy":{"lvl1":"Monotone Predicate Liftings","lvl2":"Set Functors"},"content":"We have studied modal operators as predicate liftings\\mathcal P 2\\to 2\n\nwhere \\mathcal P 2 can be pictured as \n\nWhich order on \\mathcal P2 exhibits the monotone modal operators as exactly the monotone predicate liftings?\n\nThe answer is given by the so-called posetification \\overline{\\mathcal P}:\\sf Pos\\to Pos\n\nof the functor \\mathcal P:\\sf Set\\to Set.\n\nFact: \\overline{\\mathcal P} is the convex powerset functor, that is, for two convex subsets a,b\\subseteq X we have\\begin{align}\na\\le b\\  \\quad \\textrm{ iff } \\quad & \\forall x\\in a\\,.\\,\\exists y\\in b. x\\le y \\quad \\textrm{ and }\\\\\n&\\forall y\\in b\\,.\\,\\exists x\\in a. x\\le y\\\\\n\\end{align}\n\nExercise: Recall that 2=\\{0<1\\}. The order on \\overline{\\mathcal P}2 is given by \\{0\\}<\\{0,1\\}<\\{1\\}:\n\n![](\n\nhttps://​i​.imgur​.com​/D8YrRFK​.png =300x)\n\nIt follows that there are 2\\times 4 monotone predicate liftings \\overline{\\mathcal P}2\\to 2. The 4 upsets of the chain are\\{\\overline 0,\\overline{01},\\overline 1\\}, \\{\\overline{01},\\overline 1\\},  \\{\\overline 1\\}, \\{\\}\n\nWe can now list all monotone predicate liftings as follows.\n\nsubset of \\mathcal P2\n\nBoolean combination of generators\n\nmodal formula\n\n\\{\\}\n\n\\bot\n\n\\bot\n\n\\{\\overline 1\\}\n\n\\sf \\neg o\\wedge i\n\n\\Box\\phi\\wedge\\Diamond\\phi\n\n\\{\\overline{01},\\overline 1\\}\n\n\\sf i\n\n\\Diamond\\phi\n\n\\{\\overline 0,\\overline{01},\\overline 1\\}\n\n\\sf o\\vee i\n\n\\Diamond\\top\n\n\\{\\varnothing\\}\n\n\\sf \\neg o\\wedge\\neg i\n\n\\Box\\bot\n\n\\{\\varnothing,\\overline 1\\}\n\n\\sf \\neg o\n\n\\Box\\phi\n\n\\{\\varnothing,\\overline{01},\\overline 1\\}\n\n\\sf \\neg o\\vee i\n\n\\Box\\phi\\vee\\Diamond\\phi\n\n\\{\\varnothing,\\overline 0,\\overline{01},\\overline 1\\}\n\n\\top\n\n\\top","type":"content","url":"/content/monotone-predicate-liftings#set-functors","position":3},{"hierarchy":{"lvl1":"Monotone Predicate Liftings","lvl2":"Summary"},"type":"lvl2","url":"/content/monotone-predicate-liftings#summary","position":4},{"hierarchy":{"lvl1":"Monotone Predicate Liftings","lvl2":"Summary"},"content":"We have seen that in the example of the powerset functor that the monotone modal operators correspond precisely to the monotone functions  \\overline{\\mathcal P}2\\to 2 where \\overline{\\mathcal P} is the convex powerset functor.\n\nMore generally, for any set-functor T, the n-ary monotone modal operators (=predicate liftings) are in bijection to the monotone functions\\overline T(2^n)\\to 2\n\nwhere \\overline T is the posetification of T.","type":"content","url":"/content/monotone-predicate-liftings#summary","position":5},{"hierarchy":{"lvl1":"Monotone Predicate Liftings","lvl2":"Poset Functors"},"type":"lvl2","url":"/content/monotone-predicate-liftings#poset-functors","position":6},{"hierarchy":{"lvl1":"Monotone Predicate Liftings","lvl2":"Poset Functors"},"content":"","type":"content","url":"/content/monotone-predicate-liftings#poset-functors","position":7},{"hierarchy":{"lvl1":"Monotone Predicate Liftings","lvl3":"The Upset Functor","lvl2":"Poset Functors"},"type":"lvl3","url":"/content/monotone-predicate-liftings#the-upset-functor","position":8},{"hierarchy":{"lvl1":"Monotone Predicate Liftings","lvl3":"The Upset Functor","lvl2":"Poset Functors"},"content":"Let \\mathcal U be the upset functor. Consider\\mathcal UX\\stackrel{\\mathcal U\\phi}\\longrightarrow\\mathcal U2\\longrightarrow 2\n\n\\mathcal U2 is the poset (again \\overline{01}=\\{0,1\\}, etc)\\overline{01}<\\overline{1}<\\varnothing\n\nwhich allows us to identify monotone functions \\mathcal U2\\longrightarrow 2 with upsets:\n\nupset of \\mathcal U2\n\nmodal formula\n\n\\{\\overline{01},\\overline 1,\\varnothing\\}\n\n\\top\n\n\\{\\overline 1,\\varnothing\\}\n\n\\Box\\phi\n\n\\{\\varnothing\\}\n\n\\Box\\bot\n\n\\{\\}\n\n\\bot\n\nThe difference between upsets of \\overline{\\mathcal P}2 and upsets of \\mathcal U 2 is that in the latter case the “observation”\\{\\overline{01},\\overline{1}\\}=\\sf (o\\wedge i)\\vee (\\neg o\\wedge i) = i \\quad \\textrm{ which corresponds to } \\quad \\Diamond\\phi\n\nis not an upset of \\mathcal U 2.","type":"content","url":"/content/monotone-predicate-liftings#the-upset-functor","position":9},{"hierarchy":{"lvl1":"Monotone Predicate Liftings","lvl3":"The Downset Functor","lvl2":"Poset Functors"},"type":"lvl3","url":"/content/monotone-predicate-liftings#the-downset-functor","position":10},{"hierarchy":{"lvl1":"Monotone Predicate Liftings","lvl3":"The Downset Functor","lvl2":"Poset Functors"},"content":"Let \\mathcal D be the downset functor. Consider\\mathcal DX\\stackrel{\\mathcal D\\phi}\\longrightarrow\\mathcal D2\\longrightarrow 2\n\n\\mathcal D2 is the poset\\varnothing<\\overline{0}<\\overline{01}\n\nwhich allows us to identify monotone functions \\mathcal D2\\longrightarrow 2 with upsets:\n\nupset of \\mathcal D2\n\nmodal formula\n\n\\{\\varnothing,\\overline 0,\\overline{01}\\}\n\n\\top\n\n\\{\\overline 0,\\overline{01}\\}\n\n\\Diamond\\top\n\n\\{\\overline{01}\\}\n\n\\Diamond\\phi\n\n\\{\\}\n\n\\bot\n\nThe difference between upsets of \\overline{\\mathcal P}2 and upsets of \\mathcal D 2 is that in the latter case\\{\\varnothing,\\overline{1}\\}=\\sf (\\neg o\\wedge \\neg i)\\vee (\\neg o\\wedge i) = \\neg o \\quad \\textrm{ which corresponds to } \\quad \\Box\\phi\n\nis not available since \\overline 1 is not an element of \\mathcal D2.","type":"content","url":"/content/monotone-predicate-liftings#the-downset-functor","position":11},{"hierarchy":{"lvl1":"Monotone Predicate Liftings","lvl3":"Breakdown of Duality","lvl2":"Poset Functors"},"type":"lvl3","url":"/content/monotone-predicate-liftings#breakdown-of-duality","position":12},{"hierarchy":{"lvl1":"Monotone Predicate Liftings","lvl3":"Breakdown of Duality","lvl2":"Poset Functors"},"content":"It is interesting to think about why the arguments for \\mathcal U2 and \\mathcal D2 are not entirely dual.\n\nOn the “object level” there is duality: Swapping 0 and 1 and turning the order around is an isomorphism.\n\nThis means that it must be the “meta level” which is breaking the duality.\n\nImportantly, for both \\mathcal U and \\mathcal D, the meaning of the predicate liftings depends on the existential quantifier implicit in taking the direct image of \\phi. For example, the statement\\phi[S]=\\overline 1\n\\quad\n\\textrm{ only if }\n\\quad\n\\phi[S]\\subseteq \\overline{01}\n\nis on the meta level and does not dualise. \n\nWe summarise the situation with the following picture, depicting \\mathcal P2, \\mathcal U2, \\mathcal D2 and the subsets that correspond to \\Box and \\Diamond:","type":"content","url":"/content/monotone-predicate-liftings#breakdown-of-duality","position":13},{"hierarchy":{"lvl1":"Monotone Predicate Liftings","lvl3":"Distribution Functor","lvl2":"Poset Functors"},"type":"lvl3","url":"/content/monotone-predicate-liftings#distribution-functor","position":14},{"hierarchy":{"lvl1":"Monotone Predicate Liftings","lvl3":"Distribution Functor","lvl2":"Poset Functors"},"content":"Proposition: The posetification of the distribution functor is given by p\\sqsubseteq q if p[S]\\le q[S] for all upsets S.\n\nThis order on distributions goes back to (Jones and Plotkin, 1989) for so-called IPOs and was extended to all posets in Worrell 2000. The observation that it is the posetification will appear in (Kurz and Motamed, 2022).","type":"content","url":"/content/monotone-predicate-liftings#distribution-functor","position":15},{"hierarchy":{"lvl1":"Monotone Predicate Liftings","lvl2":"References"},"type":"lvl2","url":"/content/monotone-predicate-liftings#references","position":16},{"hierarchy":{"lvl1":"Monotone Predicate Liftings","lvl2":"References"},"content":"The definition of the posetification (extension from \\sf Set to \\sf Pos) of an arbitrary set-functor as well as the result on monotone predicate liftings is in\n\nBalan, Kurz, Velebil: \n\nPositive Fragments of Coalgebraic Logics. 2015.\n\nTheorem 7.1 contains the result that the predicate liftings of the posetification of T are the monotone predicate liftings of T.p_1,p_2:R\\to X\n\nMoreover, one can reconstruct the poset (X,R) as a certain order-enriched colimit of the diagram p_1,p_2:R\\to X. Then the posetification \\overline TX is defined as the said colimit of Tp_1,Tp_2:TR\\to TX.\n\nThe posetification enjoys the universal property of an order-enriched left Kan extension.\n\nRecall that for a predicate lifting \\triangle and a formula \\varphi:X\\to 2, the meaning of \\triangle\\phi is given by how the composition \\mathcal PX\\stackrel{\\mathcal P\\phi}\\longrightarrow{\\mathcal P2}\\stackrel \\triangle\\longrightarrow 2 acts on a subset ‘of successors’ S\\in\\mathcal PX.\n\nThe posetification of a functor T is defined as follows. Any poset (X,R) can be represented by its “graph”\n\n“\\phi[S]=\\overline 1 only if \\phi[S]\\subseteq \\overline{01}” is needed to establish that \\{\\overline{01}\\}\\subseteq\\mathcal D2 corresponds to \\Diamond\\phi.","type":"content","url":"/content/monotone-predicate-liftings#references","position":17},{"hierarchy":{"lvl1":"Moss’s Coalgebraic Logic"},"type":"lvl1","url":"/content/moss-coalgebraic-logic","position":0},{"hierarchy":{"lvl1":"Moss’s Coalgebraic Logic"},"content":"(under construction)\n\nGiven a coalgebra \\gamma:X\\to TX and the set of all formulas \\Phi and \\theta\\in T\\Phi, we define the semantics of the formla \\nabla\\theta viax\\Vdash \\nabla\\theta \\quad\\Longleftrightarrow\\quad \\gamma(x)\\,  \\widehat T(\\Vdash)\\, \\theta\n\nwhere \\widehat T is the \n\nrelation lifting of T.\n\nExample: If T=\\mathcal P the powerset functor and R\\subseteq X\\times Y, then the relation lifting \\widehat{\\mathcal P}R\\subseteq \\mathcal PX\\times\\mathcal PY is given as follows.(A,B)\\in\\widehat{\\mathcal P}R \\quad\\Leftrightarrow\\quad \\forall x\\in A.\\exists y\\in B. (x,y)\\in R \\quad \\&\\quad \n\\forall y\\in B.\\exists x\\in A. (x,y)\\in R\n\nInstantiating A=\\gamma(x) and B=\\theta we get\\gamma(x)\\,  \\widehat{\\mathcal P}(\\Vdash)\\, \\theta \\quad\\Leftrightarrow\\quad \\forall y\\in\\gamma(x).\\exists \\phi\\in\\theta. y\\Vdash\\phi \\quad \\&\\quad \n\\forall\\phi\\in\\theta.\\exists y\\in \\gamma(x). y\\Vdash\\theta\n\nWith \\theta = \\{\\phi_1,\\ldots\\phi_n\\} we can now rewrite this using \\Box and \\Diamond to obtain\\nabla\\theta = \\Box(\\phi_1\\vee\\ldots\\phi_n)\\wedge\\Diamond\\phi_1\\wedge\\ldots\\Diamond\\phi_n\n\nDefinition: The syntax of Moss’s logic  is given by the functorFTU:{\\sf BA}\\to {\\sf BA}\n\nand the semantics is given for finite sets X by the BA-morphism FTUPX \\to PTX which is the adjoint transpose of the function TUP\\stackrel\\rho\\longrightarrow UPTX that arises from applying the relation lifting of T to the elementship relation.\\begin{align}\nX\\times 2^X & \\stackrel\\in\\longrightarrow  2\\\\\nTX\\times T(2^X) & \\stackrel{\\widehat T\\in}\\longrightarrow 2\\\\\nT(2^X) &\\to 2^{TX}\n\\end{align}","type":"content","url":"/content/moss-coalgebraic-logic","position":1},{"hierarchy":{"lvl1":"Moss’s Coalgebraic Logic","lvl2":"References"},"type":"lvl2","url":"/content/moss-coalgebraic-logic#references","position":2},{"hierarchy":{"lvl1":"Moss’s Coalgebraic Logic","lvl2":"References"},"content":"Lawrence S. Moss: \n\nCoalgebraic logic, 1999.\n\nKurz, Leal: \n\nModalities in the Stone age: A comparison of coalgebraic logics, 2012.\n\nOne often takes the finitary version of T defined as the left Kan extension of the restriction of T to finite sets. This is more in the spirit of using a finitary variety such as Boolea algebra for the base logic.","type":"content","url":"/content/moss-coalgebraic-logic#references","position":3},{"hierarchy":{"lvl1":"Neighbourhood Frames"},"type":"lvl1","url":"/content/neighbourhood-frames","position":0},{"hierarchy":{"lvl1":"Neighbourhood Frames"},"content":"... to be written ...","type":"content","url":"/content/neighbourhood-frames","position":1},{"hierarchy":{"lvl1":"Introduction"},"type":"lvl1","url":"/content/oecl-introduction","position":0},{"hierarchy":{"lvl1":"Introduction"},"content":"... to be written ...","type":"content","url":"/content/oecl-introduction","position":1},{"hierarchy":{"lvl1":"Posetification"},"type":"lvl1","url":"/content/oecl-posetification","position":0},{"hierarchy":{"lvl1":"Posetification"},"content":"(incomplete ... under construction)","type":"content","url":"/content/oecl-posetification","position":1},{"hierarchy":{"lvl1":"Posetification","lvl2":"Theory"},"type":"lvl2","url":"/content/oecl-posetification#theory","position":2},{"hierarchy":{"lvl1":"Posetification","lvl2":"Theory"},"content":"A Balan, A Kurz, J Velebil: Positive Fragments of Coalgebraic Logics. Logical Methods in Computer Science, Vol. 11(3:18)2015, pp. 1–51 \n\n(pdf):\n\nDenote by D:Set\\to Pos  the ‘discrete’ functor. It has an ordinary right adjoint (the forgetful functor) but no order-enriched right Kan extension.\n\n(Def 4.1, Thm 4.3): The posetification of a Set-endofunctor T is the (Pos-enriched) left Kan-extension of DT along D.\n\nLet X be a poset with carrier X_0 and order X_1. The coinserter given by the projections \\pi_1,\\pi_2:DX_1\\to DX_0, \\pi_1\\le\\pi_2,  is called the nerve of the poset X.\n\nD:Set\\to Pos is dense and has a density presentation given by nerves of posets.\n\n(Def 4.7): A Pos-endofunctor has a presentation in discrete arities if it is the posetification of a Set-endofunctor.\n\n(Thm 4.10): A Set-endofunctor preserves weak pullbacks if and only if its posetification preserves exact squares.\n\nThe posetification of a functor T:Set\\to Pos is the left Kan extension of T along D.\n\n...","type":"content","url":"/content/oecl-posetification#theory","position":3},{"hierarchy":{"lvl1":"Posetification","lvl2":"Examples of Extensions of Functors"},"type":"lvl2","url":"/content/oecl-posetification#examples-of-extensions-of-functors","position":4},{"hierarchy":{"lvl1":"Posetification","lvl2":"Examples of Extensions of Functors"},"content":"Computing an extension via its left-Kan extension is not always straightforward. Here are two theorems that can help.\n\n(BKV Thm ...) If T preserves weak pullbacks then T'(X,\\le_X) is given by TX and the relation lifting of \\le_X.\n\nLet (\\Sigma, E) be a presention of T. Then T'(X,\\le_X) is presented by (\\Sigma(TX),E \\cup{\\le_X}) ... this needs some refinement.\n\nIn the following, given a poset (X,\\le_X), a Set-endofunctor T and its posetification T', we denote by \\sqsubseteq the order on T'(X,\\le_X).","type":"content","url":"/content/oecl-posetification#examples-of-extensions-of-functors","position":5},{"hierarchy":{"lvl1":"Posetification","lvl3":"The List Functor","lvl2":"Examples of Extensions of Functors"},"type":"lvl3","url":"/content/oecl-posetification#the-list-functor","position":6},{"hierarchy":{"lvl1":"Posetification","lvl3":"The List Functor","lvl2":"Examples of Extensions of Functors"},"content":"We have l\\sqsubseteq l' if the lists have the same length and l[i]\\le_X l'[i] for all indices i.\n\nOne can relax the requirement that the lists have the same length if one considers the list-functor as a functor Set\\to Pos and equips the image with the prefix order (or the consverse of the prefix order).","type":"content","url":"/content/oecl-posetification#the-list-functor","position":7},{"hierarchy":{"lvl1":"Posetification","lvl3":"The Multiset Functor","lvl2":"Examples of Extensions of Functors"},"type":"lvl3","url":"/content/oecl-posetification#the-multiset-functor","position":8},{"hierarchy":{"lvl1":"Posetification","lvl3":"The Multiset Functor","lvl2":"Examples of Extensions of Functors"},"content":"","type":"content","url":"/content/oecl-posetification#the-multiset-functor","position":9},{"hierarchy":{"lvl1":"Posetification","lvl3":"The Powerset Functor","lvl2":"Examples of Extensions of Functors"},"type":"lvl3","url":"/content/oecl-posetification#the-powerset-functor","position":10},{"hierarchy":{"lvl1":"Posetification","lvl3":"The Powerset Functor","lvl2":"Examples of Extensions of Functors"},"content":"[BKV, 4.9] The posetification of  prese powerset functor is  prese convex powerset functor.\n\n[Worrell, Section 7; KM, Section 5.2] The posetification of  prese finite distribution functor maps a partial order (X,\\le_X) to  prese set of finitely supported probability distributions on X, ordered by p \\sqsubseteq q iff \\sum\\{p(x)\\mid x\\in U\\} \\le \\sum\\{q(x)\\mid x\\in U\\} for all upward closed subsets U\\subseteq X.","type":"content","url":"/content/oecl-posetification#the-powerset-functor","position":11},{"hierarchy":{"lvl1":"Posetification","lvl2":"Examples of Extensions of Monads"},"type":"lvl2","url":"/content/oecl-posetification#examples-of-extensions-of-monads","position":12},{"hierarchy":{"lvl1":"Posetification","lvl2":"Examples of Extensions of Monads"},"content":"In this section we ask the questions whether the posetification of a monad is a monad.\n\n...","type":"content","url":"/content/oecl-posetification#examples-of-extensions-of-monads","position":13},{"hierarchy":{"lvl1":"Posetification","lvl2":"References"},"type":"lvl2","url":"/content/oecl-posetification#references","position":14},{"hierarchy":{"lvl1":"Posetification","lvl2":"References"},"content":"A. Carboni and R. Street, Order ideals in categories, Pacific J. Math. 124:275–288 (1986)\n\nKelly ...\n\nAlexander Kurz and Nima Motamed: \n\nBoolean-Valued Multiagent Coalgebraic Logic, 2022.\n\nWorrell, J.: Coinduction for recursive data types: partial orders, metric spaces and Ω-categories. Electronic Notes in Theoretical Computer Science 33, 337–356 (2000). \n\nWorrell (2000)\n\nDahlqvist, Fredrik ; Kurz, Alexander: The Positivication of Coalgebraic Logics. CALCO 2017\n\n...","type":"content","url":"/content/oecl-posetification#references","position":15},{"hierarchy":{"lvl1":"Powerdomains"},"type":"lvl1","url":"/content/powerdomains","position":0},{"hierarchy":{"lvl1":"Powerdomains"},"content":"Powerdomains can be seen as modelling non-determinstic choice. They appear in various areas of mathematics and computer science.\n\nWe review the basic relationships between lower/upper powerdomains, forward and backward simulation, and \\Diamond and \\Box modalities.\n\nIt may be worth to read the \n\nSummary first.","type":"content","url":"/content/powerdomains","position":1},{"hierarchy":{"lvl1":"Powerdomains","lvl2":"An Axiomatic Account of Choice"},"type":"lvl2","url":"/content/powerdomains#an-axiomatic-account-of-choice","position":2},{"hierarchy":{"lvl1":"Powerdomains","lvl2":"An Axiomatic Account of Choice"},"content":"A somewhat minimal axiomatisation of a choice operator \\odot is\\begin{gather}\n(x\\odot y)\\odot z= x\\odot (y\\odot z)\\\\\nx\\odot y = y\\odot x\\\\\nx\\odot x = x\n\\end{gather}\n\nWhat is axiomatised here is choice as a set of alternatives. Given a set X, we denote by \\mathcal PX the set of subsets of X and by \\mathcal P_\\omega X the set of finite subsets of X. A set with an operation \\odot satisfying the three equations above is known as a semi-lattice.\n\nFacts:\n\n\\mathcal P_\\omega X is the free semi-lattice over X.\n\n(\\mathcal P_\\omega,\\eta,\\mu) with \\eta(x)=\\{x\\} and \\mu(A)=\\bigcup A where A\\subseteq\\mathcal P_\\omega X is a monad and the algebras for the monad are the semi-lattices.\n\nSemi-lattices can be equipped with an order in two ways. The first corresponds to taking \\mathcal P_\\omega X with inclusion of subsets and the second to reverse inclusion.\n\nThe operation \\odot is the join in the poset generated by  x\\le x\\odot y.\n\nThe operation \\odot is the meet in the poset generated by  x\\ge x\\odot y.\n\nSimilarly, \\mathcal P gives us complete semi-lattices. The initial algebra for the functor \\mathcal P is our usual set-theoretic universe, while the final coalgebra fo the functor \\mathcal P is Aczel’s universe of non-well founded sets. \n\nRemark: Semi-lattices exist in many categories. This often allows us to generalise non-determinism.","type":"content","url":"/content/powerdomains#an-axiomatic-account-of-choice","position":3},{"hierarchy":{"lvl1":"Powerdomains","lvl2":"Coalgebras for the Powerset Functor"},"type":"lvl2","url":"/content/powerdomains#coalgebras-for-the-powerset-functor","position":4},{"hierarchy":{"lvl1":"Powerdomains","lvl2":"Coalgebras for the Powerset Functor"},"content":"More often than not, the reason to investigate choice is to model dynamic scenarios where agents change state by making choices. Such dynamical systems are known as coalgebras for the powerset functor and also as  transition systems in process algebra and as non-determinstic automata in the theory of automata and formal languages and as Kripke frames in the theory of modal logic.\n\nMathematically, a coalgebra is a function X\\to\\mathcal PX. A coalgebra morphism(X\\stackrel \\xi \\to \\mathcal PX)\n\\stackrel f\\longrightarrow (X'\\stackrel {\\xi'} \\to \\mathcal PX')\n\nis a function f:X\\to X' satisfying\\mathcal Pf\\circ \\xi = \\xi\\circ f.\n\nIn other words, f makes the following square commute. https://q.uiver.app/#q=WzAsNCxbMCwwLCJYIl0sWzAsMiwiWCciXSxbMiwwLCJcXG1hdGhjYWwgUFgiXSxbMiwyLCJcXG1hdGhjYWwgUFgnIl0sWzAsMSwiZiIsMl0sWzIsMywiXFxtYXRoY2FsIFBmIl0sWzAsMiwiXFx4aSJdLFsxLDMsIlxceGknIl1d \n\nOf course, a coalgebra on X is nothing but a set with a relation R\\subseteq X\\times X. But coalgebra morphisms do not only preserve the relation but also reflect it in a particular way. Key to this is the following.\n\nExercise on (bi)simulation: We write xRy for y\\in\\xi(x). The following are equivalent conditions for f being a forward simulation.\\begin{gather}\n\\mathcal Pf\\circ \\xi \\ \\subseteq \\ \\xi'\\circ f\\\\\nxRy \\ \\Rightarrow \\ f(x) R' f(y)\\\\\nx'=f(x) \\ \\Rightarrow \\ \\forall y\\in\\xi(x)\\,.\\,\\exists y'\\in\\xi'(x')\\,.\\,y'=f(x')\n\\end{gather}\n\nThe following are equivalent conditions for f being a backward simulation.\\begin{gather}\n\\mathcal Pf\\circ \\xi \\ \\supseteq \\ \\xi'\\circ f\\\\\nf(x)R'y' \\ \\Rightarrow \\ \\exists y\\,.\\, xRy \\ \\& \\  y'=f(y)\\\\\nx'=f(x) \\ \\Rightarrow \\ \\forall y'\\in\\xi'(x')\\,.\\,\\exists y\\in\\xi(x)\\,.\\,y'=f(x')\n\\end{gather}\n\nThe advantage of the first conditions is that they are parametric in the functor, the second condition is how so-called zig-zag morphisms or p-morphisms or bounded morphisms are defined in modal logic and the third conditions establish the following important fact that will continue to play a role in this note (we will give a precise definition of bisimulation later).\n\nFact: A function is a coalgebra morphism iff its graph is a bisimulation.","type":"content","url":"/content/powerdomains#coalgebras-for-the-powerset-functor","position":5},{"hierarchy":{"lvl1":"Powerdomains","lvl2":"Powerdomains on Posets"},"type":"lvl2","url":"/content/powerdomains#powerdomains-on-posets","position":6},{"hierarchy":{"lvl1":"Powerdomains","lvl2":"Powerdomains on Posets"},"content":"The “domain” in powerdomain comes from domain theory and the theory of programming languages. It is well-known that in order to model recursively defined programs and datatypes in general one needs to extend the types-as-sets paradigm to types-as-domains. There are different ways to define domains. Typically, they  involve some kind of complete order or complete metric that supports the taking of certain limits to interpret recursively defined functions. In this section, I simplify by ignoring completeness and only look at domains as ordered sets.","type":"content","url":"/content/powerdomains#powerdomains-on-posets","position":7},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"Functors","lvl2":"Powerdomains on Posets"},"type":"lvl3","url":"/content/powerdomains#functors","position":8},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"Functors","lvl2":"Powerdomains on Posets"},"content":"The powerset functor gives rise to three different powerdomains on the category of partial orders according to whether we enforce one of one of the following two alternatives.\\begin{gather}\nx\\le x\\odot y\\\\\nx\\ge x\\odot y\n\\end{gather}","type":"content","url":"/content/powerdomains#functors","position":9},{"hierarchy":{"lvl1":"Powerdomains","lvl4":"Convex Powerdomain","lvl3":"Functors","lvl2":"Powerdomains on Posets"},"type":"lvl4","url":"/content/powerdomains#convex-powerdomain","position":10},{"hierarchy":{"lvl1":"Powerdomains","lvl4":"Convex Powerdomain","lvl3":"Functors","lvl2":"Powerdomains on Posets"},"content":"The functor\\mathcal P^{\\rm{c}}:\\sf Pos \\to Pos\n\nmaps a poset (X,\\le) to the set of convex subsets \\mathcal PX. The order on convex subsets is defined as follows.  \\begin{align}\na\\le b\\  \\quad \\textrm{ if } \\quad & \\forall x\\in a\\,.\\,\\exists y\\in b. x\\le y \\quad \\textrm{ and }\\\\\n&\\forall y\\in b\\,.\\,\\exists x\\in a. x\\le y\\\\\n\\end{align}\n\nIf X is discrete then \\mathcal P^{\\rm{c}} X is just  \\mathcal PX and \\le is equality.","type":"content","url":"/content/powerdomains#convex-powerdomain","position":11},{"hierarchy":{"lvl1":"Powerdomains","lvl4":"Lower Powerdomain","lvl3":"Functors","lvl2":"Powerdomains on Posets"},"type":"lvl4","url":"/content/powerdomains#lower-powerdomain","position":12},{"hierarchy":{"lvl1":"Powerdomains","lvl4":"Lower Powerdomain","lvl3":"Functors","lvl2":"Powerdomains on Posets"},"content":"The functor\\mathcal D:\\sf Pos \\to Pos\n\nmaps a poset (X,\\le) to the set of downward closed subsets (downsets) \\mathcal DX. The order on subsets a,b\\subseteq X is defined as  \\begin{align}\na\\le b\\  \\quad \\textrm{ if } \\quad & \\forall x\\in a\\,.\\,\\exists y\\in b. x\\le y\n\\end{align}\n\nwhich amounts to inclusion of downsets. If X is discrete then \\mathcal DX is \\mathcal PX ordered by \\subseteq.","type":"content","url":"/content/powerdomains#lower-powerdomain","position":13},{"hierarchy":{"lvl1":"Powerdomains","lvl4":"Upper Powerdomain","lvl3":"Functors","lvl2":"Powerdomains on Posets"},"type":"lvl4","url":"/content/powerdomains#upper-powerdomain","position":14},{"hierarchy":{"lvl1":"Powerdomains","lvl4":"Upper Powerdomain","lvl3":"Functors","lvl2":"Powerdomains on Posets"},"content":"The functor \\mathcal U:\\sf Pos \\to Pos maps a poset (X,\\le) to the set of upward closed subsets (upsets) \\mathcal UX. The order on upsets is defined as \\begin{align}\na\\le b\\  \\quad \\textrm{ if } \\quad & \\forall y\\in b\\,.\\,\\exists x\\in a. x\\le y\n\\end{align}\n\nwhich amounts to reverse inclusion of upsets. If X is discrete then \\mathcal UX is \\mathcal PX ordered by \\supseteq.","type":"content","url":"/content/powerdomains#upper-powerdomain","position":15},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"Coalgebras","lvl2":"Powerdomains on Posets"},"type":"lvl3","url":"/content/powerdomains#coalgebras","position":16},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"Coalgebras","lvl2":"Powerdomains on Posets"},"content":"As noted above, coalgebras X\\to\\mathcal PX are in bijective correspondence with Kripke frames (X,R). This continues to hold in the ordered setting under appropriate conditions on the relation R.\n\n(X,R) is an \\mathcal U-coalgebra iff R is a weakening relation, that is, iff\\frac{x'\\le x R y \\le y'}{x'R y'}\n\n(X,R) is an \\mathcal D-coalgebra iff\\frac{x'\\ge x R y \\ge y'}{x'R y'}\n\nExample: Let X=\\{x,y\\} be a Kripke frame where x has no successor and y is reflexive. We can turn X into a \\mathcal U-coalgebra by setting x\\le y and into a \\mathcal D-coalgebra by setting x\\ge y.","type":"content","url":"/content/powerdomains#coalgebras","position":17},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"(Bi)simulations","lvl2":"Powerdomains on Posets"},"type":"lvl3","url":"/content/powerdomains#id-bi-simulations","position":18},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"(Bi)simulations","lvl2":"Powerdomains on Posets"},"content":"As for set-functors, any functor on ordered sets gives rise to a canonical notion of (bi)simulation,  \n\ncospan bisimulation. In case of \\mathcal P^{\\rm{c}}-coalgebras (bi)simulation is bisimulation, in case of \\mathcal U-coalgebras (bi)simulation is backward simulation and in case of  \\mathcal D-coalgebras (bi)simulation is forward simulation.\n\nFact: The largest preorder on a \\mathcal U-coalgebra (\\mathcal D-coalgebra) compatible with the coalgebra structure is the largest backward-simulation (forward simulation) on that coalgebra. \n\nTo understand this better it helps to know more about \n\ncoalgebraic (bi)similarity. But I will try to shortcut this here, with more details available at \n\ncospan (bi)simulation.\n\nIn order to define the notion of (bi)simulation induced by \\mathcal U or \\mathcal D we proceed as follows.\n\nA relation R from X to Y will be represented as an order \\bf R on the disjoint union X+Y.\n\nBecause of the universal property of the coproduct, there always will be a coalgebra {\\bf R}\\to T{\\bf R} where T is either \\mathcal U or \\mathcal D.\n\nR is a (bi)simulation iff {\\bf R}\\to T{\\bf R} is monotone.\n\nRecall from the definition of  \\mathcal D and \\mathcal U how these functors act on ordered sets. Instantiating this procedure it is not difficult to see the following.\n\nProposition on \\mathcal D- and \\mathcal U-(bi)simulation: \\mathcal D-(bi)simulation is forward-simulation and \\mathcal U-(bi)simulation is backward-simulation.","type":"content","url":"/content/powerdomains#id-bi-simulations","position":19},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"Simulations for Set-Coalgebras","lvl2":"Powerdomains on Posets"},"type":"lvl3","url":"/content/powerdomains#simulations-for-set-coalgebras","position":20},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"Simulations for Set-Coalgebras","lvl2":"Powerdomains on Posets"},"content":"Each functor T:\\sf Set\\to Set induces a notion of T-bisimulation.\n\nWhat about simulations?\n\nWe first note that each functor T:\\sf Ord\\to Ord induces a notion of T-(bi)simulation. I write (bi)simulation here because technically this notion works much in the same way for \\sf Set-functors and for \\sf Ord-functors. But for \\sf Ord-functors, it encompasses both simulations and bisimulations, depending on the functor.\n\nA general way to introduce notions of simulation for \\sf Set functors is as follows. Let T:\\sf Set\\to Set be a functor. Extend T to a functor T':\\sf Ord\\to Ord. Then restrict T'-(bi)simulation to T-coalgebras.\n\nExample: Let T=\\mathcal P. We can let T' be one of \\mathcal P^{\\rm{c}} or \\mathcal U or \\mathcal D to capture bisimulation or forward simulation or backward simulation.\n\nRemark: The ordered setting is the right one if we want to exploit that the structures at hand support an order-duality. In the example, \\mathcal U and \\mathcal D capture \\Box and \\Diamond separately and both extend \\mathcal P.","type":"content","url":"/content/powerdomains#simulations-for-set-coalgebras","position":21},{"hierarchy":{"lvl1":"Powerdomains","lvl2":"Powerdomains via Generators and Relations"},"type":"lvl2","url":"/content/powerdomains#powerdomains-via-generators-and-relations","position":22},{"hierarchy":{"lvl1":"Powerdomains","lvl2":"Powerdomains via Generators and Relations"},"content":"The finitary versions of the three powerdomains can be generated as follows. The way we describe algebras by generators and relation is the same as over sets, with the only difference that we now require \\odot to be order-preserving (monotone).\n\nIf X is a finite poset, then the finitely generated convex subsets \\mathcal P_\\omega^{\\rm{c}} X are ismorphic to the free semi-lattice over X. Convexity is captured by the requirement that \\odot is montone. \n\nIf X is a finite poset, then the finitely generated downsets \\mathcal D_\\omega X are ismorphic to the free semi-lattice over X satisfying x\\le x\\odot y, or, equivalently, the free join semi-lattice over X.\n\nIf X is a finite poset, then the finitely generated upsets \\mathcal U_\\omega X are ismorphic to the free semi-lattice over X satisfying x\\odot y\\le x, or, equivalently, the free meet semi-lattice over X.\n\nTo remember how taking upsets and downsets interacts with the order, it is helpful to know the following.\n\nFacts: Let X be a preorder. \\mathcal DX is the free complete join semi lattice over X. \\mathcal D is a monad on preorders (and also on posets). The unit X\\to\\mathcal DX=[X^{\\rm{o}},2] is the order enriched Yoneda embedding. The Yoneda embedding is a free completion by colimits (joins). The x\\le x\\odot y play the role of the arrows into the colimit (coproduct, join). (The Yoneda embedding preserves all limits (meets) that may already exist in X.) The multiplication of the monad is the free extension of the identity \\mathcal DX\\to\\mathcal DX.","type":"content","url":"/content/powerdomains#powerdomains-via-generators-and-relations","position":23},{"hierarchy":{"lvl1":"Powerdomains","lvl2":"Modal Logic"},"type":"lvl2","url":"/content/powerdomains#modal-logic","position":24},{"hierarchy":{"lvl1":"Powerdomains","lvl2":"Modal Logic"},"content":"We have seen that coalgebra morphisms express a particular back-and-forth condition. It is interesting to study its logical ramifications.\n\nThe key questions are: Which logic is invariant under coalgebra morphisms (bisimulation)? Which logic is invariant under forward (or backward) simulation?","type":"content","url":"/content/powerdomains#modal-logic","position":25},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"The Logic of Bisimulation","lvl2":"Modal Logic"},"type":"lvl3","url":"/content/powerdomains#the-logic-of-bisimulation","position":26},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"The Logic of Bisimulation","lvl2":"Modal Logic"},"content":"The answer is given by the “bounded quantifiers” \\Box and \\Diamond. Usually they are considered as syntactic operations on formulas. But I want to treat them here as operations on “semantic” propositions, that is, on subsets of X where \\xi:X\\to\\mathcal PX\n\nis a coalgebra. We rewrite the usual definition of the semantics of \\Box and \\Diamond in terms of the coalgebra structure \\xi as follows.\\begin{gather}\n\\Box a = \\xi^{-1}(\\{b\\subseteq X \\mid b\\subseteq a\\})\\\\\n\\Diamond a =  \\xi^{-1}(\\{b\\subseteq X \\mid a\\cap b\\not=\\emptyset\\})\n\\end{gather}\n\nExercise: The following are a direct consequence of the definition above.\\begin{gather}\nx\\in \\Box a \\quad \\Longleftrightarrow \\quad \\forall y\\in\\xi(x)\\,.\\, y\\in a\\\\\nx\\in \\Diamond a \\quad \\Longleftrightarrow \\quad \\exists y\\in\\xi(x)\\,.\\, y\\in a\n\\end{gather}\n\nWe can now extend propositional logic by unary operators for \\Box and \\Diamond (and all equations they satisfy in all coalgebras). This is known as the modal logic \\bf K.\n\nHere are some classic results of modal logic. I use “coalgebra” instead of “Kripke frame” to indicate that these results generalise.\n\nFacts: The modal logic \\bf K is invariant under coalgebra morphisms. Every logic that contains classical propositional logic and is invariant under bisimulation is equivalent to \\bf K on finite coalgebras. \\bf K characterises elements of coalgebras up to bisimilarity on finite coalgebras. \\bf K is the bisimulation-invariant fragment of first-order logic.\n\nThe notion of bisimilarity can be defined in different ways. From a coalgebraic point of view I find the following the most elegant.\n\nTwo elements of two \\mathcal P-coalgebras are bisimilar (or behaviourally equivalent) iff they can be connected by some zig-zag of morphisms. \n\nThe advantage of this definition is that it captures the informal idea that coalgebra-morphisms preserve behaviour and that it is parametric in the functor. But we also want a more combinatorial characterisation:\n\nGiven two coalgebras X\\stackrel \\xi \\to \\mathcal PX and X'\\stackrel {\\xi'} \\to \\mathcal PX' a relation R\\subseteq X\\times X' is called a bisimulation if\\begin{align} \nx Rx' \\ \\ \\textrm{ only if } \\quad\n& \\forall y\\in \\xi(x)\\,.\\,\\exists y'\\in\\xi'(x')\\,.\\, x'Ry' \\quad \\textrm {and}\\\\\n& \\forall y'\\in \\xi'(x')\\,.\\,\\exists y\\in\\xi(x)\\,.\\, x'Ry'\\\\\n\\end{align}\n\nFacts: Two elements of two coalgebras are bisimilar iff there is a bisimulation relating them. If two elements of two coalgebras are bisimular then they satisfy the same modal formulas. The converse is true on finite coalgebras (or if we extend modal logic by infinitary conjunctions).","type":"content","url":"/content/powerdomains#the-logic-of-bisimulation","position":27},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"Logics of Simulation","lvl2":"Modal Logic"},"type":"lvl3","url":"/content/powerdomains#logics-of-simulation","position":28},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"Logics of Simulation","lvl2":"Modal Logic"},"content":"A finer analysis, separating forward and backward simulation, is possible. It also sheds light on the ordered generalisations of the powerset functor.\n\nLet me write {\\bf K}^\\Box and {\\bf K}^\\Diamond (this is not standard notation) for the negation-free fragment of \\bf K that only contains \\Box (respectively \\Diamond) formulas. It now turns out that preservation of {\\bf K}^\\Box-formulas and preservation of {\\bf K}^\\Diamond-formulas each corresponds to one direction of the definition of bisimulation.\nLet $f$ be a coalgebra morphism and $\\phi\\in\\bf K^\\Box$. Then \n$$x\\in\\phi \\quad \\Longleftrightarrow \\quad $$\n\n\nAs the Exercise on (bi)simulation above shows, {\\bf K}^\\Diamond-formulas are invariant under forward-simulation and {\\bf K}^\\Box-formulas are invariant under backward-simulation.\n\nOn the other hand, we know from the Proposition on \\mathcal D- and \\mathcal U-(bi)simulation that \\mathcal D-(bi)simulation is forward-simulation and \\mathcal U-(bi)simulation is backward simulation.\n\nWe now assembled all the pieces needed for the table below.","type":"content","url":"/content/powerdomains#logics-of-simulation","position":29},{"hierarchy":{"lvl1":"Powerdomains","lvl2":"Summary"},"type":"lvl2","url":"/content/powerdomains#summary","position":30},{"hierarchy":{"lvl1":"Powerdomains","lvl2":"Summary"},"content":"To read the table recall that, for a poset X,  the elements of \\mathcal DX are downsets ordered according to \\ a\\le b \\ \\Leftrightarrow\\  a\\subseteq b and the elements of \\mathcal UX are upsets ordered as  \\ a\\le b \\ \\Leftrightarrow\\  a\\supseteq b .\n\nT\n\n\\mathcal D\n\n\\mathcal U\n\nalso known as\n\nHoare powerdomain\n\nSmyth powerdomain\n\n\\odot\n\n\\cup\n\n\\cup\n\na\\le b\\in TX\n\n\\forall x\\in a\\,.\\,\\exists y\\in b\\,.\\, x\\le y\n\n\\forall y\\in b\\,.\\,\\exists x\\in a\\,.\\, x\\le y\n\nsemilattice + ...\n\na\\le a\\odot b\n\na \\odot b \\le a\n\n(bi)simulation\n\nforward\n\nbackward\n\nlogic\n\n\\Diamond\n\n\\Box\n\nX\\stackrel R \\longrightarrow TX\n\n\\frac{x'\\ge x\\,R\\,y'\\ge y}{x'\\,R\\,y'}\n\n\\frac{x'\\le x\\,R\\,y'\\le y}{x'\\,R\\,y'}\n\n\n\nangelic\n\ndemonic\n\nMaybe the most principled way to remember that \\mathcal U gives \\Box and \\mathcal D gives \\Diamond is via a direct analysis of the predicate liftings of these functors, see my note on \n\nmonotone predicate liftings.\n\nA choice satisfying a\\le a\\odot b is sometimes called angelic because, whatever a\\odot b is, it is better than what I have, a. Dually, a demon would make sure that a\\odot b is not better than a and not better than b.","type":"content","url":"/content/powerdomains#summary","position":31},{"hierarchy":{"lvl1":"Powerdomains","lvl2":"Generalisations"},"type":"lvl2","url":"/content/powerdomains#generalisations","position":32},{"hierarchy":{"lvl1":"Powerdomains","lvl2":"Generalisations"},"content":"The basic ideas we have seen so far generalise in many directions.\n\nIn domain theory we are typically interested in directed complete partial orders with the Scott topology.\n\nDomains can be seen as particular topological spaces. Many different topological spaces support some kind of powerspace, often called the Vietoris construction.\n\nVietoris defined a powerdomain on certain topological spaces. A good introduction to the topic is this \n\ntalk by Guram Bezhanishvili. (Passcode: ?D3q#^mw).\n\nThe theory can also be developed internally in a topos.\n\nMany results on powerdomains generalise to quantale enriched categories. And some even survive the move to categories or higher categories. The analogy here is that the powerset functor, or rather \\mathcal U and \\mathcal D, generalise to taking presheaves.\n\n...","type":"content","url":"/content/powerdomains#generalisations","position":33},{"hierarchy":{"lvl1":"Powerdomains","lvl2":"Further Reading"},"type":"lvl2","url":"/content/powerdomains#further-reading","position":34},{"hierarchy":{"lvl1":"Powerdomains","lvl2":"Further Reading"},"content":"(very incomplete)","type":"content","url":"/content/powerdomains#further-reading","position":35},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"Topology","lvl2":"Further Reading"},"type":"lvl3","url":"/content/powerdomains#topology","position":36},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"Topology","lvl2":"Further Reading"},"content":"Vietoris\n\nJohnstone: Stone Spaces. 1982. See in particular Chapter III.4. On page 112 one finds the definitions of \\Box (called t) and \\Diamond (called m). This also works for ordered compact Hausdorff spaces and many other settings, see Guram Bezhanishvili’s talk.\n\nG. Bezhanishvili: Talk on \n\nThe hit-or-miss toplogy. (Passcode: ?D3q#^mw).","type":"content","url":"/content/powerdomains#topology","position":37},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"Modal Logic","lvl2":"Further Reading"},"type":"lvl3","url":"/content/powerdomains#modal-logic-1","position":38},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"Modal Logic","lvl2":"Further Reading"},"content":"van Benthem, Segerberg, Goldblatt, ...","type":"content","url":"/content/powerdomains#modal-logic-1","position":39},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"Domain Theory","lvl2":"Further Reading"},"type":"lvl3","url":"/content/powerdomains#domain-theory","position":40},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"Domain Theory","lvl2":"Further Reading"},"content":"Plotkin 1976, \n\nSmyth 1978  , \n\nPlotkin 1980, \n\nApt-Plotkin 1981, \n\nWinskel 1985 , Section 6.2 of \n\nAbramsky-Jung 1994, \n\nMartin-Curtis-Rewitzky 2007, Section 3 of \n\nGoubault-Larreque 2010, ...","type":"content","url":"/content/powerdomains#domain-theory","position":41},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"Coalgebra","lvl2":"Further Reading"},"type":"lvl3","url":"/content/powerdomains#coalgebra","position":42},{"hierarchy":{"lvl1":"Powerdomains","lvl3":"Coalgebra","lvl2":"Further Reading"},"content":"Aczel: Non-well founded set theory. Aczel-Mendler, ...\n\nBarwise, Moss: Vicious Circles.\n\nBaltag: A structural theory of sets.\n\nRutten: Universal coalgebra.\n\nJacobs, Hughes-Jacobs, ...\n\nPattinson\n\nLitak etal\n\n...\n\nMore references can also be found in the following papers. Kurz-Palmigiano \n\nCoalgebras and Modal Expansions of Logics, Kapulkin-Kurz-Velebil \n\nExpressiveness of Positive Coalgebraic Logic, Bilkova-Kurz-Petrisan-Velebil \n\nRelation lifting, with an application to the many-valued cover modality, Balan-Kurz-Velebil \n\nPositive Fragments of Coalgebraic Logics.\n\nTo make this claim precise, one needs to extend sets with classes and extend the powerset functor continuously.\n\nAll functors can be extended to functors on ordered sets, see \n\nPositive Fragments of Coalgebraic Logics.\n\nNote how the back-and-forth pattern of bisimulations appears again.\n\nWe could have defined this powerdomain as the set of all subsets instead of restricting to convex subsets. Then \\mathcal PX is a preorder but may not be a partial order. This gives the right definition of the “convex” powerdomain on preorders. In fact, for a preorder (X,\\le) and a,b\\subseteq X we have a\\le b iff they have the same posetal quotients of their convex closures.\n\nNote that the definition of the order \\le makes sense for aribtray subsets of X (but may only be a preorder then).\n\nThe justification for choosing this half of the convex powerdomain is the following. Two subsets a,b\\subseteq X are in the relation a\\le b iff the downset closure of a is a subset of the downset closure of b. It follows that if X is a poset then the order \\le is also a poset when restricted to downsets.\n\nAs before, the definition of the order makes sense for aribtrary subsets a,b\\subseteq X (and we can use this observation to extend the powerset functor to preorders). Note that a\\le b iff the upset of b is a subset of the upset of a. It follows that if X is a poset then the order \\le is also a poset when restricted to upsets.\n\nCompatible means that the quotient by the preorder is again a coalgebra.\n\nThe order on \\mathcal DX is given by \\begin{align}\na\\le b\\  \\quad \\textrm{ if } \\quad & \\forall x\\in a,.,\\exists y\\in b. x\\le y\n\\end{align}\n\nand the order on \\mathcal UX by\\begin{align}\na\\le b\\  \\quad \\textrm{ if } \\quad & \\forall y\\in b\\,.\\,\\exists x\\in a. x\\le y\n\\end{align}\n\nI like to write \\sf Ord if I do not want to commit to using preorders or posets. If you want to be specific let \\sf Ord be the category of preorders.\n\nLet D:\\sf Set\\to Ord be the “discrete” embedding. T' is an extension of T if there is a natural transformation DT\\to T'D. For example, if T=\\mathcal P and T'=\\mathcal U, then we have the bijection (\\mathcal PX,=)\\to(\\mathcal U,\\subseteq).\n\nAdd more detail ...\n\nThis deserves more explanation ...\n\nSee the note on \n\nCoalgebraic (Bi)Similarity for more.\n\nOn page 26 we find\n\n\nOn page 128 we find\n","type":"content","url":"/content/powerdomains#coalgebra","position":43},{"hierarchy":{"lvl1":"Predicate Liftings"},"type":"lvl1","url":"/content/predicate-liftings","position":0},{"hierarchy":{"lvl1":"Predicate Liftings"},"content":"(draft)","type":"content","url":"/content/predicate-liftings","position":1},{"hierarchy":{"lvl1":"Predicate Liftings","lvl2":"Definition"},"type":"lvl2","url":"/content/predicate-liftings#definition","position":2},{"hierarchy":{"lvl1":"Predicate Liftings","lvl2":"Definition"},"content":"A n-ary predicate lifting for a functor T:\\sf Set\\to Set is a natural transformation{2^n}^X\\to 2^{TX}\n\nIt follows from the Yoneda lemma that such natural transformations are in bijection with functionsT(2^n)\\to 2.\n\nIn one direction, we apply {2^n}^X\\to 2^{TX} to the idenity on X=2^n to obtain T(2^n)\\to 2.\n\nIn the other direction, each T(2^n)\\to 2 induces a modal operator as follows.\n\nGiven a predicate lifting \\triangle: T(2^n)\\to 2 and a collection \\phi:X\\to 2^n of n predicates \\phi_i:X\\to 2, we obtain TX\\to 2 defined asTX\\stackrel {T\\phi}\\longrightarrow T(2^n)\\stackrel\\triangle\\longrightarrow 2\n\nPrecomposing with a coalgebra X\\to TX the semantics of a modal formula \\triangle \\phi\n\nis then given byX\\longrightarrow TX\\stackrel {T\\phi}\\longrightarrow T(2^n)\\stackrel\\triangle\\longrightarrow 2.\n\nA good way to understand what is going on here is to explicitely calculate all unary predicate liftings of the powerset functor.\n\nBut before doing this let us clarify terminology.\n\nFirst, to simplify notation, we will only consider unary predicate liftings in the following.\n\nTerminology: We tend to say predicate lifting for the function\\triangle: T2\\to 2\n\nand modal operator (or sometimes predicate transformer) for the function that maps a predicate \\phi to the predicate\\triangle\\phi: X\\to TX \\stackrel {T\\phi}\\longrightarrow T2\\stackrel\\triangle\\longrightarrow 2.\n\nQuestion: Would it be better to reverse the terminology? Or perhaps as follows:\n\npredicate lifting 2^X\\to 2^{TX}\n\npredicate transformer 2^X\\to 2^{TX}\\to 2^X\n\nmodal operator: T2\\to 2\n\nAnyway: Since there is a bijection between predicate liftings and modal operators, we may blur the distinction on occasion.","type":"content","url":"/content/predicate-liftings#definition","position":3},{"hierarchy":{"lvl1":"Predicate Liftings","lvl2":"Example: Powerset"},"type":"lvl2","url":"/content/predicate-liftings#example-powerset","position":4},{"hierarchy":{"lvl1":"Predicate Liftings","lvl2":"Example: Powerset"},"content":"Let T=\\mathcal P be the powerset functor.\n\nWe see right away that there are 16 modal operators\\mathcal P2\\to 2\n\nbecause that is the cardinality of the set of functions of type \\mathcal P2\\to 2.\n\nWe are interested in explicitely describing all modal operators \\triangle:\\mathcal P2\\to 2 taking predicates \\phi:X\\to 2 to \\mathcal PX\\stackrel {\\mathcal P\\phi}\\longrightarrow \\mathcal P2\\stackrel\\triangle\\longrightarrow 2\n\nWe need to know that \\mathcal P\\phi takes direct image. This tells us how to interpret the 4 possible results of applying \\mathcal P \\phi to a set S of successors. Writing 2=\\{0,1\\}, if (\\mathcal P\\phi)S is \n\n\\{0,1\\} then some successors are outside of \\phi and some are inside of \\phi.\n\n\\{0\\} then all and some successors are out.\n\n\\{1\\} then all and some successors are in.\n\n\\{\\} then there are no successors.\n\nFor the purpose of further calculations I propose the following abbreviations:\\varnothing=\\{\\}\n\\quad\\quad\n\\overline 0=\\{0\\}\n\\quad\\quad\n\\overline{01}=\\{0,1\\}\n\\quad\\quad\n\\overline 1=\\{1\\}\n\nfor the elements of \\mathcal P2.\n\nExercise: (Assumes familiarity with the classical definition of the modal operators \\Box and \\Diamond). Show that \\varnothing,\\overline 1\\mapsto 1 defines \\Box and that \\overline 1,\\overline{01}\\mapsto 1 defines \\Diamond. \n\nAnswer. \n\nObservation: The modal operator \\Box:\\mathcal P2\\to 2 coincides with \\bigwedge: \\mathcal P2\\to 2 and the modal operator \\Diamond:\\mathcal P2\\to 2 coincides with \\bigvee: \\mathcal P2\\to 2.\n\nModal logic is expressive up to bisimilarity and this means here that all predicate liftings \\mathcal P2\\to 2 (and also all \\mathcal P2^n\\to 2) are generated by those for \\Box and \\Diamond. Let us try to support this with some examples:\n\nExercise: Using \\Box,\\Diamond as well as propositional connectives, express the predicate liftings \\triangle_\\sigma defined by \\sigma\\mapsto 1 where \\sigma ranges over \\{\\varnothing,\\overline 0,  \\overline{01},\\overline 1\\}. Also verify that \\Diamond=\\neg\\Box\\neg holds for the corresponding predicate liftings.\n\nOur next concern is to better understand the lattice (Boolean algebra) of all unary modal operators of the powerset functor \\mathcal P.\n\nWe already noted that there are 16 unary modal operators P2\\to 2 and we exhibited some salient examples.\n\nFrom general facts about Boolean algebras we can deduce the following. The Boolean algebra of modal operators P2\\to 2 is isomorphic to the free Boolean algebra on two generators, which I call \\sf o and \\sf i.  These generators combine to the atoms of the Boolean algebra as\\sf o\\wedge i, o\\wedge\\neg i, \\neg o\\wedge i, \\neg o\\wedge\\neg i.\n\nEvery element of the Boolean algebra of modal operators is a join of these atoms.\n\nExercise: Define an isomorphism between predicate liftings \\mathcal P2\\to 2 and the free Boolean algebra generated by \\{\\sf o,i\\} which maps \\Box to \\neg\\sf o and \\Diamond to \\sf i.\n\nAnswer. \n\nRemark: The isomorphism in the previous exercise has been chosen in such a way that the generator \\sf o is interpreted as “some  successors are outside of \\phi” and \\sf i as “some successors are inside”.\n\nThis choice of interpretation is suggested by how the functor \\mathcal P acts on \\phi (as direct image). In particular, \\sf o symbolizes the observation that the direct image under \\phi of the set of successors  contains 0 and \\sf i that the direct image contains 1.\n\nFrom the point of view of Boolean generators there is no reason to prefer \\sf \\neg o over \\sf o. But from a logician’s point of view \\sf \\neg o, which is \\Box, has the advantage of being a monotone operator. We will study this in more detail in the follow-up note on \n\nmonotone predicate liftings.\n\nRemark: Items 1. and 2. could be the starting point for a rational reconstruction of why classical modal logic is usually presented in terms of \\Box and \\Diamond. One would begin with the question of a logic that is invariant under bisimilarity, answer that such a logic is given by the logic of all predicate liftings and then proceed to the insight that \\Box and \\Diamond generate all predicate liftings in a canonical way.\n\nSummary: We introduced some notation for the set \\mathcal P2\n\nand then represented the unary modal operators as subsets of \\mathcal P2. For example,\n\n\\Box=\\{\\varnothing,\\overline 1\\} = \\neg \\sf o (“nothing out”)\n\n\\Diamond = \\{\\overline 1,\\overline{01}\\} = \\sf i (“at least one in”)\n\nAs a corollary we identified \\Box and \\Diamond as the generators of the free Boolean algebra of all unary predicate liftings.\n\nPuzzle: If we equip \\mathcal P2 with the inclusion order, then \\Box is not a monotone function \\mathcal P2 \\to 2 (when 2 is ordered as 0<1). On the other hand, we do know that \\Box is a monotone modal operator in the sense that \\frac{\\phi\\to\\psi}{\\Box\\phi\\to\\Box\\psi}\n\nThis puzzle will be resolved in a follow-up note on \n\nmonotone predicate liftings.","type":"content","url":"/content/predicate-liftings#example-powerset","position":5},{"hierarchy":{"lvl1":"Predicate Liftings","lvl2":"Example: Probability Distributions"},"type":"lvl2","url":"/content/predicate-liftings#example-probability-distributions","position":6},{"hierarchy":{"lvl1":"Predicate Liftings","lvl2":"Example: Probability Distributions"},"content":"Let \\mathcal D be the functor that maps a set X to the set \\mathcal DX of finitely supported probability distributions.\n\nThe unary modalities are given by sets of distributions on 2\\mathcal D2\\to 2.\n\nA modal operators \\triangle:\\mathcal D2\\to 2 takes a predicate \\phi:X\\to 2 to\\mathcal DX\\stackrel {\\mathcal \nD\\phi}\\longrightarrow \\mathcal D2\\stackrel\\triangle\\longrightarrow 2\n\nThe atoms of the Boolean algebra are the sets \\{b_r\\} where b_r(1)=r. If \\triangle is \\{b_r\\}, thenp\\in \\sem{\\triangle\\phi}\\ \\Leftrightarrow \\ Pr(x\\in\\phi)\n=r\n\nThis reminds me of the \n\nsquare of opposition in Aristotelian logic. \\{1\\} corresponds to \\phi “belongs to all successors”, \\{0\\} to \\phi “belongs to no successors”, \\top to “belongs to some but not all”. As far as I understand (not my area of expertise) Aristotle’s logic does not admit \\varnothing.\n\nHere and in the following all elements not explicitly mentioned are sent to 0. For example, writing \\varnothing,\\overline 1\\mapsto 1 implies  \\overline 0,\\overline{01}\\mapsto 0.\n\nFor example, in the case of \\Box, one has to verify that with \\triangle defined as \\varnothing,\\overline 1\\mapsto 1 the function \\mathcal PX\\stackrel {\\mathcal P\\phi}\\longrightarrow \\mathcal P2\\stackrel\\triangle\\longrightarrow 2 maps S\\subseteq X to 1 iff S\\subseteq\\phi.\n\nIntuitively, \\sf o means “some successor outside of \\phi” and \\sf i means “some successor inside \\phi”. It is a lucky coincidence that the symbol \\sf o reminds us of both out and 0 and \\sf i of both in and 1.\n\nRecall that \\varnothing means “no successor”, \\overline 0 means “some and all successor outside of \\phi”, \\overline 1 means “some and all successors in \\phi” and \\overline{01} means “some out and some in”.\nAccordingly, we map the elements \\varnothing,\\overline 0,\\overline{01},\\overline 1\\in\\mathcal P2 to conjunctions of generators as follows. \\varnothing \\mapsto \\sf \\neg o\\wedge\\neg i, \\overline 0\\mapsto \\sf o\\wedge\\neg i, \\overline{01}\\mapsto \\sf o\\wedge i, \\overline 1\\mapsto \\sf\\neg o\\wedge i.\n\nIt also makes sense to replace \\to by \\le if we think of predicates as propositional functions to 2=\\{0<1\\}.","type":"content","url":"/content/predicate-liftings#example-probability-distributions","position":7},{"hierarchy":{"lvl1":"Presenting Functors"},"type":"lvl1","url":"/content/presenting-functors-by-operations-and-equations","position":0},{"hierarchy":{"lvl1":"Presenting Functors"},"content":"(draft)\n\nThe main theorem is that a functor on a variety (in the sense of universal algebra) has a presentation by operations and equations if and only if the functor preserves sifted colimits.\n\nThe theory of sifted colimits is well explained in Adamek-Rosicky-Vitale. We only cover some highlights.\n\nIn all of the following \\mathcal A is a variety in the sense of univeral algebra, that is, a category of algebras specified (finitary) operations equations. (We will assume all operations to be finitary in the following, even if we drop the qualifier.)","type":"content","url":"/content/presenting-functors-by-operations-and-equations","position":1},{"hierarchy":{"lvl1":"Presenting Functors","lvl2":"Sifted Colimits"},"type":"lvl2","url":"/content/presenting-functors-by-operations-and-equations#sifted-colimits","position":2},{"hierarchy":{"lvl1":"Presenting Functors","lvl2":"Sifted Colimits"},"content":"Filtered categories are precisely categories \\mathcal D such that colimits over \\mathcal D commute with finite limits in Set. There is also a characterization of filtered categories independent of sets – a category \\mathcal D is filtered if and only if the diagonal functor \\mathcal D \\to \\mathcal D^\\mathcal I is final for each finite category \\mathcal I.\n\nSifted categories are the categories \\mathcal D such that colimits over \\mathcal D commute with finite products. These categories are characterized by the property that the diagonal functor \\mathcal D \\to \\mathcal D \\times \\mathcal D is final.\n\nFacts:\n\nEvery filtered colimit is sifted.\n\nReflexive coequalisers are sifted but not filtered.\n\nSifted colimit preserving functors preserve filtered colimits.\n\nAn object A of a category \\mathcal C is finitely presentable if its hom-functor hom(A, −) : \\mathcal C → Set preserves filtered colimits. A category \\mathcal C is locally finitely presentable (lfp) if it is cocomplete and has a set \\mathcal X of finitely presentable objects such that each object of \\mathcal C is a filtered colimit of objects from \\mathcal X.\n\nAn object A is strongly finitely presentable if its hom-functor hom(A,−) : \\mathcal C → Set preserves sifted colimits. A category \\mathcal C is strongly locally finitely presentable (slfp) if it is cocomplete and has a set \\mathcal X of strongly finitely presentable objects such that each object of \\mathcal C is a sifted colimit of objects from \\mathcal X.\n\nLet \\mathcal A be a variety in the sense of universal algebra.\n\nFacts:\n\nFinitely presentable objects in \\mathcal A are algebras finitely presentable in a usual sense.\n\nStrongly finitely presentable algebra = retract of finitely generated free algebra.\n\nFinitely presentable algebra = reflexive coequalizer of strongly finitely presentable ones.\n\nSifted colimit preserving functors on \\mathcal A are determined by their action on finitely generated free algebras.\n\nLet Alg(L) be the categories of algebras for the functor L:\\mathcal A\\to\\mathcal A.\n\nTheorem: If \\mathcal A is a variety and L:\\mathcal A\\to \\mathcal A preserves sifted colimits then Alg(L) is a variety.\n\nProposition:\n\nLet \\mathcal A be a variety such that every finitely presentable algebra is projective. Then any functor L : \\mathcal A \\to  \\mathcal A preserving filtered colimits preserves sifted colimits.\n\nIf T:Set\\to Set preserves filtered colimits then T preserves sifted colimits.\n\nFor any filtered colimit preserving functor L : BA → BA there is a sifted colimit preserving functor L′ : BA → BA such that L and L′ are isomorphic when restricted to the full subcategory of BA without 1. Moreover, Alg(L) = Alg(L′).","type":"content","url":"/content/presenting-functors-by-operations-and-equations#sifted-colimits","position":3},{"hierarchy":{"lvl1":"Presenting Functors","lvl2":"Presenting Functors on Varieties"},"type":"lvl2","url":"/content/presenting-functors-by-operations-and-equations#presenting-functors-on-varieties","position":4},{"hierarchy":{"lvl1":"Presenting Functors","lvl2":"Presenting Functors on Varieties"},"content":"","type":"content","url":"/content/presenting-functors-by-operations-and-equations#presenting-functors-on-varieties","position":5},{"hierarchy":{"lvl1":"Presenting Functors","lvl3":"Introduction","lvl2":"Presenting Functors on Varieties"},"type":"lvl3","url":"/content/presenting-functors-by-operations-and-equations#introduction","position":6},{"hierarchy":{"lvl1":"Presenting Functors","lvl3":"Introduction","lvl2":"Presenting Functors on Varieties"},"content":"Given an adjunction L\\dashv R:\\mathcal C\\to \\mathcal X such that the right-adjoint R is monadic (or of descent type) all objects A\\in\\mathcal C have a presentation “by generators and relations”LRLRA\\rightrightarrows LRA \\to A.\n\nIn words, A is the quotient of the free algebra LRA over generators RA by equations in LRLRA.\n\nWe apply this “monadic presentation” now to the situation where A is an endofunctor. In fact, we apply it twice and combine two representations:\n\nStep 1: We represent a sifted colimit preserving endofunctor on a variety \\mathcal A such that the “generators” and “relations” are given by sifted colimit preserving endofunctors on Set.\n\nStep 2: We represent a sifted colimit on Set as the quotient of polynomial functor.","type":"content","url":"/content/presenting-functors-by-operations-and-equations#introduction","position":7},{"hierarchy":{"lvl1":"Presenting Functors","lvl3":"Preliminaries","lvl2":"Presenting Functors on Varieties"},"type":"lvl3","url":"/content/presenting-functors-by-operations-and-equations#preliminaries","position":8},{"hierarchy":{"lvl1":"Presenting Functors","lvl3":"Preliminaries","lvl2":"Presenting Functors on Varieties"},"content":"Let S(\\mathcal C) be the category of sifted colimit preserving functors \\mathcal C\\to\\mathcal C.\n\nFact: The category S(\\mathcal C) is slfp if \\mathcal C is.\n\nA functor H : \\mathcal A \\to \\mathcal B between slfp categories is called algebraically exact provided that it preserves limits and sifted colimits.\n\nFact: If H is algebraically exact it has a left adjoint.","type":"content","url":"/content/presenting-functors-by-operations-and-equations#preliminaries","position":9},{"hierarchy":{"lvl1":"Presenting Functors","lvl3":"Step 1","lvl2":"Presenting Functors on Varieties"},"type":"lvl3","url":"/content/presenting-functors-by-operations-and-equations#step-1","position":10},{"hierarchy":{"lvl1":"Presenting Functors","lvl3":"Step 1","lvl2":"Presenting Functors on Varieties"},"content":"Let U:\\mathcal A\\to Set be a variety and F\\dashv U. Define\\Psi:S(\\mathcal A)\\to S(Set)\n\nvia \\Psi L = ULF and\\Phi: S(Set) \\to S(\\mathcal A)\n\nvia \\Phi T = FTU.\n\nFact: \\Psi is algebraically exact and \\Phi\\dashv\\Psi.\n\nAfter the first step, we obtain a quotient FULFU\\to L. Here, FULFU results from applying the free construction \\Phi=F-U to the Set-functor ULF. What we need next is a presentation by operations and equations of ULF.","type":"content","url":"/content/presenting-functors-by-operations-and-equations#step-1","position":11},{"hierarchy":{"lvl1":"Presenting Functors","lvl3":"Step 2","lvl2":"Presenting Functors on Varieties"},"type":"lvl3","url":"/content/presenting-functors-by-operations-and-equations#step-2","position":12},{"hierarchy":{"lvl1":"Presenting Functors","lvl3":"Step 2","lvl2":"Presenting Functors on Varieties"},"content":"Every sifted colimit preserving on Set (=filtered colimit preserving functor=finitary functor) can be presented as the quotient of a polynomial functor.\n\nIndeed, if T:Set\\to Set is finitary then we have a natural transformation\\begin{align}\n\\coprod_{n\\in\\mathbb N} Tn\\times X^n & \n\\stackrel {q_X} \\longrightarrow TX \\\\\n(\\sigma,v) & \\ \\mapsto \\ T(v)(\\sigma)\n\\end{align}\n\nwith each q_X being surjective (even for infinite sets X).\n\nNote that v can be seen both as a tuple (x_1,\\ldots x_n) and as a function n\\to X. Hence we can evaluate the term \\sigma(x_1,\\ldots x_n) by applying Tv:Tn\\to TX to \\sigma.\n\nThis gives us a representation of T as a functor by operations and equations where the set of n-ary operations is Tn and the set of equations in n variables is the kernel of q_n.","type":"content","url":"/content/presenting-functors-by-operations-and-equations#step-2","position":13},{"hierarchy":{"lvl1":"Presenting Functors","lvl3":"The Presentation","lvl2":"Presenting Functors on Varieties"},"type":"lvl3","url":"/content/presenting-functors-by-operations-and-equations#the-presentation","position":14},{"hierarchy":{"lvl1":"Presenting Functors","lvl3":"The Presentation","lvl2":"Presenting Functors on Varieties"},"content":"Theorem: A functor on a variety has a presentation by operations and equations iff the functor preserves sifted colimits.\n\nTo prove “if”, one shows that every sifted colimit preserving functor L on a variety is a quotientFGUA\\stackrel {q_A} \\longrightarrow LA\n\nwhere GX=\\coprod_{n\\in\\mathbb N}ULFn\\times X^n.\n\nThe n-ary modal operators \\sigma are the elements of ULFn.\n\nq_A maps (\\sigma,v:n\\to UA) to L(v^\\dagger)(\\sigma) where v^\\dagger:Fn\\to A is the adjoint transpose of v.\n\nThe equations in n variables are the kernel of q_{Fn}.\n\nIn particular the (\\sigma,v:n\\to UA) are modal formulas\\Delta(a_1,\\ldots a_n)\n\nwhere \\Delta=\\sigma and a_i=v(i).\n\nThe set \\Sigma of operations and the set E of equations constitute the presentation \\langle\\Sigma_L,E_L\\rangle of L.\n\nTheorem: Let \\mathcal A \\cong Alg(Σ_\\mathcal A, E_\\mathcal A) be a variety and \\langle \\Sigma_L, E_L\\rangle a presentation of L : \\mathcal A \\to \\mathcal A. Then Alg(Σ_\\mathcal A + \\Sigma_L, E_\\mathcal A+E_L) is isomorphic to Alg(L), where equations in E_\\mathcal A and E_L are understood as equations over \\Sigma_\\mathcal A + \\Sigma_L.\n\nExample: The variety of modal algebras is presented by the operations and equations of Boolean algebra plus a unary operation \\Box and two equations specifying that \\Box preserves finite meets.","type":"content","url":"/content/presenting-functors-by-operations-and-equations#the-presentation","position":15},{"hierarchy":{"lvl1":"Presenting Functors","lvl2":"References"},"type":"lvl2","url":"/content/presenting-functors-by-operations-and-equations#references","position":16},{"hierarchy":{"lvl1":"Presenting Functors","lvl2":"References"},"content":"Kurz-Rosicky: \n\nStrongly Complete Logics for Coalgebras, 2012.\n\nNote that (\\sigma,v:n\\to UA) is a modal formula \\Delta(a_1,\\ldots a_n) where \\Delta=\\sigma and a_i=v(i).","type":"content","url":"/content/presenting-functors-by-operations-and-equations#references","position":17},{"hierarchy":{"lvl1":""},"type":"lvl1","url":"/content/probability-distributions","position":0},{"hierarchy":{"lvl1":""},"content":"to be written ...","type":"content","url":"/content/probability-distributions","position":1},{"hierarchy":{"lvl1":"Introduction"},"type":"lvl1","url":"/content/qecl-introduction","position":0},{"hierarchy":{"lvl1":"Introduction"},"content":"We have seen in the chapter “Ordere Enriched Coalgebraic Logic” that much of coalgebraic logic generalizes from the sets and Boolean algebras to posets and distributive lattices.\n\nThe intention of this chapter is to generalize this from the two-element quantale to a general quantale. Much of this work in progress but the outlines of this general theory are emerging ...\n\nA quantale \\Qu is a monoid in the category of complete join semilattices (suplattices). We write the order as \\sqsubseteq, and the operations join and multiplication as \\bigsqcup and \\cdot. The neutral elements are denoted by \\bot_\\Qu,1_\\Qu, respectively, dropping the subscripts whenever convenient. Because a quantale is a complete lattice, we also have \\bigsqcap and because multiplication preserves joins in each argument we have residuals \\rhd and \\lhd defined by a\\cdot b \\sqsubseteq c \\ \\Leftrightarrow\\  a \\sqsubseteq c\\lhd b \\ \\Leftrightarrow \\ b\\sqsubseteq a\\rhd c","type":"content","url":"/content/qecl-introduction","position":1},{"hierarchy":{"lvl1":"Introduction","lvl2":"The Logic of Chosen Predicate Liftings"},"type":"lvl2","url":"/content/qecl-introduction#the-logic-of-chosen-predicate-liftings","position":2},{"hierarchy":{"lvl1":"Introduction","lvl2":"The Logic of Chosen Predicate Liftings"},"content":"In this section, we list the ingredients needed to apply the framework of (functorial) coalgebraic logic to many-valued modal logics with truth-values in a quantale. The logic will be generated by a choice of propositional logic (via a suitable algebra) and a choice of predicate liftings (which will determine the meaning of the modal operators). https://q.uiver.app/#q=WzAsNSxbMCwyLCJRXFx0ZXh0ey1DYXR9Il0sWzIsMiwiXFxtYXRoY2FsIEEiXSxbMiw0LCJcXHNmIFNldCJdLFswLDAsIntcXHNmIENvYWxnfShUKSJdLFsyLDAsIntcXHNmIEFsZ30oTCkiXSxbMSwyLCJVIiwwLHsiY3VydmUiOi0xfV0sWzIsMSwiRiIsMCx7ImN1cnZlIjotMX1dLFswLDEsIlAiLDAseyJjdXJ2ZSI6LTF9XSxbMSwxLCJMIiwwLHsicmFkaXVzIjoxLCJhbmdsZSI6OTB9XSxbMCwwLCJUIiwwLHsiYW5nbGUiOi05MH1dLFszLDQsIlxcd2lkZXRpbGRlIFAiLDAseyJjdXJ2ZSI6LTF9XV0= \n\n\\Qu, a quantale\n\n\\QuCat, category of \\Qu-enriched categories\n\nT:\\QuCat\\to\\QuCat, a functor for coalgebras\n\n\\triangle:({\\Qu^n})^X\\to Q^{TX}, n-ary predicate liftings\n\n\\mathcal A, a category of algebras containing \\Qu such that there is\n\nF\\dashv U:\\mathcal A\\to \\Set, so that Fn is the free algebra on n-generators \n\nP:\\QuCat\\to\\mathcal A, a contravariant functor defined by UPX=Q^X =\\QuCat(X,\\Qu)\n\nn-ary predicate liftings are of the form U(PX)^n\\to UPTX.\n\nL:\\mathcal A\\to \\mathcal A\n\nLA \\stackrel {\\text{def}} =\\coprod_\\triangle F(UA)^n aggregates the domains of all predicate liftings.\n\n\\delta:LP\\to PT aggregates all predicate liftings into one natural transformation.\n\nEach n-ary predicate lifting ({\\Qu^n})^X\\to Q^{TX} induces an \\mathcal A-morphism F(UPX)^n\\to PTX. \n\nAll F(UPX)^n\\to PTX aggregate to \\delta:LP\\to PT. \n\n\\widetilde P:\\Coalg(T)\\to\\Alg(L), defined by \\widetilde P(X\\to TX)=LPX\\to PTX\\to PX\n\n\\widetilde P(X\\to TX) is called the “complex algebra” of X\\to TX.\n\nThe semantics of the logic wrt a coalgebra X\\to TX is given by the unique \\mathcal A-morphism from the initial L-algebra to the complex algebra \\widetilde P(X\\to TX).\n\nRemark: In this minimal setting, the \n\ndualizing object \\Qu induces the functor P:\\QuCat\\to\\mathcal A, but for now we do not insist on the existence of an adjoint to P.","type":"content","url":"/content/qecl-introduction#the-logic-of-chosen-predicate-liftings","position":3},{"hierarchy":{"lvl1":"Introduction","lvl2":"A Principled Approach"},"type":"lvl2","url":"/content/qecl-introduction#a-principled-approach","position":4},{"hierarchy":{"lvl1":"Introduction","lvl2":"A Principled Approach"},"content":"In this section, we will study principled ways of defining the logic of all predicate liftings for any functor T:\\QuCat\\to\\QuCat for any quantale \\Qu. Assumptions, if needed are imposed on the way. https://q.uiver.app/#q=WzAsMyxbMCwwLCJcXE9tZWdhXFx0ZXh0ey1jYXR9Il0sWzIsMCwiXFxPbWVnYVxcdGV4dHstY2F0fV57b3B9Il0sWzEsMCwiXFxib3QiXSxbMCwxLCJcXE9tZWdhXi0iLDAseyJjdXJ2ZSI6LTJ9XSxbMSwwLCJcXE9tZWdhXi0iLDAseyJjdXJ2ZSI6LTJ9XSxbMCwwLCJcXE9tZWdhXntcXE9tZWdhXi19IiwwLHsiYW5nbGUiOi05MH1dXQ== \n\n... tbc ...\n\nOne might want to consider adjunctions F\\dashv U:\\mathcal A\\to \\QuCat instead.\n\nThe coproduct is taken over all chosen predicate liftings \\triangle, with n\\in N denoting their arity.\n\nUsing that F is left-adjoint to U.\n\nThis relies on the universal property of the coproduct.","type":"content","url":"/content/qecl-introduction#a-principled-approach","position":5},{"hierarchy":{"lvl1":"Relation Lifting"},"type":"lvl1","url":"/content/relation-lifting","position":0},{"hierarchy":{"lvl1":"Relation Lifting"},"content":"(draft)\n\nExtending a functor from functions to relations is important to coalgebra for at least two reasons. Relation lifting can be used to define bisimulations and also to define Moss’s coalgebraic logic. In the latter case, the idea is to apply the lifted functor to the satisfiability relation.\n\nRelation lifting can be defined in at least two ways, via spans and via cospans. In both cases the idea is to first represent a relation by a pair of arrows, and then to apply the functor to these arrows.\n\nIn the following let \\sf Rel be the category which has sets as objects and relations as arrows.","type":"content","url":"/content/relation-lifting","position":1},{"hierarchy":{"lvl1":"Relation Lifting","lvl2":"Span-Based Relation Lifting"},"type":"lvl2","url":"/content/relation-lifting#span-based-relation-lifting","position":2},{"hierarchy":{"lvl1":"Relation Lifting","lvl2":"Span-Based Relation Lifting"},"content":"The idea of the span-based relation lifting of a functor T is to “tabulate” a relation R by a span X\\stackrel p \\leftarrow R\\stackrel q\\rightarrow Y and then to apply the functor T to the projections, obtaining TX\\stackrel {Tp} \\longleftarrow TR\\stackrel {Tq}\\longrightarrow TY.\n\nDefinition: Let T:\\sf Set\\to Set and X\\stackrel p \\leftarrow R\\stackrel q\\rightarrow Y be a relation. Then\\overline T:\\sf Rel\\to Rel\n\nis the relation given by\\overline TR = \\{(a,b) \\in TX\\times TY \\mid \\exists w\\in TR\\,.\\, Tp(w)=a \\ \\& \\ Tq(w)=b\\}\n\nRemark: This formulation is specific to set-functors, but can be generalised to other base categories.\n\nFact: \\overline T preserves composition (and therefore is a functor on \\sf Rel) if T preserves weak-pullbacks.\n\nExample/Exercise: Let \\mathcal P be the powerset functor. It is an interesting exercise to check that (a,b)\\in \\overline{\\mathcal P}X iff\\begin{gather}\n\\forall x\\in \\mathcal a\\,.\\, \\exists y\\in b\\,.\\,xRy \\\\\n\\forall y\\in \\mathcal b\\,.\\, \\exists x\\in a\\,.\\,xRy \\\\\n\\end{gather}\n\nFact: \\overline {\\mathcal P} : \\sf Rel \\to Rel is a functor. If R is a partial order then \\overline {\\mathcal P}R is a partial order.","type":"content","url":"/content/relation-lifting#span-based-relation-lifting","position":3},{"hierarchy":{"lvl1":"Relation Lifting","lvl2":"Extending Set-Functors to Ordered Sets"},"type":"lvl2","url":"/content/relation-lifting#extending-set-functors-to-ordered-sets","position":4},{"hierarchy":{"lvl1":"Relation Lifting","lvl2":"Extending Set-Functors to Ordered Sets"},"content":"The cospan-based relation lifting starts from the cotabulation (or collage) of a relation R by a cospan X\\stackrel j \\rightarrow \\mathbf R\\stackrel k\\leftarrow Y, where \\mathbf R is an order on the disjoint union X+Y given by (u,v)\\in\\mathbf R iff u=v\\in X or (u,v)\\in R or u=v\\in Y.\n\nThus, in order to apply a set-functor T to j and k, we need extend T from sets to orders. This follows the same idea as the relation lifting in the previous section, but now one closes under reflexivity and transitivity (and quotients by anti-symmetry in the case one works with posets).\n\nDefinition: Let (X,\\le) be a pre-order. Write X\\stackrel p \\leftarrow {\\le}\\stackrel q\\rightarrow X for the two projections. Then \\widetilde T (X,\\le) has carrier TX and the order on \\widetilde T(X,\\le)\n\nis the smallest order containing\\{(a,b) \\in TX\\times TX \\mid \\exists w\\in T(\\le)\\,.\\, Tp(w)=a \\ \\& \\ Tq(w)=b\\}.\n\nThis defines a functor\\widetilde T:\\sf Ord\\to Ord\n\nwhere \\sf Ord can be preorders or posets.\n\nRemark: The surjection \\ TX\\stackrel s \\to \\widetilde T (X,\\le) has a universal property as the universal solution to the inequation to s\\circ Tp\\le s\\circ Tq. Category theoretically, we can say that s is the coinserter of (Tp,Tq) and also that \\widetilde T is the (order-enriched) left Kan extension of DT along D where D is the embedding of sets into (discrete) ordered sets.\n\nThe following fact allows us to use known results about the span-based relation lifting to compute the order-extension of a set-functor in many examples.\n\nFact: If T preserves weak pullbacks, then applying \\widetilde T to a preorder (X,\\le) agrees with applying the relation lifting \\overline T to \\le.\n\nExample: Let (X,\\le) be a preorder. For subsets a,b\\subseteq X we have a\\le b\\in \\widetilde{\\mathcal P}(X,\\le) iff\\begin{gather}\n\\forall x\\in \\mathcal a\\,.\\, \\exists y\\in b\\,.\\,x\\le y \\\\\n\\forall y\\in \\mathcal b\\,.\\, \\exists x\\in a\\,.\\,x\\le y \\\\\n\\end{gather}\n\nIn domain theory, this is also known as the Egli-Milner order. When restricted to convex subsets (and modified wrt the empty subset)  \\widetilde{\\mathcal P} is known as the Plotkin powerdomain. See also my review of \n\npowerdomains.","type":"content","url":"/content/relation-lifting#extending-set-functors-to-ordered-sets","position":5},{"hierarchy":{"lvl1":"Relation Lifting","lvl2":"Cospan-Based Relation Lifting"},"type":"lvl2","url":"/content/relation-lifting#cospan-based-relation-lifting","position":6},{"hierarchy":{"lvl1":"Relation Lifting","lvl2":"Cospan-Based Relation Lifting"},"content":"To cotabulate a relation R\\subseteq X\\times Y by a cospanX\\stackrel j \\rightarrow \\mathbf R\\stackrel k\\leftarrow Y\n\nwe need to recall the collage \\bf R of a relation R. This notion can also be defined in case X and Y are ordered sets and R is weakening-closed, that is,\\frac{x'\\le x\\,R\\, y\\le y'}{x'\\,R\\,y'}.\n\nWe give the more general definition, because it shows that the cospan-based relation lifting cannot only be used to extend set-functors but also ordered functors.\n\nIf R\\subseteq X\\times Y is a weakening relation, then the collage \\bf R is an order on the disjoint union X+Y such that x\\mathbf R y if (i) x\\le y in X or (ii) xRy or (iii) x\\le y in Y.\n\nGiven a functor T:\\sf Set\\to Set,  we can use the collage to give a cospan-based definition of relation lifting.\n\nDefinition: Let R\\subseteq X\\times Y. Then\\widehat T: \\sf Rel\\to Rel\n\nis defined(a,b)\\in \\widehat TR if a\\le b in \\widetilde T\\bf R.\n\nFact: If T preserves weak pullbacks then \\overline T=\\widehat T.","type":"content","url":"/content/relation-lifting#cospan-based-relation-lifting","position":7},{"hierarchy":{"lvl1":"Relation Lifting","lvl2":"Conclusion"},"type":"lvl2","url":"/content/relation-lifting#conclusion","position":8},{"hierarchy":{"lvl1":"Relation Lifting","lvl2":"Conclusion"},"content":"The span-based relation lifting can be generalised to ordered sets an is well-behaved if the functor preserves weak pullbacks.\n\nThe cospan-based relation lifting is ineherently order enriched, but can be applied to the discrete case if we extend the functor to ordered sets.\n\nOne application of relation lifting is to define coalgebraic bisimulation. Here the span-based and the cospan-based definition agree if the functor preserves weak pullbacks, but in general it is only \n\ncospan bisimilarity that captures coalgebraic behavioural equivalence/preorder.\n\nThe cospan-based relation lifting generalises from ordered sets to Lawvere metric spaces and other categories enriched over a quantale.","type":"content","url":"/content/relation-lifting#conclusion","position":9},{"hierarchy":{"lvl1":"Relation Lifting","lvl2":"References"},"type":"lvl2","url":"/content/relation-lifting#references","position":10},{"hierarchy":{"lvl1":"Relation Lifting","lvl2":"References"},"content":"References can be found in the survey article\n\nKurz, Velebil: \n\nRelation Lifting.\n\n(or a functor on preorders or posets)","type":"content","url":"/content/relation-lifting#references","position":11},{"hierarchy":{"lvl1":"Semantics of Coalgebraic Logic"},"type":"lvl1","url":"/content/semantics","position":0},{"hierarchy":{"lvl1":"Semantics of Coalgebraic Logic"},"content":"(draft)\n\nWe first review the definitions and results that make sense for the general setting of coalgebraic logic.","type":"content","url":"/content/semantics","position":1},{"hierarchy":{"lvl1":"Semantics of Coalgebraic Logic","lvl2":"Syntax and Semantics"},"type":"lvl2","url":"/content/semantics#syntax-and-semantics","position":2},{"hierarchy":{"lvl1":"Semantics of Coalgebraic Logic","lvl2":"Syntax and Semantics"},"content":"one-step syntax\\mathcal A\\stackrel L \\longrightarrow \\mathcal A\n\nsyntax is the initial algebraLI\\longrightarrow I\n\none-step semanticsLP\\stackrel \\delta \\longrightarrow PT\n\nsemantics wrt X\\to TX\n\nFor the next result we assume that \\mathcal X is a concrete category. Various generalisations to abstract categories are also possible.\n\nProposition: Formulas are invariant under bisimilarity.\n\nProof: Follows from the naturality of LP \\to PT.","type":"content","url":"/content/semantics#syntax-and-semantics","position":3},{"hierarchy":{"lvl1":"Semantics of Coalgebraic Logic","lvl2":"The Logic Functor Induced by the Coalgebra Functor"},"type":"lvl2","url":"/content/semantics#the-logic-functor-induced-by-the-coalgebra-functor","position":4},{"hierarchy":{"lvl1":"Semantics of Coalgebraic Logic","lvl2":"The Logic Functor Induced by the Coalgebra Functor"},"content":"The definitions above are parametric in L and LP\\to PT.\n\nOn the other hand, from a coalgebraic point of view, T is given and we should ask how to derive L from T.\n\nIf \\mathcal A is a variety in the sense of universal algebra, then we can define a functor by its action on the free algebras. Moreover, if the variety has a presentation by operations of finite arity, then we can restrict attention to finitely generated free algebras and define L asLFn=PTSFn,\n\nwhere n ranges over finite sets.\n\n(to be continued)","type":"content","url":"/content/semantics#the-logic-functor-induced-by-the-coalgebra-functor","position":5},{"hierarchy":{"lvl1":"The Landscape"},"type":"lvl1","url":"/content/the-landscape-of-coalgebraic-logic","position":0},{"hierarchy":{"lvl1":"The Landscape"},"content":"These notes were prepared for the workshop \n\nExploring Baltag’s Universe celebrating \n\nAlexandru Baltag’s 55th birthday.","type":"content","url":"/content/the-landscape-of-coalgebraic-logic","position":1},{"hierarchy":{"lvl1":"The Landscape","lvl2":"Introduction"},"type":"lvl2","url":"/content/the-landscape-of-coalgebraic-logic#introduction","position":2},{"hierarchy":{"lvl1":"The Landscape","lvl2":"Introduction"},"content":"I met Alexandru first in 1997 in the pages of the book “Vicious Circles” by Barwise and Moss, from which I quote the introduction of the section that contains some of the earliest results in the area of coalgebra and modal logic:\n\nFor some time this Alexandru Baltag remained a mythical person.  There was no trace to find of him on the internet, which, even at that time, seemed curious given that he had important theorems to his name. Was he a practical joke of Barwise and Moss? But it wasn’t long before Alexandru and I met at \n\nAiML 1998 and we have been friends ever since.\n\nThe literature on colagebras and modal is considerable, so, on this occasion, I will restrict myself to a (personal and necessarily biased) selection of some of the main ideas.\n\nStarting from modal logic, one can see a development of subsequent generalisations and specialisations, each move adding to the theory of coalgebraic logic a new dimension, or parameter, along which the general framework can be adjusted in a compositional and uniform manner in order to take into account various modelling requirements.\n\nThe starting point of modern research into coalgebras was Aczel’s “Non-Wellfounded Set Theory” from 1988, which not only had a direct influence on “Vicious Circles”, but also showed (amongst other discoveries) that the notion of bisimilarity well-known in modal logic and concurrency theory generalises to coalgebras for a functor. We will denote this functor by T (for transition type).\n\nOne question raised by Aczel’s discovery was whether the many important results in modal logic and in concurrency have generalisations to arbitrary functors T. This was the first dimension of coalgebraic logic and is the starting point for what follows.","type":"content","url":"/content/the-landscape-of-coalgebraic-logic#introduction","position":3},{"hierarchy":{"lvl1":"The Landscape","lvl2":"Dimensions of Coalgebraic Logic"},"type":"lvl2","url":"/content/the-landscape-of-coalgebraic-logic#dimensions-of-coalgebraic-logic","position":4},{"hierarchy":{"lvl1":"The Landscape","lvl2":"Dimensions of Coalgebraic Logic"},"content":"In the talk I sketched a three dimensional picture. One axis had the functor T (the type of transitions, eg non-determinstic, probabilistic, etc), a second axis had the modal theory,  a third one had the base category. This axes, or dimensions, appear in red below (and there are more than three).\n\nWe start from modal logic, thinking of a class of Kripke frames axiomatized by a modal theory. Generalising from Kripke frames to T-coalgebras, we also need to generalise the standard modal operators \\Box and \\Diamond. There are two ways to do this known as Moss’s \\nabla and as Pattinson’s predicate liftings.\n\nNext one can ask what can be done in case of a general base cateagory \\mathcal C. Dualising the Lawvere-Linton account of algebra over a general base category one is lead to a theory of “modal predicate transformer”, that is, predicate transformers preserving coalgebraic bisimilarity.\n\nBut over a general base category, we have no handle on the syntax of the logic. To improve on this, one can specalise to categories \\mathcal C that have a Stone dual \\mathcal A. A modal logic for coalgebras for T:\\mathcal C\\to\\mathcal C is then given by a functor L:\\mathcal A\\to\\mathcal A.\n\nI summarise this development by describing an object of study and its  mathematical formalisation\n\nfollowed by a move\n\nleading to a new object of study and a new  mathematical formalisation.\n\nClassical modal logic.\nParameter: \n\nTheory\n\n\\Lambda.\n\nGeneralise Kripke frames to T-coalgebras.\n\nMoss’s Coalgebraic Logic, Pattinson’s predicate liftings.\nParameter: \n\nFunctor\n\nT.  \n\nGeneralise to arbitrary base categories \\mathcal C.\n\nPredicate transformers\n\n\\mathcal C(-,n)\\to \\mathcal C(-,m)\n\n. \nParameter: \n\nCategory\n\n\\mathcal C\n\n. \n\nSpecialise to categories \\mathcal C that have a Stone dual \\mathcal A.\n\nBasic modal logic as a functor\n\nL:\\mathcal A\\to\\mathcal A\n\n.\nParameter: Adjunction \n\nSpec \\dashv Pred: \\mathcal C^{op}\\to \\mathcal A\n\n. \n\nGeneralise to enriched adjunctions.\n\nBasic modal logic as a functor\n\nL:\\mathcal A\\to\\mathcal A\n\n.\nParameter: Enrichment. \n\nSpecialise to a quantale \\Omega of truth values.\n\nBasic modal logic as a functor\n\nL:\\mathcal A\\to\\mathcal A\n\n.\nParameter:  \n\nLattice\n\n\\Omega\n\nof truth values. \n\nRemark on Rank 1 Axioms: While T-coalgebras generalise Kripke frames, L generalises the corresponding basic modal logic. Note that the axioms of basic modal logic such as \\Box (a\\to b)\\to \\Box a \\to \\Box b are special in the sense that they are of “rank 1”, that is, every propositional variable is in the scope of exactly one modal operator. While this does not prevent us from adding more general axioms, rank 1 axioms are special because they can be accounted for by a functor.  Since functors allows us to apply special methods such as the final coalgebra and the initial algebra sequence, it can sometimes be useful to study a logic by separating out its rank 1 fragment. This technique was pioneered by Ghilardi, see eg \n\nBezhanishvili, Ghilardi and Jibladze for an overview and further references.\n\nRemark on Deriving Canonical Parameters from the Lattice of Truth Values: Work on the lattice \\Omega of truth values as a parameter is ongoing (with Jiri Velebil and Adriana Balan). One question is how a choice of \\Omega determines a “canonical” Stone type adjunction which in turn determines a “canonical” logic (given concretely in terms of operations and proof system).\n\nSummary of the Design Space of Coalgebraic Logic: Choose\n\nthe lattice of truth values \\Omega,\n\na base category \\mathcal C of state spaces,\n\na functor T:\\mathcal C\\to\\mathcal C of transition types,\n\na Stone type adjunction Spec \\dashv Pred: \\mathcal C^{op}\\to \\mathcal A for a propositional logic\n\na functor L:\\mathcal A\\to\\mathcal A for a modal expansion,\n\na theory \\Lambda of L-formulas. \n\nAdditional “Non-Category Theoretic” Dimensions: In this presentation I concentrated on parameters that have category theoretic representations as categories, functors, adjunctions or enrichements. There are further dimensions one can add. For example: \n\nKupke and Venema add winning conditions to automata-as-T-coalgebras in order to give semantics to a coalgebraic \\mu-calculus; \n\nLitak, Pattinson, Sano and Schröder develop  coalgebraic  predicate logic. \n\nPattinson and Schröder investigate the proof theory of coalgebraic logics; \n\nGorín etal build generic software tools paramaterised by T.\n\nSee also the survey paper \n\nModal logics are coalgebraic. Comput. J., 2011.","type":"content","url":"/content/the-landscape-of-coalgebraic-logic#dimensions-of-coalgebraic-logic","position":5},{"hierarchy":{"lvl1":"The Landscape","lvl2":"Acknowledgements"},"type":"lvl2","url":"/content/the-landscape-of-coalgebraic-logic#acknowledgements","position":6},{"hierarchy":{"lvl1":"The Landscape","lvl2":"Acknowledgements"},"content":"I thank Alexandru Baltag, Nick Bezhanishvili and Nima Motamed for their questions and comments.","type":"content","url":"/content/the-landscape-of-coalgebraic-logic#acknowledgements","position":7},{"hierarchy":{"lvl1":"The Landscape","lvl2":"References"},"type":"lvl2","url":"/content/the-landscape-of-coalgebraic-logic#references","position":8},{"hierarchy":{"lvl1":"The Landscape","lvl2":"References"},"content":"Coalgebraic logic draws on many influences. To mention just a few: Aczel in set theory; Goldblatt, van Benthem, Ghilardi in modal logic; Scott, Plotkin, Abramsky in domain theory; Johnstone on Stone duality. Coalgebras started to move into the mainstream of computer science with work by Jacobs and Rutten and the CMCS workshops the first of which took place in 1998.\n\nIn the following, I only list the work which I had time to mention in the presentation (but see also the references linked in the text above).\n\nBaltag’s Theorems in Barwise and Moss, Vicious Circles, 1996.\n\nLawrence Moss: Coalgebraic Logic. 1997.\n\nAlexandru Baltag. “A Structural Theory of Sets”, AIML 1998.\n\nDirk Pattinson: Coalgebraic modal logic: soundness, completeness and decidability of local consequence. Theor. Comput. Sci. 309(1-3): 177-193 (2003)\n\nAlexander Kurz, Jirí Rosický: Operations and equations for coalgebras. Math. Struct. Comput. Sci. 15(1): 149-166 (2005)\n\nClemens Kupke, Yde Venema: Coalgebraic Automata Theory: Basic Results. Log. Methods Comput. Sci. 4(4) (2008)\n\nAlexander Kurz, Jirí Rosický: Strongly Complete Logics for Coalgebras. Log. Methods Comput. Sci. 8(3) (2012)\n\nAlexander Kurz, Jiri Velebil: Enriched Logical Connections. Appl. Categorical Struct. 21(4): 349-377 (2013)\n\nFredrik Dahlqvist, Alexander Kurz: The Positivication of Coalgebraic Logics. CALCO 2017\n\nAdriana Balan, Alexander Kurz, Jiri Velebil: Extending set functors to generalised metric spaces. Log. Methods Comput. Sci. 15(1) (2019)\n\nAdriana Balan, Alexander Kurz: An equational approach to enriched distributivity. CoRR abs/2112.13290 (2021)\n\nMoss and Pattinson show in different ways that one can retain some control over the syntax and stay parametric in T. A chosen set of predicate liftings can be considered another parameter. This is similar to choose a basic set of operations when defining categories of algebras.\n\nSome axioms, so called axioms of rank 1, can be incorporated in T, but general axioms (such as transitivity)  live on in their own dimension (the parameter of modal theories).\n\nComposing functors is compositional, as is composing their logics. (It is well-known in the semantics of programming languages that there are problems composing the monads for non-determinism and probability, but here we only compose functors. See \n\n(Goy and Petrisan, 2020) for a recent work on composing the monads.)\n\nNaturality of the predicate transformers guarantess that they are invariant under coalgebraic bisimilarity.\n\nOne might say that the functor T:\\mathcal C\\to\\mathcal C is just one parameter comprising both \\mathcal C and T, but one can extend functors along varying \\mathcal C. For example, the powerset functor on sets extends to the convex powerset functor on posets, to the Vietoris functor on Stone spaces, to the Plotkin powerdomain on domains, to the Hausdorff metric for metric spaces, etc.\n\nChanging the base category can be used to model a variety of different phenomena. Partially ordered sets can be used to weaken bisimulation to simulation. Categories of algebras can be used to equip coalgebras (seen as automata) with internal memory. Categories such as nominal sets (and various presheaf categories) can be used to treat binding and local store. Measurable spaces are useful for probabilistic transition systems. Starting from a given logic, categories of topological spaces (such as Stone spaces) can be used to obtain coalgebraic semantics that is dually equivalent to the corresponding algebraic semantic. Categories of domains can be used to obtain solutions for mixed variance domain equations and build models for the untyped lambda calculus.\n\nThe adjunction can be varied to put different logics into the same picture. For example, starting from Sets, one my use boolean algebras or complete atomic boolean algebras as the semantics. One may also want to drop negation or only retain conjunction. On the other hand, starting from, say Boolean algebras, one may want to topologise the semantic side and consider Stone spaces.\n\nEnrichment is useful to enrich the notion of bismilarity. For example, order enriched category theory deals with simulations and metric-space enriched category deals with metric bisimulations.\n\nA quantale \\Omega determines a “multi-ordered set” (\\Omega-enriched category) with an order for each element of the quantale and composition of orderes governed by the multiplication of the quantale. Metric spaces are a special case of multi-ordered sets. The category of multi-ordered sets (\\Omega-enriched categories) then serves as the base category \\mathcal C over which one takes T-coalgebras.\n\nWhile monads provide a means to account for general theories functors account onky for rank 1.\n\nSome comments on the design space of coalgebraic logic.\n\nThe quantale \\Omega determines a (residuated) lattice of truth values and a multi-order (metric) on the state space.\n\nThe base category \\mathcal C can add topological structure and/or algebraic structure. Topological structure can be used to designate definable/observable sets of states. Algebraic structure can be used to add memory to states.\n\nThe functor T:\\mathcal C\\to\\mathcal C chooses the “computational effects” of interest, which can include combinations of input/output, non-determinism, probability and more. Some computational effects (such as variable binding and function space or continuous probability) require base categories \\mathcal C with special properties while others (such as powerset) can be varied uniformly over a range of base categories.\n\nT determines the notion of bisimilarity (observational equivalence, behavioural equivalence) of interest.\n\nThe logic L can either be obtained as the Stone dual of T or created in an adhoc fashion to suit particular modelling requirements.\n\nVarious “bells and whistles” can be added.","type":"content","url":"/content/the-landscape-of-coalgebraic-logic#references","position":9},{"hierarchy":{"lvl1":"Origins in Domain Theory"},"type":"lvl1","url":"/content/the-origins-of-coalgebra-in-domain-theory","position":0},{"hierarchy":{"lvl1":"Origins in Domain Theory"},"content":"(sketchy draft ... references to be added)\n\nThe theory of coalgebras in computer science can be traced back to Scott’s work in the 1970ies on domain theory. In this setting, it often happens, and later was sometimes taken to be axiomatic, that initial algebras and final coalgebras coincide. More explicitely, given a category \\mathcal C of domains and a type constructor (= functor)T:\\mathcal C\\to \\mathcal C\n\nthe initial T-algebra and the final T-coalgebra are isomorphic and we can take either one as the solution to the domain equationX\\cong TX.\n\nScott had shown the importance of such solutions to the the theory of programming languages by constructing a domain for lambda calculus solving the equation X\\cong X^X. This required a sophistocated construction of the base category \\mathcal C. Researchers soon realised that this method is very powerful and can be applied to a variety of functors T and categories \\mathcal C. In particular, Scott’s method is also of great interest in situations that are simpler than the one that arises in the semantics of lambda calculus.\n\nFor example, the theory of algebraic data types largely concerns itself with polynomial functors T on the category of sets. Nevertheless, initial algebra semantics, as developed in the 1980ies and 90ies, is a powerful tool with many applications to programming languages.\n\nAn important observation is that for most categories, contrary to what happens in Scott’s original setting, initial algebra semantics and final coalgebra semantics fall apart. It was only in the 1990ies that researchers gradually became aware that in such situations the final coalgebra semantics is at least as important for applications to programming languages as the initial algebra semantics.\n\nRoughly speaking, the relationship between initial algebra and final coalgebra semantics is as follows. From the universal properties of inital algebra and final coalgebra it follows that there is a unique arrowI\\to Z\n\nfrom the initial algebra TI\\to I to the final coalgebra Z\\to TZ. Intuitively the initial algebra is the algebra of finite terms, while the final coalgebra is the coalgebra of infinite terms. Finite terms are important to model data and programs. Infinite terms are important to model program behaviour, in particular non-terminating computations.\n\n(to be continued)","type":"content","url":"/content/the-origins-of-coalgebra-in-domain-theory","position":1},{"hierarchy":{"lvl1":"Translations of Logics"},"type":"lvl1","url":"/content/translations","position":0},{"hierarchy":{"lvl1":"Translations of Logics"},"content":"...","type":"content","url":"/content/translations","position":1},{"hierarchy":{"lvl1":"Translations of Logics","lvl2":"References"},"type":"lvl2","url":"/content/translations#references","position":2},{"hierarchy":{"lvl1":"Translations of Logics","lvl2":"References"},"content":"Kurz-Leal","type":"content","url":"/content/translations#references","position":3},{"hierarchy":{"lvl1":"Cospan Bisimulation: Overview"},"type":"lvl1","url":"/content/csp0-cospan-bisimulation-introduction","position":0},{"hierarchy":{"lvl1":"Cospan Bisimulation: Overview"},"content":"(draft)\n\nCospan Bisimulation (\n\nformerly) suggests that cospan bisimulation is a better behaved alternative than tradiditional span bisimulation. It relies on the notion of posetification of a functor in order to apply Worrell’s cospan bisimulation for quantale-enriched coalgebras also to set coalgebras.\n\nBisimulation for Ordered Coalgebras (\n\nformerly) recalls Worrell’s cospan bisimulations. This section presents various example of ordered coalgebras, with an emphasis on ordered neighbourhood coalgebras.\n\nNeighbourhood Coalgebras (\n\nformerly) and \n\nMonotone Neighbourhood Coalgebras (\n\nformerly) are standard examples of coalgebras for which span bisimulations fail to fully account for bisimilarity. We review some of the literature on this topic from the point of view of cospan bisimulation.\n\nLogic of Ordered Neighbourhood Coalgebras (\n\nformerly) reviews the connection with modal logic. This section can be skipped.\n\nCospan Bisimulation 2 (\n\nformerly) lays out some of the basic results relating span and cospan (bi)simulation. In particular, every span bisimulation is a cospan bisimulation and the converse holds for weak pullback preserving functors.\n\nDoctrinal Adjunction reviews some category theory about lifting of functors from a base adjunction to coalgebras. These results are used in Section \n\nCospan Bisimulation 2.\n\nExact Squares contain the beginning of a review of the histroy of exact squares. This material is not relevant for our present purposes, but should be expanded at some later point. Can be skipped.\n\nQuestions: More examples? More theorems? Is this just a nice observation or is there something new we can do with this? Maybe connect it with logic induced bisimulations? There are more technical questions at \n\nCospan Bisimulation 2.","type":"content","url":"/content/csp0-cospan-bisimulation-introduction","position":1},{"hierarchy":{"lvl1":"Cospan Bisimulation: Overview","lvl2":"Summary of Bisimulations"},"type":"lvl2","url":"/content/csp0-cospan-bisimulation-introduction#summary-of-bisimulations","position":2},{"hierarchy":{"lvl1":"Cospan Bisimulation: Overview","lvl2":"Summary of Bisimulations"},"content":"Let T:Ord\\to Ord be a functor and \\xi:X\\to TX and \\nu:Y\\to TY and R\\subseteq X\\times Y.\n\nR is a cospan-(bi)simulation iff xRy satisfies the conditions below for all x\\in X and y\\in Y.T=\\overline{2^{2^-}}\\begin{gather}\n\\forall a\\in\\xi(x).\\exists b \\in \\nu(y). (\\forall x\\in a.\\exists y\\in b. xRy) \\ \\& \\ (\\forall y\\in b.\\exists x\\in a. xRy)\\\\[1ex]\n\\forall b\\in\\nu(y).\\exists a \\in \\xi(x). (\\forall x\\in a.\\exists y\\in b. xRy) \\ \\& \\ (\\forall y\\in b.\\exists x\\in a. xRy)\n\\end{gather}T=\\overline{Up\\mathcal P}\\begin{gather*}\n\\forall a\\in\\xi(x)\\,.\\,\\exists b\\in\\nu(y)\\,.\\,\\forall y\\in b\\,.\\,\\exists x\\in a\\,.\\, xRy\\\\ \n\\forall b\\in\\nu(y)\\,.\\,\\exists a\\in\\xi(x)\\,.\\,\\forall x\\in a\\,.\\,\\exists y\\in b\\,.\\, xRy\n\\end{gather*}T=\\mathcal D\\mathcal U\\begin{align}\n\\forall a\\in\\xi x.\\exists b\\in\\nu y. \\forall y\\in b.\\exists x\\in a.\\ xRy \n\\end{align}T=\\mathcal U\\mathcal D\\begin{align}\n\\forall b\\in\\nu y.\\exists a\\in\\xi x. \\forall x\\in a.\\exists y\\in b.\\  xRy \n\\end{align}","type":"content","url":"/content/csp0-cospan-bisimulation-introduction#summary-of-bisimulations","position":3},{"hierarchy":{"lvl1":"Cospan Bisimulation"},"type":"lvl1","url":"/content/csp1-cospan-bisimulation","position":0},{"hierarchy":{"lvl1":"Cospan Bisimulation"},"content":"(draft)\n\nOne of the starting points of coalgebra was Aczel’s discovery, see also (Rutten, 2000), that span-bisimulation, also known as Aczel-Mendler bisimulation, can capture category theoretically the combinatorial notion of bisimulation.\n\nFrom an axiomatic point of view, one drawback of span-bisimulations is that, in order to for span-bisimulations to capture the coalgebraic notion of equivalence (aka behavioural equivalence), the coalgebra-functor needs to weakly preserve pullbacks (=preserve weak pullbacks).\n\nIn their proof of the final coalgebra, in order to not depend on this assumption, Aczel and Mendler work with quotients and cospans instead of spans. What they call precongruences can be considered as a precursor to the notion of cospan-bisimulation, defined below.\n\nOne disadvantage of cospans in Set is that they do not allow us to capture general relations. This can be circumvented by working poset enriched.\n\nRecall that\n\nfor every relation R\\subseteq X\\times Y the collage \\mathbf R is the poset on the disjoint union X+Y encoding R (with x\\le_{\\bf R} y \\ \\Leftrightarrow \\  xRy),\n\nfor every functor T:Set\\to Set there is a preordification \\overline T:Pre\\to Pre. \n\nDefinition (cospan-bisimulation): Let T:Set\\to Set be a functor. A relation R\\subseteq X\\times Y is a cospan bisimulation between coalgebras X\\stackrel\\xi\\longrightarrow TX and  Y\\stackrel\\nu\\longrightarrow TY if the unique arrow \\mathbf R\\to\\overline T \\mathbf R that makes the diagram\\begin{array}{}\nX  & \\rightarrow & \\mathbf R & \\leftarrow & Y\\\\\n\\downarrow &&\\downarrow && \\downarrow \\\\\nTX  & \\rightarrow & \\overline T\\mathbf R & \\leftarrow & TY\n\\end{array}\n\ncommute is order preserving. As we will see now, this notion does also work well in case of set-functors that do not preserve weak pullbacks. But let us first start with the familiar case of Kripke frames.","type":"content","url":"/content/csp1-cospan-bisimulation","position":1},{"hierarchy":{"lvl1":"Cospan Bisimulation","lvl2":"Kripke models"},"type":"lvl2","url":"/content/csp1-cospan-bisimulation#kripke-models","position":2},{"hierarchy":{"lvl1":"Cospan Bisimulation","lvl2":"Kripke models"},"content":"For a starter we can illustrate what happens in the case of Kripke frames, that is, T=\\mathcal P is the powerset functor.\n\nProposition (Balan et al, 2015): The posetification of \\mathcal P is the convex powerset functor \\mathcal{\\overline P}.\n\nBy definition, then, R is a cospan-bisimulation iffxRy \\ \\ \\Rightarrow \\ \\ \\xi x \\le_{\\mathcal{\\overline P}R} \\nu y,\n\nwhich, by definition of the order on \\mathcal{\\overline P}\\mathbf R, gives us the usual definition of a bisimulation on Kripke frames (to emphasise the coalgebraic nature of Kripke frames we write x'\\in\\xi(x) instead of x\\to x' and y'\\in\\nu(y) instead of y\\to y').\n\nCorollary: R is a cospan-bisimulation between Kripke frames \\xi:X\\to TX and \\nu:Y\\to TY iff xRy implies\\begin{gather}\n\\forall x'\\in\\xi(x).\\exists y'\\in\\nu(y).  x'Ry' \\\\[1ex]\n\\textrm { and }\\\\[1ex]\n\\forall y'\\in\\nu(y).\\exists x'\\in\\xi(x).  x'Ry' \\\\  \n\\end{gather}","type":"content","url":"/content/csp1-cospan-bisimulation#kripke-models","position":3},{"hierarchy":{"lvl1":"Cospan Bisimulation","lvl2":"Monotone Neighbourhood Coalgebras"},"type":"lvl2","url":"/content/csp1-cospan-bisimulation#monotone-neighbourhood-coalgebras","position":4},{"hierarchy":{"lvl1":"Cospan Bisimulation","lvl2":"Monotone Neighbourhood Coalgebras"},"content":"In this subsection we look at coalgebras for the functor Up\\mathcal P:Set\\to Set and the associated notion of cospan-bisimulation induced by its posetification \\overline{Up\\mathcal P}. For cospan-(bi)simulations for related functors Pos\\to Pos see the section on \n\nMontone Neighbourhood Coalgebras.\n\nProposition (Corollary 5 in Dahlqvist and Kurz, 2017): The preordification of the monotone neighbourhood functor T=Up\\mathcal P is \\mathcal D \\mathcal U ordered byA\\le B \\quad\\stackrel{def}\\Longleftrightarrow\\quad \\forall a\\in A.\\exists b\\in B. {\\uparrow}b \\subseteq {\\uparrow} a \\ \\ \\ \\textrm{and} \\ \\ \\  \\forall b\\in B.\\exists a\\in A. {\\downarrow} a \\subseteq {\\downarrow} b\n\nfor all A,B\\in \\mathcal D\\mathcal UX.\n\nThe proof relies on the following lemma, see also Proposition 8.25 in (Hansen, 2003).\n\nLemma:  Let R\\subseteq X\\times Y with projections \\pi_1:R\\to X, \\pi_2:R\\to Y onto. There is a C\\in TR s.t.\\begin{gather*}\n\\forall a\\in A\\,.\\,\\exists c\\in C\\,.\\, \\pi_1[c]\\subseteq a\\\\ \n\\forall c\\in C\\,.\\,\\pi_1[c]\\in A\\\\\n\\forall b\\in B\\,.\\,\\exists c\\in C\\,.\\, \\pi_2[c]\\subseteq b\\\\\n\\forall c\\in C\\,.\\,\\pi_2[c]\\in B\n\\end{gather*}\n\nif and only if\\begin{gather*}\n\\forall a\\in A\\,.\\,\\exists b\\in B\\,.\\,\\forall y\\in b\\,.\\,\\exists x\\in a\\,.\\, xRy\\\\ \n\\forall b\\in B\\,.\\,\\exists a\\in A\\,.\\,\\forall x\\in a\\,.\\,\\exists y\\in b\\,.\\, xRy\n\\end{gather*}\n\nRemark: “only if” does not need the \\pi_i to be onto.\n\nProof of the Proposition: Recall that Tf={\\uparrow}f[-]. By definition (see Sec 3.3 in Dahlqvist and Kurz, 2017), the posetification has A\\le B if there is C such that {\\uparrow}\\pi_1[C]=A and {\\uparrow}\\pi_2[C]=B, which is equivalent to the left-hand side of the lemma. On the other hand, the definition of A\\le B in the proposition is equivalent to the right-hand side of the lemma. Finally, notice that the \\pi_i are onto because the order is reflexive (and T preserves surjections).\n\nWe have shown that cospan-bisimulations capture Pauly’s notion of bisimulation for neighbourhood frames:\n\nCorollary: R is a cospan-bisimulation between monotone neighbourhood frames \\xi:X\\to TX and \\nu:Y\\to TY iff xRy implies\\begin{gather*}\n\\forall a\\in\\xi(x)\\,.\\,\\exists b\\in\\nu(y)\\,.\\,\\forall y\\in b\\,.\\,\\exists x\\in a\\,.\\, xRy\\\\ \n\\forall b\\in\\nu(y)\\,.\\,\\exists a\\in\\xi(x)\\,.\\,\\forall x\\in a\\,.\\,\\exists y\\in b\\,.\\, xRy\n\\end{gather*}","type":"content","url":"/content/csp1-cospan-bisimulation#monotone-neighbourhood-coalgebras","position":5},{"hierarchy":{"lvl1":"Cospan Bisimulation","lvl2":"Neighbourhood Coalgebras"},"type":"lvl2","url":"/content/csp1-cospan-bisimulation#neighbourhood-coalgebras","position":6},{"hierarchy":{"lvl1":"Cospan Bisimulation","lvl2":"Neighbourhood Coalgebras"},"content":"In this subsection we take TX=2^{2^{X}}.\n\nProposition (Theorem 8 in Dahlqvist and Kurz, 2017): The posetification of the neighbourhood functor 2^{2^-} maps a poset X to the 2^{2^{CX}} where C takes connected components. (CHECK whether this is also true for the preordification.)\n\nRecall that, given R\\subseteq X\\times Y, we have (a,b)\\in \\overline{\\mathcal P}R \\quad \\Longleftrightarrow \\\n(\\forall x\\in a.\\exists y\\in b. xRy) \\ \\& \\  \n(\\forall y\\in b.\\exists x\\in a. xRy)\n\nCorollary: R is a cospan-bisimulation between neighbourhood frames \\xi:X\\to TX and \\nu:Y\\to TY iff xRy implies\\forall a\\in\\xi(x).\\exists b \\in \\nu(y). (a,b)\\in\\overline{\\mathcal P}R \\quad \\textrm{and}\\quad\n\\forall b\\in\\nu(y).\\exists a \\in \\xi(x). (a,b)\\in\\overline{\\mathcal P}R\n\nProof: Let D:Set\\to Pos be the discrete functor (apologies for using the same letter for the downset-functor). R is a cospan-bisimulation if the middle arrow in the diagram below is order-preserving.\\begin{array}{}\nDX  & \\stackrel{i}\\longrightarrow & \\quad \\mathbf R \\quad & \\stackrel{j}\\longleftarrow & DY\\\\\nD\\xi\\Bigg\\downarrow \\quad &&\\Bigg\\downarrow && \\quad\\Bigg\\downarrow D\\nu \\\\\nDTX\\cong\\overline TDX  & \\stackrel{\\overline Ti}\\longrightarrow & \\overline T\\mathbf R & \\stackrel{\\overline Tj}\\longleftarrow & \\overline TDY\\cong DTY\n\\end{array}\n\n\\mathbf R\\to \\overline T\\mathbf R is order-preserving iff xRy implies that \\overline Ti (D\\xi(x))=\\overline Tj(D\\nu(y)), that is,\\{c\\subseteq C\\mathbf R \\mid \\exists a\\in\\xi(x). i^{-1}(c)=a\\} \n\\quad =\\quad \n\\{c\\subseteq C\\mathbf R \\mid \\exists b\\in\\nu(y). j^{-1}(c)=a\\}\n\nwhere C takes connected components. “\\subseteq” can be written as\\forall a\\in\\xi(x). \\exists b\\in\\nu(y).i^{-1}(a) = j^{-1}(b)\n\nwhich is equivalent to\\forall a\\in\\xi(x).\\exists b\\in\\nu(y).\n\\ (\\forall x\\in a.\\exists y\\in b. xRy) \\ \\& \\ \n(\\forall y\\in b.\\exists x\\in a. xRy)\n\nand similarly for “\\supseteq”.","type":"content","url":"/content/csp1-cospan-bisimulation#neighbourhood-coalgebras","position":7},{"hierarchy":{"lvl1":"Cospan Bisimulation","lvl2":"Probabilistic bisimulation"},"type":"lvl2","url":"/content/csp1-cospan-bisimulation#probabilistic-bisimulation","position":8},{"hierarchy":{"lvl1":"Cospan Bisimulation","lvl2":"Probabilistic bisimulation"},"content":"Probabilistic bisimulation also provides an example of cospan bisimulations. If \\mathcal D is the functor of  finitely supported probability distributions, then the posetification \\overline{\\mathcal D} is given as follows. Let p,q be two probability distributions in \\mathcal DX. Then define p\\sqsubseteq q if p[U]\\le q[U] for all upsets U of X.","type":"content","url":"/content/csp1-cospan-bisimulation#probabilistic-bisimulation","position":9},{"hierarchy":{"lvl1":"Cospan Bisimulation","lvl2":"More Examples?"},"type":"lvl2","url":"/content/csp1-cospan-bisimulation#more-examples","position":10},{"hierarchy":{"lvl1":"Cospan Bisimulation","lvl2":"More Examples?"},"content":"... other, less well-known, examples?","type":"content","url":"/content/csp1-cospan-bisimulation#more-examples","position":11},{"hierarchy":{"lvl1":"Cospan Bisimulation","lvl2":"Results"},"type":"lvl2","url":"/content/csp1-cospan-bisimulation#results","position":12},{"hierarchy":{"lvl1":"Cospan Bisimulation","lvl2":"Results"},"content":"We will get the expected results. For T:Set\\to Set, cospan bisimulation\n\nagrees with span bisimulation if T preserves weak pullbacks\n\ncaptures behavioural equivalence without assumptions on T\n\ncoalgebraic logic is invariant under cospan-bisimulations\n\n...\n\nCould there be theorems linking cospan-bisimulations to cospan-simulations?\n\nWhat are conditions on T:Set\\to Set so that there is a forward version T^\\rightarrow:Pos\\to Pos and a backward version T^\\leftarrow:Pos\\to Pos? Can we say sth general here or must this be done on an adhoc basis for particlar T?\n\n...","type":"content","url":"/content/csp1-cospan-bisimulation#results","position":13},{"hierarchy":{"lvl1":"Cospan Bisimulation","lvl2":"References"},"type":"lvl2","url":"/content/csp1-cospan-bisimulation#references","position":14},{"hierarchy":{"lvl1":"Cospan Bisimulation","lvl2":"References"},"content":"Balan, Kurz and Velebil: \n\nPositive Fragments of Coalgebraic Logics. LMCS 2015.\n\nDahlqvist and Kurz: \n\nThe Positivication of Coalgebraic Logics. CALCO 2017. (Section 3.3 and 3.4)\n\nHansen: \n\nMonotonic modal logics. 2003. (Def 4.10, Def 8.20, Prop 8.25)\n\nHansen, Kupke and Pacuit: \n\nNeighbourhood Structures: Bisimilarity and Basic Model Theory. LMCS 2009. (Def 3.5, Thm 3.12)\n\nPauly: \n\nLogic for Social Software. 2001. (Thm 6.5)\n\nRutten, Turi: \n\n, 1993. In particular, Def 5.4 of an ordered F-bisimulation.\n\nWorrell: \n\nCoinduction for recursive data types: partial orders, metric spaces and \\Omega-categories, CMCS 2000. (Def 5.2)","type":"content","url":"/content/csp1-cospan-bisimulation#references","position":15},{"hierarchy":{"lvl1":"Cospan Bisimulation","lvl2":"Further Reading"},"type":"lvl2","url":"/content/csp1-cospan-bisimulation#further-reading","position":16},{"hierarchy":{"lvl1":"Cospan Bisimulation","lvl2":"Further Reading"},"content":"Aczel:\n\nAczel, Mendler:\n\nHansen, Kupke and Pacuit: \n\nNeighbourhood Structures: Bisimilarity and Basic Model Theory. LMCS 2009.\n\nLawvere:\n\nRutten:\n\nMuch of the following would also work for the posetification \\overline T:Pos\\to Pos. The one property that we only have for the preordification is V\\overline T \\cong TV where V the forgetful functor to Set.\n\nGiven a preorder/poset X, the order on the convex powerset of X is defined by (a,b)\\in \\mathcal{\\overline P}X if \\forall x\\in a.\\exists y\\in b. x\\le y and \\forall y\\in b.\\exists x\\in a. x\\le y.\n\na\\subseteq R^{-1}[b] and b\\subseteq R[a].","type":"content","url":"/content/csp1-cospan-bisimulation#further-reading","position":17},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras"},"type":"lvl1","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras","position":0},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras"},"content":"(draft ... reference to be added) ... (\n\nup)\n\nThe basic observation about ordinary, set-based coalgebras, due to Aczel’s monograph “Non-Well Founded Sets”, is the following:\n\nGiven a coalgebra X, the largest bisimulation on X is the kernel of the unique morphism X\\to Z into the final coalgebra Z.\n\nAczel observed this as a fact for special coalgebras such as Kripke models and then took it as a starting point for a general definition, known today as Aczel-Mendler bisimulation.\n\nMoving to the ordered setting, that is, enriching over preorders or posets, one can generalise by either formalising kernels as pullbacks (as before) or as order-pullbacks, which we call comma objects or comma squares or just commas, following terminology introduced by Lawvere in the category-enriched situation.\n\nChoosing pullbacks, one only recovers the equality on the final coalgebra. On the other hand, choosing comma squares leads to a richer theory of bisimulations that includes simulations as special cases of bisimulations.\n\nIn fact, in preorders and posets, comma and cocomma squares are exact, that is, weakening relations can be both tabulated and cotabulated. This leads us to Definition 5.2 of (Worrell 2000), which, btw, does work for more general enrichments. Also note that because of the use of co-spans there is no need to restrict to weak-pullback preserving functors.\n\nWe first need to recall that every weakening relation R:X\\looparrowright Y can be represented as a preorder/poset \\overline R such that\n\nthe underling set of \\overline R is the disjoint union of X and Y and\n\nthe order on \\overline R is the one inherited from X and Y plus x\\overline Ry  \\ \\Leftrightarrow \\  xRy.\n\nIn other words, we encode the relation R via the order of the preorder/poset \\overline R, also known as the collage of X and Y.\n\nDefinition: Let T be a (locally monotone) functor on preorders or posets. The weakening relation R:X\\looparrowright Y is an order-bisimulation between coalgebras X and Y if there is  \\overline R\\to T\\overline R such that\\begin{array}{}\nX  & \\rightarrow & \\overline R & \\leftarrow & Y\\\\\n\\downarrow &&\\downarrow && \\downarrow \\\\\nTX  & \\rightarrow & T\\overline R & \\leftarrow & TY\n\\end{array}\n\nRemark: Equivalently, R:X\\looparrowright Y is an order-bisimulation if the unqiuely determined function  \\overline R\\to T\\overline R in \\sf Set is order-preserving.\n\nRemark: It follows from the definition that R is a weakening relation. In other words, the pullback and the comma of the cospan X \\rightarrow \\overline R \\leftarrow Y coincide. (Notation: I am tempted to drop the overline over the R in the following, because of the ugly extra space it introduces between lines.)\n\nExample: The identity cospan X \\rightarrow X \\leftarrow X is not isomorphic to the collage of a relation unless X is discrete. The collage of the order on X can be obtained as the cocomma of the comma of the identity cospan.  In fact, in posets, every collage is the cocomma of its comma.\n\nExample: If we instantiate the definition above with the downset functor and the upset functor, we obtain that T-bisimulation is simulation.\n\nLet D be the downset functor. A bisimulation between D-coalgebras (X,\\xi) and (Y,\\nu) is a relation R\\subseteq X\\times Y such that xRy\\ \\Rightarrow \\ \\xi x \\subseteq \\nu y,\n\nor, more explicitely, \\begin{align}\nxRy \\ \\Rightarrow \\ & \\forall x\\to x'.\\exists y\\to y'. x' R\\, y' \n\\end{align}\n\nLet U be the upset functor. Recall that UX=[X,2]^o is ordered by reverse inclusion. A bisimulation between U-coalgebras (X,\\xi) and (Y,\\nu) is a relation R\\subseteq X\\times Y such that xRy\\ \\Rightarrow \\ \\xi x \\supseteq \\nu y,\n\nor, more explicitely,\\begin{align}\nxRy \\ \\Rightarrow \\ & \\forall y\\to y'.\\exists x\\to x'. x' R y' \n\\end{align}\n\nIntuitively, a D-bisimulation is forward simulation: Every move in the domain can be simulated by a “larger” move in the codomain. Conversely, U-bisimulation is backward simulation: Every move in the codomain can be simulated by “smaller” move in the domain. (The words “smaller” and “larger” are intended to remind us of the fact that R is a weakening relation closed under the order in X and Y.)\n\nRemark: Notice that even if X and Y are discrete, we do not obtain ordinary bisimulation, but rather ordinary forward and backward simulation. On the other hand, if we take T to be the convex powerset functor, then T-bisimulation is ordinary bisimulation.\n\nRemark: The framework of functorial modal logic guarantees that for every functor T there is a sound, complete and bisimilarity preserving logic. In this case, these are the familiar (\\Diamond,\\bot,\\vee)-logic for the downset functor and the (\\Box,\\top,\\wedge)-logic for the upset functor. In case of the convex powerset functor we obtain Dunn’s positive modal logic.","type":"content","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras","position":1},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl2":"Ordered neighbourhood coalgebras"},"type":"lvl2","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#ordered-neighbourhood-coalgebras","position":2},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl2":"Ordered neighbourhood coalgebras"},"content":"Recall from \n\nMonotone Neighbourhood Coalgebras and \n\nNeighbourhood Coalgebras the various ways in which neighbourhood coalgebras can be extended to the ordered setting. For the proofs below, we will need the following.\n\nIn \\mathcal D(X,\\le) we havea \\le b\\ \\Longleftrightarrow \\ \\forall x\\in a.\\exists y\\in b.\\ x\\le y.\n\nIn \\mathcal U(X,\\le) we havea \\le b\\ \\Longleftrightarrow \\ \\forall y\\in b.\\exists x\\in a.\\ x\\le y.","type":"content","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#ordered-neighbourhood-coalgebras","position":3},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl3":"\\mathcal D\\mathcal U-coalgebras","lvl2":"Ordered neighbourhood coalgebras"},"type":"lvl3","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#id-mathcal-d-mathcal-u-coalgebras","position":4},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl3":"\\mathcal D\\mathcal U-coalgebras","lvl2":"Ordered neighbourhood coalgebras"},"content":"Recall \\mathcal D\\mathcal UX = [[X,2],2] for ordered sets X. In particular \\mathcal D\\mathcal UX is Up\\mathcal P X for discrete X (when Up\\mathcal P X is ordered by inclusion).\n\nLemma: Let R:X\\looparrowright Y be a weakening relation and R' its collage. Then the order of \\mathcal D\\mathcal UR' is given byA\\le B \\ \\Longleftrightarrow \\ \\forall a\\in A.\\exists b\\in B.\\forall y\\in b.\\exists x\\in a.\\ xRy\n\nCorollary: A weakening relation R:X\\looparrowright Y is a cospan-(bi)simulation between \\mathcal D\\mathcal U-coalgebras (X,\\xi) and (Y,\\nu) iff\\begin{align}\nxRy \\ \\ \\Rightarrow \\ \\ & \n\\forall a\\in\\xi x.\\exists b\\in\\nu y. \\forall y'\\in b.\\exists x'\\in a.\\ x'Ry' \n\\end{align}","type":"content","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#id-mathcal-d-mathcal-u-coalgebras","position":5},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl3":"\\mathcal U\\mathcal D-coalgebras","lvl2":"Ordered neighbourhood coalgebras"},"type":"lvl3","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#id-mathcal-u-mathcal-d-coalgebras","position":6},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl3":"\\mathcal U\\mathcal D-coalgebras","lvl2":"Ordered neighbourhood coalgebras"},"content":"Recall \\mathcal U\\mathcal DX = [[X^o,2],2]^o for ordered sets X.\n\nLemma: Let R:X\\looparrowright Y be a weakening relation and R' its collage. Then the order of \\mathcal U\\mathcal DR' is given byA\\le B \\ \\Longleftrightarrow \\ \\forall b\\in B.\\exists a\\in A.\\forall x\\in a.\\exists y\\in b.\\ xRy\n\nCorollary: A weakening relation R:X\\looparrowright Y is a cospan-(bi)simulation between \\mathcal D\\mathcal U-coalgebras (X,\\xi) and (Y,\\nu) iff\nor, more explicitely,\\begin{align}\nxRy \\ \\ \\Rightarrow \\ \\ & \\forall b\\in\\nu y.\\exists a\\in\\xi x. \\forall x'\\in a.\\exists y'\\in b.\\  x'Ry' \n\\end{align}","type":"content","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#id-mathcal-u-mathcal-d-coalgebras","position":7},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl3":"Order dual of R-coherent pairs","lvl2":"Ordered neighbourhood coalgebras"},"type":"lvl3","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#order-dual-of-r-coherent-pairs","position":8},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl3":"Order dual of R-coherent pairs","lvl2":"Ordered neighbourhood coalgebras"},"content":"Can these characterisations be rephrased using the ordered version of R-coherent pairs? \n\nNo, because \\forall x\\in a. \\exists y\\in b.xRy is equivlant to a\\subseteq R^o[b].  On the other hand, the dual [JKM20] R^\\partial  of a relation R  is defined as (a,b)\\in R^\\partial \\Leftrightarrow R[a]\\subseteq b, that is, \\forall x\\in a.xRy\\Rightarrow y\\in b.\n\nRemark: The weakening relation R:(X,\\xi)\\looparrowright (Y,\\nu)  is a \\mathcal U\\mathcal D-bisimulation iffxRy \\ \\ \\Rightarrow \\ \\ \n\\forall y\\to b.\\exists x\\to a. \nR[a]\\supseteq b\n\nand R is a \\mathcal D\\mathcal U-bisimulation iffxRy \\ \\ \\Rightarrow \\ \\ \n\\forall x\\to a.\\exists y\\to b. \na\\subseteq R^o[b]","type":"content","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#order-dual-of-r-coherent-pairs","position":9},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl2":"Other Functors"},"type":"lvl2","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#other-functors","position":10},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl2":"Other Functors"},"content":"","type":"content","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#other-functors","position":11},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl4":"Ordification of the Neighbourhood Functors","lvl2":"Other Functors"},"type":"lvl4","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#ordification-of-the-neighbourhood-functors","position":12},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl4":"Ordification of the Neighbourhood Functors","lvl2":"Other Functors"},"content":"For the Ordification of the neighbourhood functor and the monotone neighbourhood functor see the note on \n\nCospan Bisimulation.","type":"content","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#ordification-of-the-neighbourhood-functors","position":13},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl4":"Downsets","lvl2":"Other Functors"},"type":"lvl4","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#downsets","position":14},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl4":"Downsets","lvl2":"Other Functors"},"content":"\\begin{align} \nxRy \\ \\Longrightarrow \\ \n& \\forall x\\in\\xi(x). \\exists y \\in b. xRy \n\\quad\\quad\n(\\Leftrightarrow \\xi(x)\\subseteq R^o[\\nu(y)])\n\\end{align}","type":"content","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#downsets","position":15},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl4":"Upsets","lvl2":"Other Functors"},"type":"lvl4","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#upsets","position":16},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl4":"Upsets","lvl2":"Other Functors"},"content":"\\begin{align} \nxRy \\ \\Longrightarrow \\ \n& \\forall y\\in\\nu(y). \\exists x \\in \\xi(x). xRy \n\\quad\\quad\n(\\Leftrightarrow R[\\xi(x)]\\supseteq \\nu(y))\n\\end{align}","type":"content","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#upsets","position":17},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl4":"Convex subsets","lvl2":"Other Functors"},"type":"lvl4","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#convex-subsets","position":18},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl4":"Convex subsets","lvl2":"Other Functors"},"content":"Is obtained from the conjunction of the two conditions above.","type":"content","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#convex-subsets","position":19},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl2":"References"},"type":"lvl2","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#references","position":20},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl2":"References"},"content":"Hansen, Kupke and Pacuit: \n\nNeighbourhood Structures: Bisimilarity and Basic Model Theory. LMCS 2009. (Def 3.5, Thm 3.12)\n\nWorrell: \n\nCoinduction for recursive data types: partial orders, metric spaces and \\Omega-categories, CMCS 2000. (Def 5.2)","type":"content","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#references","position":21},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl2":"Further Reading"},"type":"lvl2","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#further-reading","position":22},{"hierarchy":{"lvl1":"Bisimulation for Ordered Coalgebras","lvl2":"Further Reading"},"content":"Aczel:\n\nAczel, Mendler:\n\nLawvere:\n\nRutten:\n\nThis observation is useful for working with abstract order-enriched categories. If they admit commas of identity cospans, then for each object there is a span representing the order on that object.\n\nWe write x\\to x' for x'\\in\\xi x and similarly for y\\to y' etc.\n\nR-coherent pairs were introduced in [HKR09].\n\nIf R:X\\looparrowright Y is a weakening relation then R:Y^o\\looparrowright X^o is the opposite relation. In the discrete case it coincides with R^{-1}.","type":"content","url":"/content/csp2-bisimulation-for-order-enriched-coalgebras#further-reading","position":23},{"hierarchy":{"lvl1":"Neighbourhood Coalgebras"},"type":"lvl1","url":"/content/csp3-neighbourhood-coalgebras","position":0},{"hierarchy":{"lvl1":"Neighbourhood Coalgebras"},"content":"(draft)\n\nThe idea of the following is to run through (Hansen, Kupke, Pacuit, 2009) and analyse it from the point of view of cospan bisimulation.\n\nDef: Let R\\subseteq X\\times Y. The dual relation R^\\partial:2^X\\looparrowright 2^Y is defined by R[a]\\subseteq b.\n\nRemark: (a,b) are called R-coherent in Def 2.1 of Hansen-Kupke-Pacuit if (a,b)\\in R^\\partial and (b,a)\\in (R^{-1})^\\partial.\n\nRecall that the connected component functor C:Ord\\to Set is left-adjoint to the discrete functor D:Set\\to Ord. Also recall that the ordification of the neighbourhood functor is $D2^{2^{C-}}, see Theorem 8 in [DK17] and the section on \n\nCospan Bisimulation.\n\nDefinition: A neighbourhood frame is a set X with a function X\\to 2^{2^X}. An ordered neighbourhood frame is an ordered set X with an order-preserving function X\\to D2^{2^{CX}}.\n\nRemark: The function f:X\\to Y in Set  is a coalgebra morphism from \\xi:X\\to 2^{2^X} to \\nu:Y\\to 2^{2^Y} iff\\begin{gather}\n\\forall a\\in\\xi(x).\\exists b \\in \\nu(y). (\\forall x\\in a.\\exists y\\in b. fx=y) \\ \\& \\ (\\forall y\\in b.\\exists x\\in a. fx=y)\\\\[1ex]\n\\forall b\\in\\nu(y).\\exists a \\in \\xi(x). (\\forall x\\in a.\\exists y\\in b. fx=y) \\ \\& \\ (\\forall y\\in b.\\exists x\\in a. fx=y)\n\\end{gather}\n\nRemark: Similarly, R is a bisimulation if xRy implies\\begin{gather}\n\\forall a\\in\\xi(x).\\exists b \\in \\nu(y). (\\forall x\\in a.\\exists y\\in b. xRy) \\ \\& \\ (\\forall y\\in b.\\exists x\\in a. xRy)\\\\[1ex]\n\\forall b\\in\\nu(y).\\exists a \\in \\xi(x). (\\forall x\\in a.\\exists y\\in b. xRy) \\ \\& \\ (\\forall y\\in b.\\exists x\\in a. xRy)\n\\end{gather}","type":"content","url":"/content/csp3-neighbourhood-coalgebras","position":1},{"hierarchy":{"lvl1":"Neighbourhood Coalgebras","lvl2":"References"},"type":"lvl2","url":"/content/csp3-neighbourhood-coalgebras#references","position":2},{"hierarchy":{"lvl1":"Neighbourhood Coalgebras","lvl2":"References"},"content":"Hansen, Kupke, Pacuit: \n\nNeighbourhood Structures: Bisimilarity and Basic Model Theory. 2009. (Definition 2.1., ...)\n\nDahlqvist and Kurz: \n\nThe Positivication of Coalgebraic Logics. CALCO 2017. (Section 3.3 and 3.4)\n\nThe function f:X\\to Y in Ord is a coalgebra morphism from \\xi:X\\to D2^{2^{CX}} to \\nu:Y\\to D2^{2^{CY}} iff\\begin{gather}\n\\forall a\\in\\xi(x).\\exists b \\in \\nu(y). (\\forall x\\in a.\\exists y\\in b. fx=y) \\ \\& \\ (\\forall y\\in b.\\exists x\\in a. \\overline{fx}=\\overline y)\\\\[1ex]\n\\forall b\\in\\nu(y).\\exists a \\in \\xi(x). (\\forall x\\in a.\\exists y\\in b. fx=y) \\ \\& \\ (\\forall y\\in b.\\exists x\\in a. \\overline{fx}=\\overline y)\n\\end{gather}\n\nwhere \\overline{y} denotes the connected component of  y.","type":"content","url":"/content/csp3-neighbourhood-coalgebras#references","position":3},{"hierarchy":{"lvl1":"Montone Neighbourhood Coalgebras"},"type":"lvl1","url":"/content/csp3b-monotone-neighbourhood-coalgebras","position":0},{"hierarchy":{"lvl1":"Montone Neighbourhood Coalgebras"},"content":"(draft)","type":"content","url":"/content/csp3b-monotone-neighbourhood-coalgebras","position":1},{"hierarchy":{"lvl1":"Montone Neighbourhood Coalgebras","lvl2":"Introduction"},"type":"lvl2","url":"/content/csp3b-monotone-neighbourhood-coalgebras#introduction","position":2},{"hierarchy":{"lvl1":"Montone Neighbourhood Coalgebras","lvl2":"Introduction"},"content":"The idea of this section is to run through parts of [HK04] and adapt it to ordered neighbourhood frames. It could also be interesting to study metric neighbourhood frames.\n\nThe neighbourhood frames of modal logic are coalgebras for the functor Up\\mathcal P [HK04,Lem.3.4]. Here, Up\\mathcal P X=\\{A\\subseteq \\mathcal P(\\mathcal PX) \\mid a\\in A, a\\subseteq a' \\Rightarrow a'\\in A\\}. On functions, we haveUp\\mathcal P\\  f\\ A = {\\uparrow}\\{f[a] \\mid a\\in A\\}.\n\nThere are three well-known ways of extending powerset to orders. In domain theory, they are known as the upper, lower and convex powerdomain, and also known under the names of Hoare, Smyth and Plotkin, respectively. They correspond to the downset functor \\mathcal D, the upset functor \\mathcal U and the convex powerset functor \\overline{\\mathcal P}. The first two arise from ordering powerset by inclusion and reverse inclusion. The third arises as the posetification of the powerset.\n\nSimilarly, there are three ways to extend the monotone neighbourhood functor Up\\mathcal P to posets.\n\nRecall that on objects \\mathcal UX=[X,2]^o and \\mathcal DX = [X^o,2]. As a functor (and as a monad)\\mathcal D\\mathcal U X=[[X,2],2]\n\nand\\mathcal U\\mathcal DX=[[X^o,2],2]^o.\n\nOn discrete X, we have \\mathcal D\\mathcal UX = (\\mathcal U\\mathcal DX)^o, so both are legitimate order generalisations of the functor Up\\mathcal P.\n\nFinally, there is also the posetification \\overline{Up\\mathcal P}.\n\nWe derive the notions of \n\ncospan (bi)simulation of the functors \\mathcal D\\mathcal U and \\mathcal U\\mathcal D and Up\\mathcal P.","type":"content","url":"/content/csp3b-monotone-neighbourhood-coalgebras#introduction","position":3},{"hierarchy":{"lvl1":"Montone Neighbourhood Coalgebras","lvl2":"Coalgebra Morphisms"},"type":"lvl2","url":"/content/csp3b-monotone-neighbourhood-coalgebras#coalgebra-morphisms","position":4},{"hierarchy":{"lvl1":"Montone Neighbourhood Coalgebras","lvl2":"Coalgebra Morphisms"},"content":"Proposition: f is a morphism of \\mathcal D\\mathcal U-coalgebras iff\\begin{gather}\n\\forall a\\in \\xi x.\\exists b\\in\\nu(fx).\\forall y\\in b.\\exists x\\in a. fx \\le y\\\\[1ex]\n\\forall b\\in \\nu(fx).\\exists a\\in\\xi(x).\\forall x\\in a.\\exists y\\in b. \\ y\\le fx\n\\end{gather}\n\nf is a morphism of \\mathcal D\\mathcal U-coalgebras iff\\begin{gather}\n\\forall a\\in \\xi x.\\exists b\\in\\nu(fx).\\forall y\\in b.\\exists x\\in a. fx \\ge y\\\\[1ex]\n\\forall b\\in \\nu(fx).\\exists a\\in\\xi x.\\forall x\\in a.\\exists y\\in b. y \\ge fx \n\\end{gather}\n\nf is a morphism of \\overline{Up\\mathcal P}-coalgebras if\n\nMorphisms of \\mathcal D\\mathcal U and \\mathcal U\\mathcal D-coalgebras coincide on discrete coalgebras. Here is an attempt at a visual summary:\n\n![](\n\nhttps://​i​.imgur​.com​/a1wXKKp​.png =400x600)","type":"content","url":"/content/csp3b-monotone-neighbourhood-coalgebras#coalgebra-morphisms","position":5},{"hierarchy":{"lvl1":"Montone Neighbourhood Coalgebras","lvl2":"Morphisms as Relations"},"type":"lvl2","url":"/content/csp3b-monotone-neighbourhood-coalgebras#morphisms-as-relations","position":6},{"hierarchy":{"lvl1":"Montone Neighbourhood Coalgebras","lvl2":"Morphisms as Relations"},"content":"In sets every function is a relation and every coalgebra morphism a bisimulation. In ordered sets every function f:X\\to Y gives rise to two relation f_\\diamond:X\\looparrowright Y and f^\\diamond: Y\\looparrowright X with(x,y)\\in f_\\diamond \\ \\Leftrightarrow \\ fx\\le y\n\\quad\\quad\\quad\\quad\n(y,x)\\in f^\\diamond \\ \\Leftrightarrow \\ y\\le fx\n\nWe have shown in \n\nCospan Bisimulations 2 that these relations are cospan (bi)simulations if f is a coalgebra morphism. This example suggests that more is true.\n\nProposition: f is a morphism of \\mathcal D\\mathcal U-coalgebras iff f_\\diamond and f^\\diamond are cospan-(bi)simulations.\n\nProof: We only need to instantiate the characterisation of \\mathcal D\\mathcal U-cospan-(bi)simulation from the section on \n\nBisimulation for Ordered Coalgebras.\n\nAn analogous statement is true for \\mathcal U\\mathcal D-coalgebras (CHECK).","type":"content","url":"/content/csp3b-monotone-neighbourhood-coalgebras#morphisms-as-relations","position":7},{"hierarchy":{"lvl1":"Montone Neighbourhood Coalgebras","lvl2":"Modal Logic"},"type":"lvl2","url":"/content/csp3b-monotone-neighbourhood-coalgebras#modal-logic","position":8},{"hierarchy":{"lvl1":"Montone Neighbourhood Coalgebras","lvl2":"Modal Logic"},"content":"![](\n\nhttps://​i​.imgur​.com​/1FLZ0fs​.png =80x80)\n\n(WHERE DO WE SEE THE DIFFERENCE BETWEEN THE TYPES OF COALGEBRAS IN THE LOGICS?)\n\nDef:  The two-sorted modal logic for ordered neighbourhood frames has point-formulas \\phi and set-formulas \\psi given as\\begin{align*}\n\\phi &::= \\Box\\psi \\mid \\phi\\wedge\\phi \\mid \\phi\\vee\\phi \\mid p \\\\[1ex]\n\\psi &::= \\Diamond\\phi \\mid \\psi\\wedge\\psi \\mid \\psi\\vee\\psi\n\\end{align*}\n\nand axioms saying that \\Box preserves finite meets and \\Diamond preserves finite joins.\n\nRemark: This logic can be derived from the semantics using the principles of functorial modal logic (FML). This construction then guarantees the following proposition.\n\nProp: Formulas are invariant under morphisms and behavioural equivalence. Moreover, the logic is sound and complete for ordered neighbourhood models.","type":"content","url":"/content/csp3b-monotone-neighbourhood-coalgebras#modal-logic","position":9},{"hierarchy":{"lvl1":"Montone Neighbourhood Coalgebras","lvl2":"References"},"type":"lvl2","url":"/content/csp3b-monotone-neighbourhood-coalgebras#references","position":10},{"hierarchy":{"lvl1":"Montone Neighbourhood Coalgebras","lvl2":"References"},"content":"Dahlqvist and Kurz: \n\nThe Positivication of Coalgebraic Logics. CALCO 2017. (Section 3.3 and 3.4)\n\nHansen, Kupke: \n\nA Coalgebraic Perspective on Monotone Modal Logic. 2004.\n\nM. Pauly. Bisimulation for general non-normal modal logic. Manuscript, 1999.","type":"content","url":"/content/csp3b-monotone-neighbourhood-coalgebras#references","position":11},{"hierarchy":{"lvl1":"Logic of Ordered Neighbourhood Coalgebras"},"type":"lvl1","url":"/content/csp3c-logic-of-ordered-neighbourhood-coalgebras","position":0},{"hierarchy":{"lvl1":"Logic of Ordered Neighbourhood Coalgebras"},"content":"(draft ... references to be added) ... (\n\nup)","type":"content","url":"/content/csp3c-logic-of-ordered-neighbourhood-coalgebras","position":1},{"hierarchy":{"lvl1":"Logic of Ordered Neighbourhood Coalgebras","lvl2":"Introduction"},"type":"lvl2","url":"/content/csp3c-logic-of-ordered-neighbourhood-coalgebras#introduction","position":2},{"hierarchy":{"lvl1":"Logic of Ordered Neighbourhood Coalgebras","lvl2":"Introduction"},"content":"We write 2 for the 2-chain 0<1 in various ordered categories such as posets or bounded distributed lattices.\n\nLet\n\nU:Pos\\to Pos take upsets ordered by reverse inclusion: UX=[X,2]^o\n\nD:Pos\\to Pos take downsets ordered by inclusion: DX=[X^o,2]\n\nLet\n\n\\mathcal X be the category of poset\n\n\\mathcal A be the category of bounded distributive lattices\n\nT=DU\n\nThen Coalg(T) is category of (monotone) neighbourhood frames (over posets). In particular DUX=Up\\mathcal PX for discrete X. Note that DUX=2^{2^X} if we define 2^X as the poset of monotone maps X\\to 2.\n\nLet\n\nP:\\mathcal X\\to\\mathcal A be the contravariant functor X\\mapsto 2^X.\n\nS:\\mathcal A\\to\\mathcal X the contravariant functor A\\mapsto DL(A,2).\n\nThen\n\nthe dual U^\\partial:DL\\to DL of U is presented by operations and equations as follows. U^\\partial A is generated by \\{\\Box a\\mid a\\in PX\\} and the equations stating that \\Box preserves finite meets.  This gives an isomorphismU^\\partial PX\\to UPX\n\nfor finite posets X.\n\nthe dual D^\\partial:DL\\to DL of D is presented by operations and equations as follows. D^\\partial A is generated by \\{\\Diamond a\\mid a\\in PX\\} and the equations stating that \\Diamond preserves finite meets.  This gives an isomorphismD^\\partial PX\\to DPX\n\nfor finite posets X.","type":"content","url":"/content/csp3c-logic-of-ordered-neighbourhood-coalgebras#introduction","position":3},{"hierarchy":{"lvl1":"Logic of Ordered Neighbourhood Coalgebras","lvl2":"The 2-sorted view"},"type":"lvl2","url":"/content/csp3c-logic-of-ordered-neighbourhood-coalgebras#the-2-sorted-view","position":4},{"hierarchy":{"lvl1":"Logic of Ordered Neighbourhood Coalgebras","lvl2":"The 2-sorted view"},"content":"We can also think of coalgebrasX \\to UDX\n\nas special 2-dimensional coalgebras(X,Y) \\to (UY,DX).\n\nThe dual of these coalgebras on the algebraic side are algebras(D^\\partial B,U^\\partial A)\\to (A,B)\n\nRemark: Given functors F and G,  \n\nKurz-Petrisan calls the functor which maps (X,Y) to (FY,GX) the symmetric composition of F and G. While the presentation of the functor FG is typically not compositional in the presentations of F and G, the symmetric composition does have the obvious componentwise presentation.","type":"content","url":"/content/csp3c-logic-of-ordered-neighbourhood-coalgebras#the-2-sorted-view","position":5},{"hierarchy":{"lvl1":"Logic of Ordered Neighbourhood Coalgebras","lvl2":"An adjunction"},"type":"lvl2","url":"/content/csp3c-logic-of-ordered-neighbourhood-coalgebras#an-adjunction","position":6},{"hierarchy":{"lvl1":"Logic of Ordered Neighbourhood Coalgebras","lvl2":"An adjunction"},"content":"Let Coalg(F,G) be the category of 2-sorted coalgebras of the kind(X,Y)\\to (FY,GX).\n\nTheorem: Coalg(FG) is a full reflective subcategory of Coalg(F,G).\n\nProof: We map X\\to FGX to (X,GX)\\to (FGX,GX) where the second component is the identity. This functor has a left adjoint which maps  (X,Y)\\to (FY,GX) to X\\to FY\\to FGX.\n\nThe unit of the adjunction is the obvious coalgebra morphism from (X,Y)\\to (FY,GX) to (X,GX)\\to (FGX,GX). The counit is the identity.\n\nMoreover, the right-adjoint is full and faithful. QED\n\nCorollary: Coalg(FG) is closed under limits in Coalg(F,G). In particular, the final coalgebra in Coalg(F,G) is also the final coalgebra in Coalg(FG).\n\nCorollary: Alg(FG) is a full co-reflective subcategory of Alg(F,G).\n\nCorollary: The category of D^\\partial U^\\partial-algebras is a full coreflective subcategory of Alg(D^\\partial, U^\\partial).\n\nCorollary: Alg(FG) is closed under colimits in Alg(F,G). In particular, the initial algebra in Alg(F,G) is also the initial algebra in Alg(FG).","type":"content","url":"/content/csp3c-logic-of-ordered-neighbourhood-coalgebras#an-adjunction","position":7},{"hierarchy":{"lvl1":"Logic of Ordered Neighbourhood Coalgebras","lvl2":"References"},"type":"lvl2","url":"/content/csp3c-logic-of-ordered-neighbourhood-coalgebras#references","position":8},{"hierarchy":{"lvl1":"Logic of Ordered Neighbourhood Coalgebras","lvl2":"References"},"content":"Pauly: ...\n\nHansen, Kupke: ...\n\nKurz, Petrisan: ...\n\n...","type":"content","url":"/content/csp3c-logic-of-ordered-neighbourhood-coalgebras#references","position":9},{"hierarchy":{"lvl1":"Cospan Bisimulation 2"},"type":"lvl1","url":"/content/csp4-cospan-bisimulation-2","position":0},{"hierarchy":{"lvl1":"Cospan Bisimulation 2"},"content":"(draft ... references to be added)","type":"content","url":"/content/csp4-cospan-bisimulation-2","position":1},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"Introduction"},"type":"lvl2","url":"/content/csp4-cospan-bisimulation-2#introduction","position":2},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"Introduction"},"content":"We collect some results on cospan bisimulations. These results invariable relate ordinary bisimulations on sets with ordered bisimulation on ordered sets. Since bisimulations on ordered sets include simulations as well as bisimulations we will call them (bi)simulations.","type":"content","url":"/content/csp4-cospan-bisimulation-2#introduction","position":3},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl3":"Overview","lvl2":"Introduction"},"type":"lvl3","url":"/content/csp4-cospan-bisimulation-2#overview","position":4},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl3":"Overview","lvl2":"Introduction"},"content":"We first review notation and define the notion of an order-extension of a set-functor.\n\nThe subsection span and cospan bisimulations investigates the relationship between cospan bisimulations and span bisimulations.\n\nThe subsection cospan (bi)simulations and change of base looks at cospan (bi)simulations enriched over different quantales.","type":"content","url":"/content/csp4-cospan-bisimulation-2#overview","position":5},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl3":"Summary","lvl2":"Introduction"},"type":"lvl3","url":"/content/csp4-cospan-bisimulation-2#summary","position":6},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl3":"Summary","lvl2":"Introduction"},"content":"Together this shows that cospan (bi)simulation works uniformly over sets, orders, metric spaces and \\Omega-categories. For example, Rutten’s final coalgebra theorem for sets can now be seen as a special case of Worrell’s final coalgebra theorem for \\Omega-categories.","type":"content","url":"/content/csp4-cospan-bisimulation-2#summary","position":7},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"Questions"},"type":"lvl2","url":"/content/csp4-cospan-bisimulation-2#questions","position":8},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"Questions"},"content":"If f_\\diamond and f^\\diamond are cospan-bisimulations, is then f a coalgebra morphism?\n\nConnections with logic induced bisimulations?","type":"content","url":"/content/csp4-cospan-bisimulation-2#questions","position":9},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"Notation"},"type":"lvl2","url":"/content/csp4-cospan-bisimulation-2#notation","position":10},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"Notation"},"content":"In this section,\n\nOrd denotes the category Pre of preorders or the category Pos of posets.\n\nD:Set\\to Ord denotes the discrete functor and we write\nC\\dashv D\\dashv V\n\n for the induced chain of adjoints.\n\nT denotes a functor Set\\to Set.","type":"content","url":"/content/csp4-cospan-bisimulation-2#notation","position":11},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"Order-Extensions"},"type":"lvl2","url":"/content/csp4-cospan-bisimulation-2#order-extensions","position":12},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"Order-Extensions"},"content":"Following on from \n\npart one, we are interested in preordification T' of T. Preordifictions are universal solutions to the problem of finding a T' together with a transformation DT\\to T'D. In fact, the preordification T' of T can be defined as the Ord-enriched left Kan extension of DT along D. But some results hold more generally for any ordered extension DT\\to T'D.\n\nDefinition: We call T':Ord\\to Ord an order-extension of T:Set\\to Set if there is a natural transformationDT\\to T'D.\n\nRemark: Equivalently, T' is an order-extension of T if there is a natural tranformation T\\to DT'V. This also captures the intuition that T' adds ordering to T. If one insists on T\\to DT'V being an iso, this notion is equivalent to the one of Jacobs and Jacobs-Hughes (ADD REFERENCES).\n\nQuestion: T\\to DT'V iso is equivalent to DT\\to T'D being bijective. Is there an interesting example of an order-extension for which DT\\to T'D is not bijective?\n\nRemark: The mate of DT\\to T'D is TV\\to VT'. If T' is the preordification then TV\\to VT' is an iso, but for posetifications this does not need to be the case as the example of convex powerset (=the posetification of  powerset) shows. We summarise some of the relationships between properties of these natural transformations in the table below.\n\n\n\n\n\n\n\n\n\n1\n\nDT\\to T'D\n\nT’ is an order-extension of T\n\n\n\n2\n\nDT\\to T'D iso\n\nT' a strict order-extension of T\n\n\n\n3\n\nT' left Kan extension,\n\nT' is the ordification of T\n\n\n\n4\n\nTV\\to VT' iso\n\nT’ is an order-lifting of T\n\n\n\n5\n\nT\\to VT'D iso\n\nT'D is an order on T\n\n\n\n3\\Rightarrow 2\\Rightarrow 1 and 2\\Rightarrow 5 and 4\\Rightarrow 5. If Ord=Pre, then also 3\\Rightarrow 4.","type":"content","url":"/content/csp4-cospan-bisimulation-2#order-extensions","position":13},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"Span and cospan bisimulations"},"type":"lvl2","url":"/content/csp4-cospan-bisimulation-2#span-and-cospan-bisimulations","position":14},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"Span and cospan bisimulations"},"content":"The following result makes precise that every span bisimulation is a cospan (bi)simulation.\n\nProposition: Let T' be an order-extension of T. If two states in two T-coalgebras are T-span-bisimilar then they are T'-cospan-(bi)similar.\n\nProof: Let X\\to TX and Y\\to TY be two T-caolgebras. Let X\\leftarrow R \\rightarrow Y be a T-span bisimulation. Let R' be the cocomma of X\\leftarrow R \\rightarrow Y. Applying T' to the square\\begin{array}{}\n&&DR&&\\\\\n&\\swarrow&&\\searrow&\\\\\nDX&&&&DY\\\\\n&\\searrow&&\\swarrow&\\\\\n&&R'&&\n\\end{array}\n\nand using the arrow R\\to TR from the span-bisimulation the universal property of the cocomma R' gives the required arroe R'\\to T'R'. QED\n\nExamples: A number of familiar examples arise as instances of this proposition.\n\nT=\\mathcal P and T' the downset or upset or convex powerset functor: Every span-bisimulation is also a cospan-bisimulation. Moreover, if two points are bisimilar then they are forward-similar and backward-similar.\n\nT=Up\\mathcal P is the monotone neibhbourhood frame functor. T' is its ordification or also \\mathcal D\\mathcal U or also U^oD^o.\n\n...\n\nQuestions: Is there something more one can say about structural relationships between bisimulation and simulation? For example, one could try to isolate those functors for which forward simulation plus backward simulation is bisimulation, but I do not know how interesting this would be (is there a good abstract notion of “deterministic” functor?). Anything else?\n\nFor weak pullback preserving functors, we also have the converse of the previous proposition.\n\nProposition: Let T:Set\\to Set preserve weak pullbacks. If two states in two T-coalgebras are cospan-bisimilar then they are span-bisimilar.\n\nProof: Let R be a cospan bisimulation and X\\to R' \\leftarrow Y be the collage, hence cocomma, of R.  Let T' be the ordification of T. With the help of the iso DT\\to T'D we can consider the (R,R')-square as a cocomma in ordered sets. Cocommas are exact. Since ordifications T' preserve exact squares if T preserves weak pullbacks [Theorem 4.11,BKV15] , the (TR,T'R')-square is exact. But exact squares in posets are weak comma squares, hence there is an R\\to TR making R into a span bisimulation. QED","type":"content","url":"/content/csp4-cospan-bisimulation-2#span-and-cospan-bisimulations","position":15},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"Morphisms and Bisimulations"},"type":"lvl2","url":"/content/csp4-cospan-bisimulation-2#morphisms-and-bisimulations","position":16},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"Morphisms and Bisimulations"},"content":"In sets every function is a relation and every coalgebra morphism a bisimulation. In ordered sets every function f:X\\to Y gives rise to two relation f_\\diamond:X\\looparrowright Y and f^\\diamond: Y\\looparrowright X with(x,y)\\in f_\\diamond \\ \\Leftrightarrow \\ fx\\le y\n\\quad\\quad\\quad\\quad\n(y,x)\\in f^\\diamond \\ \\Leftrightarrow \\ y\\le fx\n\nProposition: Let T:Ord\\to Ord. If f is a T-coalgebra morphism, then f_\\diamond and f^\\diamond are cospan-(bi)simulations.\n\nProof: f_\\diamond and f^\\diamond are the weakening closures of the spans (id,f) and (f,id), respectively. Recall the definition of cospan-(bi)simulation and the fact that the collage of the weakening closure of a relation represented by a span (p,q) is the cocomma of (p,q). Now the proposition follows from the universal property of cocommas. QED\n\nExample: \n\nRecall that R is a \\mathcal D\\mathcal U-cospan-(bi)simulation iff\\begin{align}\nxRy \\ \\ \\Rightarrow \\ \\ & \n\\forall a\\in\\xi x.\\exists b\\in\\nu y. \\forall y'\\in b.\\exists x'\\in a.\\ x'Ry' \n\\end{align}\n\nWe also \n\nknow that f:X\\to Y is a morphism (X,\\xi)\\to(Y,\\nu) of \\mathcal D\\mathcal U-coalegbras iff\\begin{gather}\n\\forall a\\in \\xi x.\\exists b\\in\\nu(fx).\\forall y\\in b.\\exists x\\in a. fx \\le y\\\\[1ex]\n\\forall b\\in \\nu(fx).\\exists a\\in\\xi(x).\\forall x\\in a.\\exists y\\in b. \\ y\\le fx\n\\end{gather}\n\nIt is now easy to check that the first clause says precisely that f_\\diamond is a (bi)simulation and the second clause that f^\\diamond is a (bi)simulation. (I find this very pretty.)\n\nQuestion: Can we prove the converse of the proposition?  - - - This is interesting, I wrote out the obvious diagrams, but I didn’t see how to proceed. - - - Maybe the converse is only true in special cases?","type":"content","url":"/content/csp4-cospan-bisimulation-2#morphisms-and-bisimulations","position":17},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"Cospan (bi)simulations and change of base"},"type":"lvl2","url":"/content/csp4-cospan-bisimulation-2#cospan-bi-simulations-and-change-of-base","position":18},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"Cospan (bi)simulations and change of base"},"content":"Cospan (bi)simulations allow us to see ordinary coalgebraic bisimulations as well as quantale enriched ones in the same framwork. The basic picture, taken from Section 4 of [BKV19] is as follows. C\\dashv D\\dashv V take, respectively, connected components, discrete preorders and underlying sets. They lift via \n\ndoctrinal adjunction to coalgebras since the right adjoints satisfy DT_{Set}\\cong T_{Pre}D and VT_{Pre}\\cong T_{Set}V.\n\nOn the right-hand side, d' is the top and bottom preserving embedding with a right adjoint v' and, if \\Omega is non-trivial and integral, a left adjoint c'. The left ajoint c' maps all elements other than bottom to 1 and the right adjoint v' maps all elements other than top to 0. The adjunction d'\\dashv v' lifts to a Pre-enriched adjunction between the categories of coalgebras. If the quantale \\Omega has no zero-divisors, then c' is a quantale-morphism and c'\\dashv d' lifts to \\Omega-cat enriched adjunction between categories of coalgebras. See Propositions 4.9 and 4.10 of [BKV19] for details.\n\nPropositions ?? ... I think, mutatis mutandis, we can move the two propositions above from the left Set/Pre column to the right Pre/\\Omega-cat column ...\n\nExamples ?? Can we make an example of ordinary transition systems and bisimulation and then a metric example? Are there scenarios where one would want an orderd coalgebra as an abstraction of a metric coalgebra? I never really looked so much at Kripke frames over metric spaces ... any ideas?","type":"content","url":"/content/csp4-cospan-bisimulation-2#cospan-bi-simulations-and-change-of-base","position":19},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"References"},"type":"lvl2","url":"/content/csp4-cospan-bisimulation-2#references","position":20},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"References"},"content":"Balan, Kurz, Velebil: \n\nPositive fragments of coalgebraic logics. 2015.\n\nBalan, Kurz, Velebil: \n\nExtending set functors to generalised metric spaces. 2019.\n\nJacobs\n\nHughes-Jacobs","type":"content","url":"/content/csp4-cospan-bisimulation-2#references","position":21},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"Further"},"type":"lvl2","url":"/content/csp4-cospan-bisimulation-2#further","position":22},{"hierarchy":{"lvl1":"Cospan Bisimulation 2","lvl2":"Further"},"content":"Scratch notes on \n\nexact squares\n\nA quantale is integral if the neutral element of the multiplication is the top element.","type":"content","url":"/content/csp4-cospan-bisimulation-2#further","position":23},{"hierarchy":{"lvl1":"Polyonomial Functors"},"type":"lvl1","url":"/content/polynomial-functors","position":0},{"hierarchy":{"lvl1":"Polyonomial Functors"},"content":"(under construction)\n\nWe use \\mathcal P for the powerset functor and \\mathcal H X=2^{2^X}. In this section we indicate how to construct a modal logic for any functor T built according to the following context-free grammar.T ::= Id \\mid K_C \\mid T \\times T \\mid T + T \\mid \\mathcal P T \\mid \\mathcal H T\n\nWe describe functors L:\\BA\\to\\BA or L:\\BA\\times\\BA\\to\\BA\nby generators and relations as follows.\n\nL_{K_C}(A) is the free \\BA given by generators c\\in C\nand satisfying c_1\\wedge c_2=\\bot for all c_1\\not=c_2 and \\bigvee_{c\\in\n  C} c = \\top.\n\nL_+(A_1,A_2) is generated by [\\kappa_1]a_1,\n[\\kappa_2]a_2, a_i\\in A_i where the [\\kappa_i] preserve finite\njoins and binary meets and satisfy [\\kappa_1] a_1\\wedge\n[\\kappa_2]a_2=\\bot, [\\kappa_1]\\top\\vee [\\kappa_2]\\top=\\top,\n\\neg[\\kappa_1]a_1=[\\kappa_2]\\top\\vee[\\kappa_1]\\neg a_1,\n\\neg[\\kappa_2]a_2=[\\kappa_1]\\top\\vee[\\kappa_2]\\neg a_2.\n\nL_\\times(A_1,A_2) is generated by [\\pi_1]a_1,\n[\\pi_2]a_2, a_i\\in A_i where [\\pi_i] preserve Boolean\noperations.\n\nL_\\mathcal P(A) is generated by \\Box a, a \\in A, and \\Box\npreserves finite meets.\n\nL_\\mathcal H(A) is generated by \\Box a, a \\in A (no equations).\n\nFor the semantics, we define Boolean algebra morphisms \\delta_T\n\nL_{K_C}\\Pi X \\to \\Pi C  by  c\\mapsto \\{c\\},\n\nL_+(\\Pi X_1,\\Pi X_2) \\to \\Pi(X_1+X_2)  by  [\\kappa_i]a_i\\mapsto a_i,\n\nL_\\times(\\Pi X,\\Pi Y) \\to \\Pi(X_1\\times X_2)  by  [\\pi_1]a_1\\mapsto a_1\\times X_2, [\\pi_2]a_2\\mapsto X_1\\times a_2,\n\nL_\\mathcal P \\Pi X\\to \\Pi\\mathcal P X  by  \\Box a \\mapsto \\{b\\subseteq\nX\\mid b\\subseteq a\\},\n\nL_\\mathcal H \\Pi X\\to \\Pi\\mathcal H X  by  \\Box a \\mapsto \\{s\\in \\mathcal H X\n\\mid a \\in s \\}.\n\nand extend them inductively to \\delta_T:L_T\\Pi\\to\\Pi T  for all\nT. Items (1)-(3) are slight variations of cases appearing in\n\n\nAbramsky (1991), (4) is in \n\nAbramsky (2005), and \\delta_X in (5) is given by\nthe identity on 2^{2^{2^X}}.","type":"content","url":"/content/polynomial-functors","position":1},{"hierarchy":{"lvl1":"Introduction"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Introduction"},"content":"(under construction ... notes from \n\nhackmd moved here now)\n\nCoalgebraic logic, in the wider sense of coalgebraic methods applied to (modal) logic, started in the late 1990ies with Larry Moss’s article \n\nCoalgebraic Logic in which he presented what is today considered one of several coalgebraic logics. In these notes I will take the particular view that a modal or coalgebraic logic is given by a functor L on the category of Boolean algebras (or another suitable variety of algebras).\n\nTo distinguish this approach from other approaches to coalgebraic I sometimes call it functorial modal logic or functorial coalgebraic logic.\n\nThese notes consist of the following parts.\n\nModal Logic is a very brief introduction to modal logic with pointers to the literature. I will try to write the other parts so that they do not depend too much on Part 1, but it is natural to view coalgebraic logic as an extension and generalisation of modal logic.\n\nOverview of Coalgebraic Logic shows how the Kripke frames of  Modal Logic and various models of computation of Domain Theory are unified and generalised by the notion of a coalgebra X\\to TX for a functor T. We review the various parameters along which the theory of coalgebras can be developed.\n\nParadigmatic Examples could be a good place to start. The examples are  of interest in their own right and have been studied long before coalgebra became a research area. We look in more detail than above at Kripke frames and powerdomains .. add more on probabilistic transition systems and neighbourhood coalgebras.\n\nIntroduction to Coalgebraic Logic makes use of the concept of a modal logic as a functor mostly as a linguistic device facilitating concise notation. One immediate benefit is that the notion of a modal algebra as an algebra LA\\to A for a functor L (the Logic) dualises the notion of coalgebra X\\to TX for a functor T (the type of the transition). In fact, we will see that we can create a logic L from T by dualising T in a technically precise sense (provided by Stone duality and category theory) and then presenting the functor L by modal operators and equations.\n\nPart 5 on Functorial Modal Logic develops the particular category theoretic methods that allow us to reason about coalgebraic models on the level of abstraction of functors and natural transformations, abstracting as much as possible from the concrete definition of a particular logic. These methods can be used to prove general theorems parametric in functors L and T (invariance of formulas under bisimilarity, completeness, expressiveness), are useful to relate different logics and become particularly valuable for moving away from set-based models and classical propositional logic. The connection between abstract coalgebraic logics (given by a functor) and concrete coalgebraic logics (given by operations and equations) is facilitated by the notion of a presentation of a functor by operations and equations.\n\nPart 6 on Cospan (Bi)Similarity presents a new take on the notion of behavioural equivalence (coalgebraic bisimilarity). While it has been known since Worrell’s PhD Thesis that one can use cospans (aka collages) to describe coalgebraic similarity in the quantale-enriched setting, we show that the quantale-enriched setting contains behavioural equivalence of ordinary coalgebras as a special case.\n\nPart 7 on Ordered Coalgebras starts the development of coalgebra over enriched categories.\n\nPart 8 will extend Part 7 to quantale-enriched coalgebra.\n\nOrdered Coalgebras starts the development of coalgebra over enriched categories.\n\nQuantale-Enriched Coalgebra ...","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Introduction","lvl2":"Acknowledgements"},"type":"lvl2","url":"/#acknowledgements","position":2},{"hierarchy":{"lvl1":"Introduction","lvl2":"Acknowledgements"},"content":"These notes have been written in discussions with Adriana Balan, Daniel Briseno, Luke Burns, Justin Dressel, Jim de Groot, Helle Hansen, Peter Jipsen, Nima Motamed, Drew Moshier, Wolfgang Poiger, Bruno Teheux, Yde Venema, Jeremy Wayland and others.","type":"content","url":"/#acknowledgements","position":3},{"hierarchy":{"lvl1":"Introduction","lvl2":"Bibliography"},"type":"lvl2","url":"/#bibliography","position":4},{"hierarchy":{"lvl1":"Introduction","lvl2":"Bibliography"},"content":"(just started)","type":"content","url":"/#bibliography","position":5}]}